[{"uri": "65a543f54f884a0795d1090727995ef3", "title": "Lagos Community Accuses Eko Electricity Distribution Company, EKEDC Of Multiple Billings On Single Meters", "body": "The residents of Ajegunle under the aegis of Ajegunle Peoples Movement (APM) in Lagos State have accused Eko Distribution Company (EKEDC) of illegal billing in the area.\n\nThe group condemned EKEDC for issuing two separate bills to single meters in many compounds in Ajegunle, including Layinka, Arumoh, Nosamu, Orodu, Tolu and Aiyetoro.\n\nAPM in a statement signed by Moshood Oshunfurewa Adebola for the organisaton, described the billing as not only an extortion but a deliberate attempt to further impoverish electricity consumers of Ajegunle, who are already struggling under the weight of severe economic hardship and the failure of governance.\n\nIt called on the EKEDC management, Apapa district, and all marketers involved to immediately recall the fraudulent bills and refrain from disconnecting power supply to any consumer based on the “fraudulent bills”. According to the group, failure to comply with this demand will result in collective community action to “resist these injustices”.\n\nThe statement reads in part, \"Our investigation has revealed that this parasitic action by EKODISCO is not backed by the National Electricity Regulation Commission (NERC) or any extant law or regulation.\n\n“As such, we categorically reject these fraudulent bills and state unequivocally that the community will not pay. The actions of EKODISCO are extortionist and exploitative and cannot stand.\n\n\"It is particularly disheartening to note that despite multiple national newspaper publications revealing that the Federal Government of Nigeria has provided over N21 billion for the provision of free prepaid meters, which EKODISCO has benefited from, residents of Ajegunle, particularly those subjected to this double billing, have yet to receive these meters, rather the DISCOs force consumers to pay over N110,000 for one-phase prepaid meter and over N215,000 for three-phase prepaid meter.\n\n\"We view this move by EKODISCO as an illegal strategy to increase the debt burden of Ajegunle residents, thereby creating a pretext for the company to impose fictitious conditions before granting free prepaid meters. This is an unacceptable exploitation of the people, and we shall resist it.\n\n\"We, therefore, call on the EKODISCO management, Apapa district, and all marketers involved to immediately recall these fraudulent bills and refrain from disconnecting any consumer based on the fraudulent bills. Failure to comply with this demand will result in collective community action to resist these injustices.”\n\n\"The APM remains committed to defending the rights and welfare of the people of Ajegunle and will continue to hold EKODISCO accountable for any actions that undermine the well-being of our community people,\" the statement added.", "publication_datetime": "2024-08-15T14:01:03+00:00", "lang": "en", "url": "https://saharareporters.com/2024/08/15/lagos-community-accuses-eko-electricity-distribution-company-ekedc-multiple-billings", "source": {"domain": "saharareporters.com", "location": null}}, {"uri": "f321ea0563d542bfab0d21b5caba1f1b", "title": "San Onofre inspection notes two low-level violations", "body": "The Nuclear Regulatory Commission popped in for a regular look-see at San Onofre Nuclear Generating Station in June, concluding that decommissioning work was pretty much on schedule and radiological work areas were “adequately controlled.”\n\nSouthern California Edison self-reported two low-level violations: The first involving a “failure to ensure a package for shipment was leakproof and properly closed and sealed to prevent release of radioactive content as required by U.S. Department of Transportation regulations,” and the second involving a “failure to ensure, by examination or appropriate tests, that the packaging for the Unit 2 pressurizer (main function: to keep reactor’s coolant below boiling) was proper for the contents being shipped as required by DOT regulations.”\n\nThe NRC said those were low-level violations — Severity Level IV (less serious but of more-than-minor concern; Levels I and II can be considered the bad boys). Since Edison and its decommissioning contractor placed the two deficiencies into a “corrective action program,” and since the safety significance was low, and since the violations “were non-repetitive and not willful,” Edison was not cited, according to the inspection report.\n\nA Unit 2 pressurizer leaked water at a railyard in San Bernardino County while being shipped offsite for disposal, Edison spokesman Jeff Monford said.\n\nIt leaked about one drop every two minutes, was stopped and sealed, and the deck of the rail car was cleaned. Radiological surveys found no detectable radioactivity above background levels on or around the component, and there was no threat to public health or the environment, Monford said.\n\nThe second component, the pressurizer from Unit 3, did not leak; it was stationed at the same railyard while en route to the offsite disposal facility. Both components were returned to San Onofre on July 4 and will remain on site “while an evaluation is being conducted to learn from this event and avoid recurrence with similar components.”\n\nThere’s no date for wrapping up that evaluation just yet.\n\nThe NRC inspectors reviewed the plant’s radioactive waste treatment, effluent and environmental monitoring; remedial and final surveys; fire protection program; and solid radioactive waste management in addition to the transportation of radioactive materials.\n\nIt was a routine, announced inspection, and Edison et al. “were found to be conducting activities in accordance with site procedures, license requirements, and applicable NRC regulations” with those two exceptions.\n\nCleanup of the reactor cavities was slightly behind the original schedule, but “commensurate with the challenges encountered.” Non-radioactive buildings were being demolished during the inspection, and “inspectors observed that good industrial safety controls were in place including use of water cannons to suppress the dust created by demolition activities.”\n\nOf interest: Procedural and radiological controls for the environmental monitoring program, including the planned drain down of the Unit 3 reactor cavity, were in place, and “good health physics and operational preplanning controls were in place to support the drain down,” the NRC said. (The release of wastewater from the plant, happening regularly for decades, remains a concern for some.)\n\nEdison is also doing ongoing radiological surveys of the north and south ocean-sidebluffs, which hadn’t been included in the historical site assessment, “to demonstrate that the areas had not been impacted by previous plant operations.” Surface scans for gamma radiation and soil sampling for radionuclides were done properly and found no detectable plant-related radionuclides, the report and Monford said.\n\nThose results support Edison’s classification of the bluffs as a “non-impacted area” in its complex License Termination Plan.\n\nEdison reviewed the NRC’s findings with its decommissioning contractor and workers, “and we remain committed, in our oversight role, to ensuring safety and adherence to all regulatory requirements,” Monford said.", "publication_datetime": "2024-08-15T14:00:33+00:00", "lang": "en", "url": "https://www.pasadenastarnews.com/2024/08/15/san-onofre-inspection-notes-two-low-level-violations/", "source": {"domain": "pasadenastarnews.com", "location": {"country": "us", "state": "CA", "city": "Pasadena", "coordinates": {"lat": 34.1476507, "lon": -118.144155}}}}, {"uri": "5f0b21d2bee44f628dce19befb0a0a36", "title": "Top News on August 15: Independence Day celebrations, Ola’s e-bike launch, Kolkata doctor rape-murder row and more", "body": "India marked 78 years of Independence on Thursday as outrage over the rape and murder of a Kolkata doctor continued across the country. Ola Electric Mobility announced the launch of a new motorcycle series while reports indicated new Starbucks CEO Brian Niccol could make well in excess of $100 million in his first year. Meanwhile the State Bank of India has increased interest rates on loans by 10 basis points across tenors from August 15.", "publication_datetime": "2024-08-15T14:00:14+00:00", "lang": "en", "url": "https://www.livemint.com/news/india/top-news-on-august-15-independence-day-celebrations-olas-e-bike-launch-kolkata-doctor-rape-murder-row-and-more-11723728481361.html", "source": {"domain": "livemint.com", "location": null}}, {"uri": "7ad954a889534b919fe425c3b66ae752", "title": "Dr Disrespect Brags About Being On Vacation Amidst Controversy Over Messaging Minor", "body": "Earlier this year, 42-year-old streamer Herschel \"Guy\" Beahm, AKA Dr Disrespect, admitted to inappropriately messaging an \"individual minor\" back in 2017, but denied all legal and criminal wrongdoing. After the allegations surfaced and he was demonitised by YouTube, banned from Twitch, and even cut off by his own studio, he took a vacation and even considered hanging up streaming.\n\nHowever, at the end of last month, he teased a comeback with a photo of him playing chess while the audience plays checkers (bizzarely hinting at this being part of some long game), and only yesterday, deleted the tweet in which he admitted to inappropriately messaging a minor—of course, that hasn't erased the myriad screenshots people took.\n\nNow, he's bragging about how much he's enjoying his vacation, despite the backlash to the behaviour he himself admitted to that led to his hiatus to begin with; \"Vacation is just too good right now. We'll be back soon though Champs. We have lots to talk about.\" No doubt, he's referring to his big comeback, although most of the replies and quote retweets are poking fun at him, while he haemorrhages subscribers across all platforms.\n\nOn June 22, Dr Disrespect was accused of using Twitch Whispers to inappropriately message a minor by former CPM explainer Cody Conners. This is, according to Conners, why Dr Disrespect was banned from the platform, which up until that point was a mystery.\n\nSeveral people came foward to support Conners' claims, with Twitch employee Zachary Diaz tweeting, \"so glad it's finally out there\", while esports reporter Rod Breslau simply said, \"I didn't lie\". At first, Dr Disrespect denied the allegations, but his studio Midnight Society quickly announced that it would be \"terminating [its] relationship with Guy Beahm\".\n\nLater, Dr Disrespect admitted to messaging a minor, but we don't know what exactly was said between the two parties. Regardless, it was enough for Twitch to ban him, YouTube to demonetise him, and his own studio to completely distance itself from him.", "publication_datetime": "2024-08-15T14:00:09+00:00", "lang": "en", "url": "https://www.thegamer.com/dr-disrespect-brags-about-vacation-after-messaging-minor-controversy-announcement-imminent/", "source": {"domain": "thegamer.com", "location": null}}, {"uri": "a85449ad7554443385dfbb4cd1b754d4", "title": "Scandalul de la Spitalul Sf. Pantelimon. Decesele s-au redus cu aproape 50% după ancheta privind crimele de la ATI", "body": "Rata deceselor registered in the section ATI a Spitalului ”Sfântul Pantelimon” a sloat la halfe după ce una dintre assistant a depus slâgere privind slohdea doselor de noradrenalină, súşa statisticile puse la dispoziţie de spital magistraţilor.", "publication_datetime": "2024-08-15T14:00:01+00:00", "lang": "sw", "url": "https://jurnalul.ro/stiri/social/scandal-spital-sf-pantelimon-decese-scazut-50-973149.html", "source": {"domain": "jurnalul.ro", "location": null}}, {"uri": "3c6955a878024476b67da4554f33ba5d", "title": "City, SAWS point fingers as Final Four derails South Alamo project", "body": "The city and its water utility are at a stalemate over who should take on the liabilities and associated costs for a downtown project that’s already been delayed more than a decade and now will be left only partially complete so the street can be closed up ahead of the Final Four in April.\n\nRepaving the street will leave in place century-old water and sewer mains that the city has been trying to replace since 2012. Instead, it will patch the sewer line and leave the water main untouched.\n\nIf either fails, millions of gallons of water could spill out and pressure could be lost, even putting the city’s water supply at risk.\n\nOver the last week, finger-pointing between the city and the San Antonio Water System has expanded to include the city’s contractor, Sundt Construction, which says SAWS or its subcontractor, HDR Engineering, failed to do sufficient pre-construction work on the project. SAWS says Sundt was responsible for that work.\n\nSAWS’ board of trustees learned last Tuesday that the original replacement project has basically been abandoned so that the street can be closed in time for tens of thousand of visitors to descend on the Alamodome.\n\nTrustees balked over the city’s request that SAWS sign a memorandum of understanding agreeing to pay half the street repair costs if the mains break in the next decade.\n\nThe replacement of the mains was originally part of the city’s 2012 bond program. VIA’s hopes to run street cars along South Alamo first delayed the project, although those plans never came to fruition. The main replacement was then pushed to the 2017 bond program, delayed again by both the pandemic and construction at Hemisfair’s Civic Park, city officials said.\n\nWhen work finally started in 2021, the project’s price tag was estimated at $36.6 million. No one can say at this point what the final cost will be.\n\nCity officials told the San Antonio Report on Monday that SAWS’ failure to properly identify where its underground chilled water lines are on South Alamo Street “contributed significantly to the project’s delays.”\n\nSAWS refuted that charge by pointing to pre-construction documents that the utility says show “the contractor,” or Sundt, was responsible for this investigative work.\n\nWhen Sundt crews started construction in December 2021 — a month after being selected for the project — they hit existing chilled water lines in the spot they where they were going in to add more, Sundt’s senior vice president and corporate strategic business officer John Carlson said.\n\n“That shows me someone didn’t do their job during the design phase,” Carlson said, adding that Sundt was not hired as the designer in this case, just as the builder. “Everything snowballed from that.”\n\nAlong with the city’s prolonged renovations of the St. Mary’s Strip, the Broadway Corridor and Zona Cultural, the South Alamo Street project delays have just added to downtown construction headaches. Those frustrations have recently pushed small business owners to get more involved in upcoming city elections in an effort to hold the city accountable.\n\nIn response to constituents’ complaints, Councilwoman Sukh Kaur (D1) filed a council request earlier this summer to revise the city’s construction process. Namely, it asks that the city states ahead of a project which party is responsible for identifying the existing underground infrastructure.\n\nThat request is set to go before the council’s governance committee Friday.\n\nIn older parts of downtown, maps showing where the city’s utility lines lie are often outdated — meaning pre-construction work includes verifying where they actually are, said Assistant City Manager John Peterek.\n\nThis can sometimes involve a process called “potholing,” or the drilling of exploratory holes to properly locate underground utilities. The city and Sundt allege SAWS or its design subcontractor, HDR Engineering, didn’t do enough of this type of investigative work prior to the first day of construction, meaning the designs the contractor was using were incorrect.\n\n“SAWS owns all water and wastewater lines in San Antonio, and it is their responsibility to identify and manage their part of any capital improvement project involving utilities,” Peterek told the San Antonio Report. “On South Alamo, SAWS did not accurately locate their chilled water lines during the project’s design.”\n\nSAWS President and CEO Robert Puente on Tuesday pointed to language in the pre-construction bid that “the contractor shall verify the exact location of underground utilities … 1-2 weeks prior to construction whether shown on plans or not.” He says this shows that the responsibility lies with Sundt.\n\nPuente did acknowledge that the utility’s subcontractor HDR Engineering “had some deficiencies in their design,” and so is “partially responsible” — though less so than the primary contractor, Sundt.\n\nOn Wednesday, Carlson said those sections of the bid documents are simply referring to Sundt’s responsibility to call the state’s “Call Before You Dig” service and get the above ground infrastructure paint marked, which he said Sundt did. Carlson reiterated that the “designer” — whether SAWS or HDR Engineering in this case — is the party responsible for the pre-construction investigative underground work under the law.\n\nSAWS chief operating officer Andrea Beymer acknowledged that there probably should be clearer guidelines for all parties on joint construction work moving forward. “As we look at certain projects, particularly in the downtown area, identifying those that we need to do more subsurface investigation work” will be important, she said.\n\nRegardless of who’s at fault, Puente told the San Antonio Report that SAWS is now working with HDR Engineering, as well as the city, to find a way forward.\n\nIt’s unclear if Kaur’s council request will be sufficient to avoid this type of confusion in the future. She told the San Antonio Report Tuesday that the city needs more clarity about the roles and responsibilities each entity takes on within these long, complicated projects. Doing so could help prevent delays that have bedeviled residents and small businesses alike, Kaur said.\n\nFor now, construction on the South Alamo project continues in order to meet a deadline imposed by a basketball tournament, with additional costs to the taxpayer remaining unclear.\n\nThe Final Four could generate an economic impact of as much as $220 million, say boosters.", "publication_datetime": "2024-08-15T14:00:00+00:00", "lang": "en", "url": "https://sanantonioreport.org/final-four-south-alamo-san-antonio-water-main-replacement-city-response/", "source": {"domain": "sanantonioreport.org", "location": null}}, {"uri": "e0baccca683e4dc0bd6c371334e6e81f", "title": "Tropical Storm Ernesto Drenches Puerto Rico, Leaves Half the Island Without Power", "body": "Half of Puerto Rico was left dark Wednesday after Tropical Storm Ernesto downed power lines and dumped more than 10 inches of rain on some parts of the island. Thousands have been left without access to running water amid soaring temperatures, with the heat index approaching 110 degrees. The for-profit company operating Puerto Rico’s grid, LUMA Energy, said it was focused on restoring power to hospitals and essential services like water and sanitation. It’s the latest in a series of power outages since Puerto Rico privatized its electrical grid in the wake of 2017’s devastating Hurricane Maria. Despite the persistent blackouts, Puerto Ricans pay some of the highest electricity rates in the U.S.", "publication_datetime": "2024-08-15T13:59:40+00:00", "lang": "en", "url": "https://www.democracynow.org/2024/8/15/headlines/tropical_storm_ernesto_drenches_puerto_rico_leaves_half_the_island_without_power", "source": {"domain": "democracynow.org", "location": null}}, {"uri": "a10d52a35aa644b6ab9da2e24430ab06", "title": "Amentum 401(k) Suit Expands to Include Forfeiture Usage Claim", "body": "Litigation over the retirement plan sponsored by will expand to include allegations challenging how the defense and security contractor handles plan contributions forfeited by departing employees.\n\nMagistrate Judge Brooks G. Severson on Wednesday allowed the plaintiff leading the proposed class action to file an amended complaint adding allegations that Amentum wrongly used more than $870,000 in plan forfeitures to reduce the contributions it would otherwise have to make to the plan, instead of putting that money toward the expenses paid by workers. Amentum said the plaintiff waited too long to add these allegations, but ...", "publication_datetime": "2024-08-15T13:58:10+00:00", "lang": "en", "url": "https://news.bloomberglaw.com/class-action/amentum-401k-suit-expands-to-include-forfeiture-usage-claim", "source": {"domain": "news.bloomberglaw.com", "location": null}}, {"uri": "a9c8ec51cdde4f828e3032bfab8f060f", "title": "Over 120 jobs gone as modular housebuilder enters administration", "body": "Over 120 jobs gone as modular housebuilder enters administration\n\nAdministrators have been appointed at a Coventry modular housebuilder after struggling with rising costs and relocation issues.\n\nModpods International entered administration on August 12, 2024, with Paul Ellison and Christopher Errington of KRE Corporate Recovery appointed as joint administrators.\n\nBefore the administration process began, efforts were made to sell the business and its assets as a going concern, but no buyer was found.\n\nConsequently, on July 11, 2024, all 122 employees were made redundant.\n\nThe administrators have now finalise a pre-pack sale of the company’s assets to HPG Developments.\n\nModpods specialised in designing and constructing modular buildings, cited the costly and prolonged relocation of its trading premises as a key factor in its insolvency.\n\nThis, coupled with a client dispute and challenging trading conditions, severely impacted the company’s cash flow.", "publication_datetime": "2024-08-15T13:56:36+00:00", "lang": "en", "url": "https://www.thebusinessdesk.com/westmidlands/news/2089350-over-120-jobs-gone-as-modular-housebuilder-enters-administration", "source": {"domain": "thebusinessdesk.com", "location": null}}, {"uri": "e26d3cf3a365422baca6bdc34cc66587", "title": "Baker Tilly's UK arm censured by FCA over audit failings", "body": "Auditor MHA has been censured by the Financial Conduct Authority (FCA) for “failing” to prepare client assets reports to the “required standard”.\n\nMHA, formally known as MacIntyre Hudson until its re-brand in 2019, is the independent UK and Ireland arm of the global consulting firm of Baker Tilly International.\n\nThe FCA’s stated the firm failed to prepare client assets reports in accordance with the terms of a reasonable assurance engagement.\n\nIts investigation found that between 2015 and 2019, the firm failed to prepare four client assets reports (relating to two firms) to the required standard.\n\nIt also noted that it failed to report 25 breaches of the rules by firms it had audited, which ranged from failings in documentation, to firm’s assets being held alongside client assets.\n\nThe FCA stated that “client asset protection is a key part of maintaining market confidence, financial stability and consumer protection.”\n\nThe regulator explained that “firms that hold client assets are required to have an auditor provide a client assets report to the FCA on an annual basis except in limited circumstances.”\n\n“The FCA relies on the accuracy of these client assets reports to monitor whether firms are complying with its rules, so it is important that auditors ensure their reporting is accurate,” it added.\n\nThe regulator published that MHA “failed to notify” it of rule breaches by firms it had audited, adding it “could have put customers’ money at risk”.\n\nWhile the FCA considers MHA’s “failings to be serious”, it added that the impact on consumers from the unreported breaches would not have resulted in significant harm in the event of firm failure. Therefore, it revealed “it is appropriate to issue a public censure in this case“.\n\nTherese Chambers, joint executive director of enforcement and market oversight at the FCA, said: “In a first of its kind, this censure underscores the important role that auditors play in providing accurate reports on whether firms are complying with our rules.”\n\n“This information helps us to safeguard customer funds and reduce the harm caused by firm failures. We expect all firms to ensure that they’re providing full and accurate reports,” she added.\n\nWhile a spokesperson for MHA stated “client asset protection is critical to market confidence and MHA takes its responsibilities in this area very seriously.”\n\n“MHA co-operated fully with the FCA’s investigation including making proper admissions where the firm felt that its work fell below the high standards expected by MHA.”\n\n“Since the period in question, we have invested further in a dedicated and specialist team with enhanced expertise to handle Client Asset Sourcebook audits,” they added.\n\nThe spokesperson added that the firm “acknowledges the censure”, adding “we are sorry that on this occasion our work fell below the standard required.”\n\n“We also note that the FCA has considered that no significant harm would have resulted from any of the unreported breaches and subsequently no financial penalties have been issued.”\n\n“We remain committed to maintaining the highest standards of accuracy and integrity in our reporting as well as all aspects of audit quality generally,” the spokesperson concluded.", "publication_datetime": "2024-08-15T13:56:18+00:00", "lang": "en", "url": "https://www.cityam.com/baker-tillys-uk-arm-censured-by-fca-over-audit-failings/", "source": {"domain": "cityam.com", "location": null}}, {"uri": "017fef088e5a4a9a8127a1fa203eafae", "title": "Dylan McGrath closes two Dublin restaurants as business is 'simply not sustainable'", "body": "Two restaurants in Dublin city owned by celebrity chef Dylan McGrath are set to close with customers being told that business is “simply not sustainable anymore”.\n\nThe restaurants which are due to close immediately are Brasserie Sixty6 and Rustic Stone, both of which are located on South Great George’s Street.\n\nCustomers who attempt to book a table at either of the restaurants are now met with a message that reads: “Unfortunately, after many successful years, we've made the very difficult decision to close our Brasserie Sixty6 and Rustic Stone Venues.”\n\n“Both have been very successful restaurants in Dublin City for a long time, but the time has come where we have decided it's simply not sustainable anymore.”\n\nThe message goes on to say if a customer has an existing booking coming up, they will be contacted in the coming days. Mr McGrath’s Fade Street Social restaurant will continue to operate as usual.\n\nIn May, it was reported that the company behind Rustic Stone — Prime Steak Ltd — posted profits of €2.75m last year mainly as a result of debt writedowns. This was after posting losses of nearly €900,000 the prior financial year.\n\nThe company went through the Small Company Administrative Rescue Process (SCARP) which allows firms to restructure their debts and continue to do business.\n\nThis comes following figures by the Restaurants Association of Ireland which showed that more than 570 restaurants, cafes, and other food businesses have permanently shut their doors since last September.\n\nThe Restaurant's Association of Ireland (RAI) has published new data that reveal the extent of closures across the sector amid rising business costs and the end of the temporary Vat reduction for the sector. A total of 45 restaurants, cafés, and other food-led businesses ceased trading in July alone, according to the RAI.", "publication_datetime": "2024-08-15T13:56:00+00:00", "lang": "en", "url": "https://www.irishexaminer.com/business/companies/arid-41456782.html", "source": {"domain": "irishexaminer.com", "location": null}}, {"uri": "b4381943a5be4b20acb3d901601961b4", "title": "'Lacking information': Chile regulator kicks back Colbun's 800MW pumped hydro project environmental review", "body": "Colbun submitted its environmental impact study (EIS) in June 2024, but earlier this week (12 August), the Environmental Assessment Service (SEA) for Antofagasta issued an ‘early termination notice’.\n\nIts notice said information was missing, which would not allow the assessment to proceed in the appropriate manner. The missing information, the service said, meant it couldn’t rule out whether it would have a significant impact on local flora and fauna as well as human populations that are part of the indigenous peoples of Paposo.\n\nOne specific issue was the lack of consideration for how the construction of a cable car related to the project would affect wildlife on the cliff face.\n\nIt also omitted to mention that two groups of indigenous communities belonging to the Chango People live less than 500m from the site.\n\nOf the eight communities that were addressed in Colbun’s EIS, the resolution found that three said the project would not affect them while five said the construction would limit their movement and obstruct their ability to collect coastal plants for medicinal uses and graze cattle.\n\nIn a Spanish-language press release published on BNAmericas two days after the early termination notice, Colbun said it disagreed with the reasons given by the Antofagasta SEA for doing so.\n\nThe Paposo project would entail US$1.4 billion of investment. The overall energy storage capacity of the project hasn’t been revealed, but PHES technology would typically have a discharge duration of 6-20 hours, meaning anywhere from 4.8GWh to 16GWh in this case.\n\nColbun is also deploying battery energy storage systems (BESS) in Chile, with the first of some 800MW coming online in late 2022.\n\nIn a related development, Colbun entered into a memorandum of understanding (MOU) with high-density PHES technology company RheEnergise last year to explore the potential of a smaller system in Chile using RheEnergise’s technology.\n\nYou can read the Spanish-language EIA documents from the Chilean government pertaining to the Paposo project here. See a Spanish-language video render of the project from Colbun on Youtube below.\n\nEnergy-Storage.news’ publisher Solar Media will host the 3rd annual Energy Storage Summit Latin America in Santiago, Chile, 15-16 October 2024. This year’s event brings together Latin America’s leading investors, policymakers, developers, utilities, network operators, EPCs and more all in one place to discuss the landscape of energy storage in the region. Visit the official site for more info.", "publication_datetime": "2024-08-15T13:55:32+00:00", "lang": "en", "url": "https://www.energy-storage.news/lacking-information-chile-regulator-kicks-back-colbuns-800mw-pumped-hydro-project-environmental-review/", "source": {"domain": "energy-storage.news", "location": null}}, {"uri": "5a5d8c8c4c9b4a3fb3c09144af41c41c", "title": "Rite Aid to Shut All Michigan Stores Amid Ongoing Financial Struggles", "body": "Rite Aid, the long-standing pharmacy chain, is set to permanently close down all its stores in the state of Michigan. This move includes shutting down 186 stores and comes off the back of the company's bankruptcy filing last year. The company confirmed that this change is a part of Rite Aid's efforts to operate efficiently while meeting the needs of our customers, communities, associates, and overall business. As per ClickOnDetroit, Rite Aid stated, \"While we have had to make difficult business decisions over the past several months to improve our business and optimize our retail footprint, we are committed to becoming financially and operationally healthy.\"\n\nThe phasing out of Rite Aid’s presence in Michigan is slated to be completed by the end of September. The forthcoming closure of its Waterford distribution center, scheduled tomorrow, will lead to the abrupt end of employment for 191 workers, as disclosed to journalists by the company in June. A review by Bridge Michigan of bankruptcy court documents indicates that, in less than a year, at least 230 Rite Aid stores in Michigan will have closed. As Bridge Michigan has learned, these closures are part of a larger contraction within the pharmacy market, which has seen a significant reduction in both corporate and independent pharmacies due to various market pressures.\n\nOn the subject of employment for those affected, John Cakmakci, president of Local 951 of the United Food and Commercial Workers, told Bridge Michigan that many pharmacy employees have been able to find new positions with relative ease. \"For those that want to continue employment, it's an easy job market to find one,\" Cakmakci pointed out, as per Bridge Michigan. This news comes during a time when pharmacies are already contending with financial struggles, such as diminishing reimbursements and the increased take of revenues by benefits managers.\n\nThe transition away from brick-and-mortar pharmacies like Rite Aid may exacerbate the problem for particular groups, such as older residents or those with complex health conditions. Eric Roath, director of government affairs of the Michigan Pharmacists Association, emphasized this point, drawing attention to the fact that some patients \"require a higher level of service than mail order and online solutions typically provide.\" He also noted pharmacies' role in offering vaccines and tests for ailments such as flu and COVID, as cited by Bridge Michigan.\n\nFor Rite Aid customers in Michigan, the imminent closings translate to the need to swiftly secure new establishments for their prescriptions. Rite Aid is advising customers to verify where their prescriptions will be transferred and to request any necessary changes to ensure continuity of care. With \"Store Closing\" signs becoming increasingly visible on the stores’ facades, end-of-an-era sentiments are evident amongst the community. As reported by MLive, customers should communicate with Rite Aid to manage their prescriptions ahead of the scheduled closures.", "publication_datetime": "2024-08-15T13:55:29+00:00", "lang": "en", "url": "https://hoodline.com/2024/08/rite-aid-to-shut-all-michigan-stores-amid-ongoing-financial-struggles/", "source": {"domain": "hoodline.com", "location": null}}, {"uri": "7d0e7176feb8400bb1dfdd2d0f20720c", "title": "Google monopoly ruling: where the tech giant goes from here", "body": "A US judge has found that Google is a monopoly and has used this dominance to reinforce its market position.\n\nThis ruling, which is subject to appeal, brings the US regulator close to the European Commission in its approach to tech giants such as Google, Meta, and Amazon. Regulators now agree that the nature of these companies’ business means that the market ends up becoming a monopoly dominated by one massive company.\n\nIt has thus become the job of the state to protect consumers from tech giants consolidating their dominance. As a company, 80% of Alphabet’s (Google’s owner) revenue, comes from advertising, a total of US$146 billion (£114 billion) in 2021. Almost everything the company does must be understood through this lens.\n\nThe main source of Google’s advertising income derives from its 90% market share of the market for general search engines, one of the oldest and most important services on the internet.\n\nTo provide users with answers ranging from the best recipe for an apple pie to a recommendation for a new vacuum cleaner, Google first gathers information about every page available on the Internet. Then, it uses its database of websites, the keywords used for search, what other people typically liked as an answer to similar queries, but also everything it knows about you, to rank possible answers.\n\nBusinesses then pay for the right for their own text to be prominently displayed alongside genuine search results. A higher quality of search results means more customers, which makes it easier to attract advertisers. It also means the advert can be tailored to consumer tastes and is therefore more valuable to advertisers.\n\nWhile research has shown the actual return on investment to businesses from digital advertising is unclear, and sometimes even negative, search advertising remains in high demand. It constitutes 66% of Google’s revenue and growth in the past decade.\n\nOther services such as Google Maps and YouTube also contribute. For a start they also generate advertising revenue. But they also provide even more information to help tailor search ads. This includes how much time a user spends on a page, what they click on, whether they react positively or negatively to a result, where they are physically and how they travelled there.\n\nAll this information about you is stored and serves a single purpose. It builds a highly detailed profile of you as a consumer that has enormous value to advertisers looking to personalise ads directly for you.\n\nIn order to gather all this valuable data, it’s vital for Google that it retains that market dominance. Google reportedly spends more than US$26 billion each year to ensure it comes up as the default search engine for the highest number of users.\n\nOn any Android or Apple phone, the default is Google search representing a market share of 94.9%. Google is also the default on almost every web browser. And research shows that even if the cost of switching to another search engine is small, the default position leads to a vicious circle. When consumers stick to the default, it means the possible alternative does not have enough consumer data to offer a high quality search, or to be attractive to advertisers.\n\nGoogle spends US$8.4 billion a year to operate its search engine – on top of the fortune it already spends on ensuring it remains the default search engine. Today, Microsoft’s Bing is the only search engine truly competing with Google by spending billions to index the whole world wide web.\n\nAt some point, Microsoft offered to initially share 100% of its Bing revenue with Apple to secure the default instead of Google. Apple still said no: the amount was less than what Google could offer. Google is not necessarily much better as a search engine. On Microsoft Edge, the only browser where Bing comes as a default, 80% of users stick to Bing. Apple also reportedly has no interest in buying Bing from Microsoft.\n\nGoogle search is simply so big and so good at making money from advertisers that it is very costly to move away from it. In many ways, the market for advertising on search engines is actually very close to legal monopolies such as water distribution or rail tracks, where the cost of setting up the infrastructure are so big that there is simply no space for more than one company.\n\nIn a statement, Kent Walker, president, Global Affairs at Google, said: “This decision recognises that Google offers the best search engine, but concludes that we shouldn’t be allowed to make it easily available. We appreciate the Court’s finding that Google is ‘the industry’s highest quality search engine, which has earned Google the trust of hundreds of millions of daily users,’ that Google ‘has long been the best search engine, particularly on mobile devices,’ ‘has continued to innovate in search’ and that ‘Apple and Mozilla occasionally assess Google’s search quality relative to its rivals and find Google’s to be superior.’\n\n\"Given this, and that people are increasingly looking for information in more and more ways, we plan to appeal. As this process continues, we will remain focused on making products that people find helpful and easy to use.”\n\nIn the recent US case, the judge has not yet announced how it wants Google to stop using its monopoly.\n\nSome rivals want to split Google’s advertising business from its search engine. Another solution would be to force Google to share the data it gathers. Doing so could improve search results for everyone.\n\nJust like it makes little sense to have competing pipes bringing water to your home, it makes little economic sense for several firms to pay billions to gather the exact same information. This is why some groups favour having Google share its data.\n\nExisting attempts at setting precise rules for big tech, however, sometimes have no obvious benefits for consumers. The European Commission, for instance, wanted Alphabet to stop sending Google search results about locations directly to Google Maps. But, according to one analysis, when Google removed the clickable maps from its search results, along with the Google Maps reference, there was only a modest increase in searches for other map services. Visits to Google Maps, meanwhile, changed very little.\n\nSo, despite all the legal moves to introduce more competition into this market, huge questions thus remain as to what practical steps regulators can take without making the consumer experience even worse.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\nRenaud Foucart does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.", "publication_datetime": "2024-08-15T13:55:20+00:00", "lang": "en", "url": "https://uk.news.yahoo.com/google-monopoly-ruling-where-tech-135520995.html", "source": {"domain": "uk.news.yahoo.com", "location": null}}, {"uri": "3baa864cedcb414aa5cf2b444c862f28", "title": "Refrigerated carrier A&A Express closes South Dakota facility, cuts 111 jobs", "body": "A small refrigerated trucking company has announced it is laying off 111 employees, including around 85 truck drivers, and plans to wind down operations at its facility in Brandon, South Dakota.\n\nGeno Cannon, president of AA Temperature Controlled, doing business as A&A Express, notified drivers and office personnel via email that the facility was shuttering operations on Friday and would be routing drivers to the yard and then home after they deliver their loads.\n\nIn an email to drivers, which was obtained by FreightWaves, Cannon stated that the company was not filing for bankruptcy, “so we have funds to finish our loads and route drivers in and all drivers will be paid, accordingly.”\n\nCannon also filed a Worker Adjustment and Retraining Notification (WARN) Act notice on Aug. 9 with the South Dakota Department of Labor and Regulation of its plans to close the Brandon facility, eliminating 111 jobs.\n\n“The company has been in the process of seeking capital or a sale, which if obtained, would have enabled it to avoid or postpone a closure and continue operations,” Cannon wrote in the notice. “Unfortunately, the company could not obtain additional working capital from its lenders and the same process has not been successful.” The company also worked with approximately 140 independent contractors. In August 2020, private equity firm Laurel Oak Capital Partners of Boston announced the acquisition of RRTC Holdings Inc., which included Roadrunner Temperature Controlled and A&A Express. Roadrunner Temperature Controlled later was renamed AA Temperature Controlled, with headquarters in Omaha, Nebraska. However, it’s unclear if the company’s main headquarters in Omaha, which has 303 drivers and the same number of power units, will remain open. An employee who answered the phone at the Omaha office said that Cannon and Dan Lathrop, vice president of operations at A&A Express, were in a meeting and were the only ones who could speak about the current situation at the refrigerated company. A public information specialist with the Nebraska Department of Labor told FreightWaves that as of publication time Thursday that a WARN notice had not been filed in the state. Under the WARN Act, employers with more than 100 workers at a location must give authorities 60-day advance notice of a planned closure and job layoffs. “The outcome was not reasonably foreseeable, but due to these unexpected circumstances, the company can no longer sustain the operations,” Cannon said about the South Dakota facility. As of publication, neither Cannon nor Lathrop had responded to FreightWaves’ repeated requests for comment. Laurel Oak Capital also did not return phone calls about the Brandon facility closure. In 1945, Vince Anderson founded the former family-owned livestock hauling company, Anderson Trucking of Walnut Grove, Minnesota, before it became A&A Express. The carrier was acquired as a subsidiary of Roadrunner in November 2012. A&A Express hauled meat and produce throughout the U.S. with its fleet of refrigerated trailers. One A&A Express driver, who goes by the username Bayou_Swamp_Rat shared the news of the company’s closure on TikTok on Aug. 9. The driver said he was in Cedar Falls, Iowa, and had delivered at a Target distribution center when he heard the news of the closure. He planned to deadhead about 295 miles to the yard in Brandon to turn in his truck. “It’s the first time at any company that I’ve ever been to where you actually feel like a person and not a number,” said Bayou_Swamp_Rat on TikTok. “You don’t have to give them a driver number or a truck number when you call in. I enjoyed driving again. Now, I’m going to go be a number somewhere.” Do you have a news tip or story to share? Send me an email or message @cage_writer on X. Your name will not be used without your permission.", "publication_datetime": "2024-08-15T13:55:05+00:00", "lang": "en", "url": "https://www.freightwaves.com/news/refrigerated-carrier-aa-express-closes-south-dakota-facility-cuts-111-jobs", "source": {"domain": "freightwaves.com", "location": null}}, {"uri": "e53c3ce5f90d4335bc2de1d0bac83041", "title": "US lawmakers urge probe of WiFi router maker TP-Link over fears of Chinese cyber attacks", "body": "WASHINGTON (Reuters) – Two U.S. lawmakers want the Biden administration to probe China’s TP-Link Technology Co and its affiliates for potential national security risks from their widely used WiFi routers over fears they could be used in cyber attacks against the U.S.\n\nRepublican Representative John Moolenaar and Democratic Representative Raja Krishnamoorthi, who lead the House Select Committee on China, requested a Commerce Department probe in a Tuesday letter seen by Reuters.\n\nAccording to research firm IDC, TP-Link, which focuses on the consumer market, is the top seller of WiFi routers internationally by unit volume.\n\nIn calling for an investigation, the U.S. legislators cited known vulnerabilities in TP-Link firmware and instances of its routers being exploited to target government officials in European countries.\n\n“…We request that Commerce verify the threat posed by (China-affiliated small office/home office) routers —particularly those offered by the world’s largest manufacturer, TP-Link,” according to the letter to Commerce Secretary Gina Raimondo.\n\nThe Commerce Department said it would respond to the letter through appropriate channels. The Chinese Embassy said it hopes authorities will “have enough evidence when identifying cyber-related incidents, rather than make groundless speculations and allegations.”\n\nTP-Link, founded in China in 1996 by two brothers and based in Shenzhen, did not immediately respond to a request for comment.\n\nThe letter is a sign of mounting concerns that Beijing could exploit Chinese-origin routers and other equipment in cyber attacks on American governments and businesses.\n\nThe U.S., its allies and Microsoft last year disclosed a Chinese government-linked hacking campaign dubbed Volt Typhoon. By taking control of privately owned routers, the attackers sought to hide subsequent attacks on American critical infrastructure.\n\nThe vast majority of affected routers, however, appeared to be from Cisco and NetGear, the Justice Department said in January.\n\nLast year, the U.S. Cybersecurity and Infrastructure Agency said TP-Link routers had a vulnerability that could be exploited to execute remote code.\n\nAround the same time, U.S. security company Check Point reported that hackers linked to a Chinese state-sponsored group used a malicious firmware implant for TP-Link to target European foreign affairs officials.\n\nThe Commerce Department has broad powers to ban or restrict transactions between U.S. firms and internet, telecom and tech companies from “foreign adversary” nations like China, Russia, Cuba, Iran, North Korea and Venezuela if their products pose a national security risk.", "publication_datetime": "2024-08-15T13:55:02+00:00", "lang": "en", "url": "https://wincountry.com/2024/08/15/us-lawmakers-urge-probe-of-wifi-router-maker-tp-link-over-fears-of-chinese-cyber-attacks/", "source": {"domain": "wincountry.com", "location": null}}, {"uri": "0e4b224f90d14dcfa438ea842e5e5b6c", "title": "Trent Alexander-Arnold contract update provided by Liverpool insider", "body": "Mercato – Doué has said goodbye to Rennes and is arriving in Paris!\n\nDésiré Doué, 19-year-old attacking midfielder/winger under contract until 2026 at Stade Rennais and international hopeful with France, has recently been announced close to Paris Saint-Germain even though...", "publication_datetime": "2024-08-15T13:54:53+00:00", "lang": "fr", "url": "https://onefootball.com/fr/news/trent-alexander-arnold-contract-update-provided-by-liverpool-insider-39896561", "source": {"domain": "onefootball.com", "location": null}}, {"uri": "c1162622c28c4f9da8cddb9d4f1637a2", "title": "EasyJet cancels flights to Portugal as cabin staff strike", "body": "EasyJet said it cancelled more than 200 flights to and from Portugal today as cabin crew based in the country began a three-day strike over working conditions including rotas and overtime.\n\nThe dispute will disrupt travel to and from Portugal at the height of the summer season.\n\nFlight staff union SNPVAC, which called the strike, said more than 90% of Portuguese cabin crew walked out on Thursday. EasyJet put the figure at 73% so far but said that could increase as most of the flights operate in the afternoon.\n\nThe airline said it had been forced to cancel 232 of the 1,138 flights to and from Portugal that had been scheduled to operate over the three-day period of the strike.\n\nSNPVAC said the strike was due to a dispute over a lack of roster stability, insufficient staffing and pressure to work overtime for commercial purposes.\n\n\"The workers are unhappy with the schedules instability. For example, I don't know if I'll be working at 5am or 5pm tomorrow. I can't even plan my family life around the clock,\" said union representative Ana Dias.\n\nThe number of foreign tourists visiting Portugal rose 7.5% between January and June from a year earlier, paving the way for another record year, with Britons the biggest group in the first half of the year, closely followed by visitors from the United States.\n\nAt the height of the busy summer season, Portugal's government has decreed the need for minimum services during the strike, which should include flights to the Atlantic archipelago of Madeira, Geneva, Luxembourg and London.\n\nEasyJet has 19 aircraft based in Portugal and more than 800 employees there.", "publication_datetime": "2024-08-15T13:54:04+00:00", "lang": "en", "url": "https://www.rte.ie/news/business/2024/0815/1465170-easyjet-cancels-flights-to-portugal-as-cabin-staff-strike/", "source": {"domain": "rte.ie", "location": null}}, {"uri": "a2724ff3e16d4994995d01ec18622dfd", "title": "Popular Dublin pub Hartigan's among 12 food businesses issued with closure orders last month", "body": "HARTIGAN’S PUB IN Dublin city centre, which has been in business since the early 18th century, was issued with a closure order by the Food Safety Authority last month.\n\nFollowing an inspection of the premises on 22 July, the inspector noted that a number of rodent carcasses and droppings were found near the keg room and drinks store of the bar in their report.\n\nThe rodent carcasses were found in snap traps placed around the bar, one whole carcass was found in a trap near the keg room while one rodent leg was found near the drink store of the bar.\n\nSeparately, the report says, holes and gaps were visible in the walls of the premises. An inspector noted in their report: “Adequate procedures were not in place to control pests.”\n\nA closure order, under the Food Safety Act 1998, was issued to the owners of Hartigan’s after the inspection as, according to the report, there was a “serious risk” that food and drink would become contaminated by pathogens.\n\nThe risk was so serious that the FSAI inspector said it would be “unreasonable to expect [food or drink] be consumed in that state”.\n\nTwo other food businesses served with closure order under the FSAI Act (1998):\n\nSeparately, nine food businesses closed under the European Union (Official Controls in Relation to Food Legislation) Regulations, 2020 were:\n\nBoba Bar, also in Dublin city centre, is a Chinese restaurant and takeaway that also offers bookings for karaoke events. An inspection of the business on 23 July found that there was an “active cockroach infestation at all stages of the life cycle throughout the premises”.\n\nThe inspector noted that there was no hot water at the business and that the premises was not clean in many places.\n\nA retailer in Hartstown, Dublin 15, Duud was issued a closure order on 12 July after an inspection found missing, damaged and mislodged ceiling tiles and believed that the premises was not adequately pest proofed.\n\nThe report details that rodent droppings were also found at the site and that boxes of food and other products, stacked on top of each other, prevented proper cleaning procedures from being carried out.\n\n“Filthy” food stalls, black mould, foul smells and, generally, an unsanitary environment was described in the FSAI report accompanying the closure order for The Garden @ The Shannon Bar in Termonbarry, Co Roscommon.\n\nThe inspector noted that food wrapping was kept beside cleaning chemicals, store mattresses and Christmas trees in an “unsuitable” storage area. Separately, no staff toilet is available for those who work at the site.\n\nAt the Riverhouse Café at 1 Castle Street, Cahir, Co Tipperary, a FSAI inspector found a cold room that was not cold and food that was kept at “unsafe” temperatures. The inspectors report details that the temperature of the cold room was 21.4 degrees.\n\n“Unclean” conditions were also found at the site for food prep tools and the inspector believed that a culture of food safety was not present at the site.\n\nDangerous temperatures of food stuff, filthy conditions, evidence of pests and rodents as well as inadequate protocols to keep stations clean were among the most popular reasons why businesses were issued with closure orders last month.\n\nElsewhere, three Prohibition Orders were served under the FSAI Act, 1998 at premises last month. These orders include a mandatory, month-long closure and were served on:\n\nJust one Prohibition Order was served under the European Union (Official Controls in Relation to Food Legislation) Regulations, 2020 on:\n\nReaders like you are keeping these stories free for everyone... A mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article. Over 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.", "publication_datetime": "2024-08-15T13:54:00+00:00", "lang": "en", "url": "https://www.thejournal.ie/hartigans-food-business-closures-july-6463909-Aug2024/", "source": {"domain": "thejournal.ie", "location": null}}, {"uri": "14a9b44601424a57b33f82457831e8e8", "title": "US lawmakers urge probe of WiFi router maker TP-Link over fears of Chinese cyber attacks", "body": "WASHINGTON (Reuters) – Two U.S. lawmakers want the Biden administration to probe China’s TP-Link Technology Co and its affiliates for potential national security risks from their widely used WiFi routers over fears they could be used in cyber attacks against the U.S.\n\nRepublican Representative John Moolenaar and Democratic Representative Raja Krishnamoorthi, who lead the House Select Committee on China, requested a Commerce Department probe in a Tuesday letter seen by Reuters.\n\nAccording to research firm IDC, TP-Link, which focuses on the consumer market, is the top seller of WiFi routers internationally by unit volume.\n\nIn calling for an investigation, the U.S. legislators cited known vulnerabilities in TP-Link firmware and instances of its routers being exploited to target government officials in European countries.\n\n“…We request that Commerce verify the threat posed by (China-affiliated small office/home office) routers —particularly those offered by the world’s largest manufacturer, TP-Link,” according to the letter to Commerce Secretary Gina Raimondo.\n\nThe Commerce Department said it would respond to the letter through appropriate channels. The Chinese Embassy said it hopes authorities will “have enough evidence when identifying cyber-related incidents, rather than make groundless speculations and allegations.”\n\nTP-Link, founded in China in 1996 by two brothers and based in Shenzhen, did not immediately respond to a request for comment.\n\nThe letter is a sign of mounting concerns that Beijing could exploit Chinese-origin routers and other equipment in cyber attacks on American governments and businesses.\n\nThe U.S., its allies and Microsoft last year disclosed a Chinese government-linked hacking campaign dubbed Volt Typhoon. By taking control of privately owned routers, the attackers sought to hide subsequent attacks on American critical infrastructure.\n\nThe vast majority of affected routers, however, appeared to be from Cisco and NetGear, the Justice Department said in January.\n\nLast year, the U.S. Cybersecurity and Infrastructure Agency said TP-Link routers had a vulnerability that could be exploited to execute remote code.\n\nAround the same time, U.S. security company Check Point reported that hackers linked to a Chinese state-sponsored group used a malicious firmware implant for TP-Link to target European foreign affairs officials.\n\nThe Commerce Department has broad powers to ban or restrict transactions between U.S. firms and internet, telecom and tech companies from “foreign adversary” nations like China, Russia, Cuba, Iran, North Korea and Venezuela if their products pose a national security risk.", "publication_datetime": "2024-08-15T13:53:28+00:00", "lang": "en", "url": "https://wtvbam.com/2024/08/15/us-lawmakers-urge-probe-of-wifi-router-maker-tp-link-over-fears-of-chinese-cyber-attacks/", "source": {"domain": "wtvbam.com", "location": null}}, {"uri": "618599beec3046cc91aa000a8499f834", "title": "Former employees and internal documents reveal Meta's challenges with Hebrew moderation", "body": "Despite recent internal policy changes, Meta continues to struggle with moderating content related to the Israeli-Palestinian war, especially in Hebrew.\n\nInternal policy guidelines obtained by The Guardian from a former Meta employee highlight a complex process for moderating conflict-related content. However, the documents reveal that Meta lacks a similar process to assess the accuracy of moderation in Hebrew and Arabic content.\n\nThe former employee, who remains anonymous, criticized Meta’s policies on censoring hate speech about Palestine as biased. This sentiment is shared by Palestinian advocacy groups.\n\nFront-line workers in the information war surrounding the conflict are hesitant to raise concerns due to fear of repercussions or suspicion of their motives.\n\nThe documents, dated this spring, highlight Meta’s difficulties in managing content during the volatile conflict, where language and moderation decisions can have serious consequences.\n\nCriticism of Meta’s disparity in moderating content by language has been ongoing, with whistleblower Frances Haugen raising concerns about the company’s approach.", "publication_datetime": "2024-08-15T13:53:13+00:00", "lang": "en", "url": "https://themondonews.com/technology/former-employees-and-internal-documents-reveal-metas-challenges-with-hebrew-moderation/", "source": {"domain": "themondonews.com", "location": null}}, {"uri": "69f0816b355e43c9ae9abf5d2dedb889", "title": "Aktuelle Pläne in Bockhorn: Bauschutt recyceln und Strommastteile lagern bei der Alten Ziegelei", "body": "The site of the old brickworks between Zetel and Bockhorn is to be further developed. The plan is to recycle construction waste and set up ground storage facilities. But there are concerns from the nature conservation authority.\n\nTo read this article, complete one of our offers or log in as a subscriber. All content on NWZonline and in the NWZ news app will then be available to you without restriction.\n\nBockhorn - The Old Brickworks is located between Zetel and Bockhorn - where people today go to the swimming pool or play mini golf in the immediate vicinity. The brickworks building has existed at this location for over 100 years and it should stay that way. At least there are new plans for the site, which is managed by the Manfred Ende company from Westerstede. Gravel, mountains of sand, building rubble, road building materials, general cargo and machines are stored in the areas around the old building. Construction rubble will now also be recycled and sand and topsoil prepared on the company premises. The company also wants to set up ground storage in the existing buildings. This now requires a change in the land use and development plan.\n\nSo it was finally the turn of those responsible for public affairs to express their concerns, after which the plans had to be adjusted again. The engineering firm Thalen Consult from Neuchâtel presented the plans to the municipality's last construction committee. However, there are no fundamental changes to the 6.2 hectare company premises. But the border overlaps with the public bicycle path along the jungle road. “Part of the cycle path runs on private property, but we have included it in the public traffic zone,” explains Constantin Block from Thalen Consult. The Lower Nature Conservation Authority also reported. “Although there is a compensation surplus because there are water bodies and biotopes to the west, the landscape should fundamentally be taken into account when weighing up,” Block explains. The planners were therefore denied the surplus. “It's always the same thing with the landscape. When planning, we always assumed that the brickworks had existed at the location long enough.”\n\nA decision on the plans should now be made soon because the components for the new 380 kV high-voltage line are also to be stored on the site of the old brickworks - known from the Tennet project “Wilhelmshaven2 to Conneforde”. The line will run locally in the Bockhorn bottleneck above Urwaldstrasse. It is also planned that earth from the earthworks for the power line will be temporarily stored on the brickworks site.\n\nFrom the archive: Still no solution for the old brickworks in Bockhorn\n\nAlso read: Neuchâtel's primeval forest is spared from deforestation", "publication_datetime": "2024-08-15T13:52:56+00:00", "lang": "de", "url": "https://www.nwzonline.de/friesland/bauschutt-recyceln-in-bockhorn-plaene-fuer-alte-ziegelei-vorgestellt_a_4,1,2184942268.html", "source": {"domain": "nwzonline.de", "location": null}}, {"uri": "9d65154a51d74a32a6b74795a0b48038", "title": "Families of 3 people killed in 2023 file lawsuit against Southside apartment complex", "body": "JACKSONVILLE, Fla. – Nearly one year after a 3-year-old girl and two men were shot and killed at a Southside apartment complex, their families are suing the complex’s owner and property management company.\n\nAttorneys filed three wrongful death lawsuits against JTB Apartments, JTB AC Skinner, The Inland Real Estate Group and Inland Private Capital Corporation.\n\nThe lawsuits claim there was not enough security to keep the victims safe.\n\nAttorneys are seeking $50,000 for each of the victim’s families.\n\nThree-year-old Kae’Lynn Matthews, 23-year-old Jaquann Mitchell and 24-year-old Keonte Johnson were shot and killed in the common area of the JTB Apartments property on Sept. 23, 2023.\n\nRELATED | ‘Didn’t live her life:’ Family of 3-year-old fatally shot at JTB Apartments pleading for answers in her death\n\nIn the lawsuits, attorneys accuse JTB apartments of not having proper security gates to protect residents and visitors.\n\nThey say the complex did not have adequate surveillance cameras or lighting throughout the property.\n\nAttorneys also claim the complex did not hire enough security guards to patrol and monitor the apartment complex.\n\nThe lawsuits also accuse the complex and surrounding area of having “high crime.”\n\nThey claim the area experienced “shootings, assaults, armed batteries and robberies” leading up to the deadly triple shooting.\n\nAll three of the victims’ families are planning to hold a news conference this Thursday at 10:30 a.m. At the DoubleTree By Hilton Hotel on Riverplace Boulevard on the city’s Southbank.\n\nThe Jacksonville Sheriff’s Office says four people in total were shot at the complex when police say five people showed up there to possibly sell or buy a dog, before police say an argument led to the shooting.\n\nPolice say a fourth person was shot but survived.\n\nMORE | Family broken by death of 3-year-old shot at Southside apartment calls for community to ‘do better’\n\nNo one has been arrested in this case so far.\n\nThe Jacksonville Sheriff’s Office said they are still looking for two men they say were seen leaving the scene of the shooting in a “dark-colored” car.\n\nNews4JAX has called the apartment complex for comment on this lawsuit, and we have not heard back.", "publication_datetime": "2024-08-15T13:52:26.312000+00:00", "lang": "en", "url": "https://www.news4jax.com/news/local/2024/08/15/families-of-3-people-killed-in-2023-file-lawsuit-against-southside-apartment-complex/", "source": {"domain": "news4jax.com", "paywall": false, "location": {"country": "us", "state": "FL", "county": "Duval County", "city": "Jacksonville", "coordinates": {"lat": 30.3321838, "lon": -81.655651}}}}, {"uri": "7f5bad116fc2421292d72f5ca1cb7405", "title": "Clarksville School District Investigates After Child Found Alone on Bus", "body": "A six-year-old student, identified as Connor, experienced distress when he was inadvertently left asleep on a Clarksville-Montgomery County Schools (CMCSS) bus on Tuesday morning, as reported by Clarksville Now. The child, supposed to be attending classes at Liberty Elementary School, awoke to an empty vehicle parked in the bus lot with no driver in sight. A CMCSS Transportation maintenance employee eventually discovered the child an hour later and was able to safely return him to the school.\n\nConnor had encountered trouble earlier that day when he hurt himself before boarding the bus. His mother, Crystal Piti, had requested a teacher to check on his scrapes right after he got on. Unable to reach out to anyone after waking up alone on the bus, the young student began to cry and sought help by leaving the bus and yelling, eventually attracting the attention of the maintenance worker. \"As soon as I found out, I had a breakdown at work,\" Piti told Clarksville Now in regards to learning about her son’s ordeal.\n\nAccording to a spokesperson from CMCSS addressing the incident to News 2, the bus driver neglected to conduct the necessary check required by district policy, which is aimed at preventing such events. The driver's failure raises concerns about compliance with safety protocols. Consequently, the driver has been reassigned to an alternative work site while the district's Human Resources Department conducts an investigation.\n\nCMCSS officials have taken immediate action to reaffirm the district's commitment to student safety. \"The CMCSS Transportation Department is working with its trainers and lead drivers to ensure all drivers receive reminders about the District’s safety policies and procedures and their responsibility to ensure no child is left unattended that they acknowledge after training,\" a CMCSS representative explained in a statement acquired by News 2. All CMCSS buses are equipped with a Child Checker Alarm system intended to prevent such incidents by requiring drivers to deactivate the alarm at the end of their route, checking for remaining students in the process.\n\nIn response to the earlier communication issues experienced, the district has reiterated the gravity of such safety lapses. The incident continues to be under review by CMCSS to establish the mishaps and to ensure future adherence to established safety measures, as reported by WSMV. Crystal Piti is now faced with processing the incident's emotional impact while nearing the anniversary of her elder daughter's passing, adding a profound layer of distress to an already challenging situation.", "publication_datetime": "2024-08-15T13:51:29+00:00", "lang": "en", "url": "https://hoodline.com/2024/08/clarksville-school-district-investigates-after-child-found-alone-on-bus-driver-reassigned-amid-safety-protocol-review/", "source": {"domain": "hoodline.com", "location": null}}, {"uri": "e0c9d0aad3e2457aa4db6975a2dbe5ff", "title": "Bakterien entdeckt: Bewohner mehrerer Straßen in Werdohl sollen Wasser abkochen", "body": "Bacteria discovered in drinking water: Citizens in Werdohl-Kettling currently have to boil their water, says Enervie. Coliform pathogens were found during a routine check in an elevated container.\n\nWerdohl - According to Enervie, bacteria in the form of coliform bacteria and Escherichia coli were found in an elevated container. “The cause was force majeure due to the failure of a disinfection system due to a lightning strike,” it says. Enervie is the operator of the water supply network in Werdohl.\n\nIn close coordination with the health department of the Märkischer Kreis, Enervie initiated immediate measures to combat the cause and solve the problem: the affected elevated tank was taken out of operation and the drinking water supply now comes from another elevated tank.\n\nAt the same time, Enervie has already carried out extensive flushing measures in the drinking water network. The network operator therefore assumes that the contaminated drinking water has already been removed from the network.\n\nIn direct consultation with the health department of the Märkischer Kreis, an immediate boiling order should be issued for safety reasons. It can be assumed that this boiling water requirement can be lifted again soon.\n\nEnervie has already initiated follow-up investigations. Customers can also obtain information via the free “Water” fault number from Enervie Vernetzt on 0800 – 123 99 33.\n\nBoiling requirement: This must be taken into account\n\nAccording to the Märkischer Kreis health department, the following points about the boiling requirement must be observed: Only packaged or boiled water may be used for drinking, preparing food, brushing teeth and when in contact with open wounds. The water must be boiled to a rolling boil to be considered boiled water.\n\n\n\nThe water is still suitable for personal hygiene, washing hands, showering and bathing - but it should not be swallowed. The water can be used to wash laundry; the washing temperature should be at least 40 °C. Dishes from the dishwasher are harmless as long as the dishwasher washes and dries at temperatures above 60 °C. For vulnerable people and infants, it is strongly recommended to clean dishes with boiled water.", "publication_datetime": "2024-08-15T13:50:59+00:00", "lang": "de", "url": "https://www.come-on.de/lennetal/werdohl/werdohl-kettling-coliforme-bakterien-im-trinkwasser-entdeckt-93244200.html", "source": {"domain": "come-on.de", "location": null}}, {"uri": "60b37baa63cd495189ae837b5159e3b9", "title": "Cash App Settles $15M Lawsuit; Agrees to Reimburse Individual Users Up to $2,500", "body": "money transfer alternative which was previously under investigation for double charging customers, has been sued again and recently agreed to a $15 million settlement for data breaches that affected their customers.\n\nAccording to the lawsuit, 8.2 million customers had their information exposed including names, brokerage account numbers and investing activity — including portfolio values. Eligible consumers who were victims of the data breaches one reportedly orchestrated by an employee and the second by a Cash App user eligible customers may receive up to $2,500 for out-of-pocket costs.\n\nTo be eligible, your account must have been impacted by unauthorized access of personal information or fraudulent withdrawals between Aug. 23, 2018, and Aug. 20, 2024. And you must be able to document your losses.\n\nWhile Cash App is not admitting any wrongdoing in the data breach case, the mobile-money transfer company will reimburse qualifed recipients for:\n\nIf you satisfy the eligibility requirements, you can apply for your piece of the settlement by submitting a claim here.\n\nThe website asks users to submit a notice ID and a confirmation code if they received a personalized notice about the settlement in the mail or by email.\n\nThere’s also an option for people who weren’t contacted to submit a claim and make the case that they’re eligible.\n\nYou’ll be asked if there were unauthorized withdrawals from your Cash App account or linked accounts. You should submit supporting documentation like communications with Cash App, receipts documenting losses or police reports.\n\nThe deadline to submit a claim is Nov. 18, 2024 and the final approval hearing is set for Dec. 16.", "publication_datetime": "2024-08-15T13:50:10+00:00", "lang": "en", "url": "https://atlantadailyworld.com/2024/08/15/cash-app-settles-15m-lawsuit-agrees-to-reimburse-individual-users-up-to-2500/", "source": {"domain": "atlantadailyworld.com", "location": {"country": "us", "state": "GA", "county": "Fulton County", "city": "Atlanta", "coordinates": {"lat": 33.7489924, "lon": -84.3902644}}}}, {"uri": "4f3d3de6e94645d984ccf13d52fb43fb", "title": "Deutscher Keks-Hersteller beschäftigte zur NS-Zeit deutlich mehr Zwangsarbeiter als gedacht!", "body": "New details from a dark chapter in the company's history have become known at the well-known German biscuit manufacturer \"Bahlsen\".\n\nThe company \"Bahlsen\" is in the headlines - but not because of delicious cookies and biscuits. (Archive image) © The company, headquartered in Hanover, had its role during the National Socialist era scientifically examined and published the results on Tuesday. There was already a huge outcry in 2019 when Verena Bahlsen (31), great-granddaughter of the company's founder Hermann Bahlsen (1859-1919) and shareholder, claimed that forced laborers at Bahlsen during the Nazi dictatorship were treated \"well\" and paid \"just the same\". , like German employees. The family business, founded in 1889, reacted immediately and announced an independent review of its own company history. At that time, the family business from Lower Saxony stated that around 200 forced laborers were employed in production between 1943 and 1945. However, these numbers were not correct, as the study that has now been published reveals.\n\nBahlsen: \"Regret that we didn't face this truth sooner!\"\n\nBetween 1940 and 1945, Bahlsen used over 800 forced laborers to produce baked goods. (Symbolic image) © According to the report published on Tuesday by a committee of experts at the University of Göttingen, over 800 forced laborers were used at Bahlsen from 1940 onwards. In a press release on Tuesday, the traditional company thanked the scientists for the “meticulous work” and emphasized that the events were “inexcusable.” \"The truth about the events at that time is uncomfortable and painful. We deeply regret the injustice that happened to these people at Bahlsen. We also regret that we did not face this difficult truth sooner,\" it says. New technology is intended to convert CO2 into something useful: Saxon start-up pulls the teeth of climate killers. According to Bahlsen, the “main drive” of the management at the time was to keep the company running even under the Nazi regime. Their ancestors therefore “took advantage” of the inhumane system - with “bad” consequences. Because the sad company history - like many traditional German companies - cannot be changed, the biscuit manufacturer wants to look to the future and ensure that the horrific events do not repeat themselves.", "publication_datetime": "2024-08-15T13:50:00+00:00", "lang": "de", "url": "https://www.tag24.de/nachrichten/wirtschaft/unternehmen/deutscher-keks-hersteller-beschaeftigte-zur-ns-zeit-deutlich-mehr-zwangsarbeiter-als-gedacht-3308945", "source": {"domain": "tag24.de", "location": null}}, {"uri": "a1941f3102fa4c20ad9faa0cc727b622", "title": "Editorial", "body": "Google was once the company with the motto “Don’t be evil.”\n\nWell, those days are gone.\n\nLast week, a federal judge ruled that the Silicon Valley company is a monopolist that uses its market advantage to stifle search engine competition.\n\nIn another case, the federal government and eight states, including California, allege Google has “corrupted legitimate competition” in the technology that drives online advertising.\n\nLocal news organizations are victims of these monopolistic practices. Google not only curtails our ability to generate advertising dollars, but it also uses our news content to drive web traffic to its search site.\n\nEssentially, they’re putting the work product of our journalists on their site and selling advertising with it. And reaping the profits. Google made more than $300 billion last year, most of it from advertising it sells using content it did not create or pay for.\n\nMeanwhile, local journalism is struggling to survive. California alone has lost over 100 newspapers in the last decade, cutting off a flow of information critical for the survival of local democracy. Fortunately, state lawmakers are trying to at least partially correct this imbalance.\n\nTwo bills are working their way through the Legislature this month. The most promising, AB 886, authored by Assemblymember Buffy Wicks, D-Oakland, would require online platforms such as Google and Facebook to share the money they make off local news organizations’ articles.\n\nThe bill would require the journalism organizations to spend at least 70% of funds through the California Journalism Preservation Act on journalists and support staff. In other words, Google would have to stop undermining local journalism and start helping fund it.\n\nIt’s not a new idea. Similar laws have been passed in Canada and Australia, resulting in hundreds of millions of dollars of investments in newsrooms.\n\nOf course, the devil is in the details, and the biggest detail remains how much Google would be required to compensate news organizations for the privilege of using their content. The amount is currently under negotiation between legislative leaders and Google. The big question is whether the company will strike a deal, like they have in other countries, or roll the dice and go to arbitration.\n\nMeanwhile, the bill, now in its second year in the Legislature, has passed the Assembly, but must still pass a key Senate Appropriations Committee this week. Before the end of the month, it must pass the full Senate and go back to the Assembly for concurrence in amendments.\n\nAnother bill, SB 1327, by state Sen. Steve Glazer, D-Orinda, takes a different approach to the same problem. It would tax large tech firms on the user data they collect for advertising purposes, and then use the tax revenues to support news publications.\n\nClearly change is needed. Clearly Google has long ago abandoned its motto of altruism. Only action by lawmakers can curb this behavior. We’re in the final month of the legislative session. Now is the time to get this done.", "publication_datetime": "2024-08-15T13:49:53+00:00", "lang": "en", "url": "https://www.times-standard.com/2024/08/15/editorial-stop-googles-destruction-of-local-journalism/", "source": {"domain": "times-standard.com", "location": {"country": "us", "state": "CA", "county": "Humboldt County", "city": "Eureka", "coordinates": {"lat": 40.7906871, "lon": -124.1673746}}}}, {"uri": "f2e338a3b97c41a28a98526272a42e39", "title": "Fábrica alemã admite ter utilizado mais trabalho escravo do que estimava durante o nazismo", "body": "German biscuit manufacturer Bahlsen used many more forced laborers from Poland and Ukraine during Nazism than previously known, according to a study commissioned by the company itself, which made a mea culpa.\n\nAround 800 forced workers were identified between 1940 and 1945 at the Hanover company, according to this study carried out by historians Manfred Grieger and Hartmut Berghoff, who investigated at the request of the Bahlsen family, the company reported this Thursday (15).\n\nThe number is much higher than previously estimated: 200 to 250 forced laborers.\n\n\"The truth about what happened at this time (Nazism) is uncomfortable and painful,\" commented the Bahlsen family in a press release.\n\nThe study \"shows that our ancestors and the actors of the time benefited from the system during the Nazi period\", adds the statement from the family company founded at the end of the 19th century.\n\nForced laborers were employed to produce food rations for the German Army.\n\nBahlsen's heirs stated that until now they did not know many details about the company's history and had never asked themselves how it managed to operate and survive during World War II.\n\nThis study was commissioned after a young company heiress, Verena Bahlsen, sparked controversy in May 2019 by publicly downplaying the suffering of the company's forced laborers during the Nazi era.", "publication_datetime": "2024-08-15T13:48:30+00:00", "lang": "pt", "url": "https://www.bol.uol.com.br/noticias/2024/08/15/fabrica-alema-admite-ter-utilizado-mais-trabalho-escravo-do-que-estimava-durante-o-nazismo.htm", "source": {"domain": "bol.uol.com.br", "location": null}}, {"uri": "e9ef89453a6c48f9814589808b429d12", "title": "Sonos May Revive Old App As It Works on Improving Existing One", "body": "Sonos may resurrect its old app as it continues to improve its unpopular successor.\n\nIn April, the company launched an updated version of the Sonos app, which controls its home speakers. It removed many basic features , however, prompting harsh criticism on social media . Sonos CEO Patrick Spence apologized last month and promised to fix the new app with bi-weekly updates through October.\n\nAccording to The Verge , the situation has forced the top brass at Sonos to consider reviving the old app, known as S2. Many customers have also inquired about the possibility of restoring the old app . Right now, only the new version is available on Google Play and the App Store.\n\nSonos is currently fighting battles on multiple fronts. This week, the company laid off 100 employees. Last week, during an earnings call , Spence announced that the \" app situation \" had forced the company to postpone the launch of two new products.\n\n“The app situation has become a headwind to existing product sales, and we believe our focus needs to be addressing the app ahead of everything else. This means delaying the two major new product releases we had planned for Q4 until our app experience meets the level of quality that we, our customers, and our partners expect from Sonos,” Spence said.\n\nThe CEO further admitted that his execution of the new app “fell short of the mark” and fixing it could cost the company anything between $20 and $30 million.\n\nIn a separate statement given to The Verge, Spencer said that the recent layoffs won’t affect the app recovery and “delighting our customers remains our priority.”", "publication_datetime": "2024-08-15T13:48:27+00:00", "lang": "en", "url": "https://www.pcmag.com/news/sonos-may-revive-old-app-as-it-works-on-improving-existing-one", "source": {"domain": "pcmag.com", "paywall": false, "location": null}}, {"uri": "c0396b696fc84a62a2fa61937cf61ac2", "title": "Ernesto leaves half of Puerto Rico without power; cruise lines alter itineraries", "body": "Hurricane Ernesto has left half of Puerto Rico without power as the storm, which became a category 1 hurricane on Wednesday, continues to strengthen and head north towards Bermuda, where it is expected to make landfall on Friday (Aug 16).\n\nPuerto Rico’s main power supplier LUMA Energy reports that some 998,000 customers did not have access to electricity at 03:05 EDT, according to CBS News.\n\nCulebra and Vieques, two small islands off the east coast, are seeing near-total blackouts, the Washington Post reports.\n\nPuerto Rico Gov. Pedro Pierluisi said at a Wednesday news conference that he has asked the president of Luma to restore power “as quickly as possible.”\n\nHe noted that U.S. President Joe Biden approved a disaster declaration for the U.S. territory, activating assistance from the Federal Emergency Management Agency.\n\nWith wind gusts of up to 140km/h, the hurricane dropped around 25 cm of rain in some areas of the island, the U.S National Hurricane Centre (NHC) reported.\n\nPuerto Rico's power grid has been disrupted by hurricanes before. In 2022, when Hurricane Fiona hit, around 80 per cent of homes and businesses were left without power for almost a month.\n\nThe U.S. and British Virgin Islands also received half-a-foot of rain over the last 48 hours.\n\nWhile workers across the U.S. Virgin Islands continued restoring power, officials announced Wednesday that government offices would reopen but public schools will remain closed for continued cleanup.\n\nForecasters are now predicting that Ernesto could become a major hurricane in the next 48 hours.\n\nThe storm is expected to begin dumping heavy rain over Bermuda beginning Friday before passing near or over the archipelago on Saturday.\n\nOfficials on Thursday issued a hurricane warning for Bermuda. \"Preparations to protect life and property should be rushed to completion,\" the hurricane centre said.\n\nIn a revised forecast issued earlier this month, the U.S. federal government said a \"highly active\" hurricane season was likely to continue in the Atlantic regions.\n\n\"Atmospheric and oceanic conditions have set the stage for an extremely active hurricane season that could rank among the busiest on record,\" the National Oceanic and Atmospheric Administration said in its forecast.\n\nCruise lines are now changing itineraries to avoid the wrath of Ernesto.\n\nCarnival Cruise Line’s Carnival Pride ship, which left from Baltimore for a Bermuda cruise last Sunday, moved its visit to the island up by one day. It will now arrive on Tuesday and leave on Thursday, the cruise line said.\n\nCarnival Magic skipped its stop in San Juan on Wednesday and will make an additional stop in Nassau in the Bahamas on Friday.\n\n“As the safety of our guests and crew is our priority, we will continue to watch the storm and factor in guidance from the National Hurricane Centre, U.S. Coast Guard and the local port authorities to provide timely updates as more information becomes available,” Carnival said in a press release.\n\nNorwegian Cruise Line rerouted Eastern Caribbean cruises on Norwegian Sky and Norwegian Breakaway to the Western Caribbean.\n\nThe new itineraries include Roatan in Honduras, Costa Maya and Cozumel, Mexico and Harvest Caye in Belize (Sky is also planning to stop in Grand Cayman and Ocho Rios in Jamaica).\n\nNorwegian Joy, which left for Bermuda cruise from New York on Sunday, arrived at the island on Tuesday, one day ahead of schedule. It will depart Thursday, one day earlier than originally planned.\n\nRoyal Caribbean International’s Rhapsody of the Seas will make planned stops on its Southern Caribbean cruise, but in a different order (no ports were actually cancelled).\n\nIcon of the Seas is sailing a Western Caribbean itinerary instead of an Eastern Caribbean voyage as planned. The stops include Cozumel, Costa Maya and Roatan.\n\nSymphony of the Seas, which left from Bayonne, New Jersey, for an Eastern Caribbean cruise on Friday, will also now visit Nassau instead of Puerto Plata in the Dominican Republic.\n\nDon't miss a single travel story: subscribe to PAX today! Click here to follow PAX on Facebook.", "publication_datetime": "2024-08-15T13:48:15+00:00", "lang": "en", "url": "https://www.paxnews.com/news/travel-advisories/ernesto-leaves-half-puerto-rico-without-power-cruise-lines-alter-bermuda-plans", "source": {"domain": "paxnews.com", "location": null}}, {"uri": "21efd6c444584448b1ca98fd6733bf46", "title": "Region Värmland kritiseras av Ivo – efter felvaccineringen som ledde till Pontus död", "body": "Despite recommendations from the Public Health Authority that people under the age of 31 should not receive the Spikevax vaccine from the manufacturer Moderna, the vaccine was given to 30-year-old Pontus.\n\nIvo notes that the region has not lived up to the requirement for good care, and that as a care provider it has not ensured that the correct information has reached the vaccinating staff and that the staff has had the right skills.\n\nIn the decision, Ivo makes it clear that it is the care provider who failed in his responsibility, and that it is not about the efforts of individuals.\n\n- In his decision, Ivo has made it clear that this is not about the efforts of individuals, but about the systematic work of the caregivers to ensure that the right information reaches the staff. I am convinced that our decision will contribute to the region's continued quality work, so that this does not risk happening again, says Daniel Lilja, head of department at Ivo in a statement.", "publication_datetime": "2024-08-15T13:47:28+00:00", "lang": "sv", "url": "https://www.svt.se/nyheter/lokalt/varmland/region-varmland-kritiseras-av-ivo-efter-felvaccineringen-som-ledde-till-pontus-dod", "source": {"domain": "svt.se", "location": null}}, {"uri": "7093f1d2699342b8897c08db33dc30d7", "title": "Hamas-Symbolik: SPD-Parteizentrale in Berlin mit roten Dreiecken besprüht - Video", "body": "The SPD party headquarters in Berlin has been daubed with red paint - including two downward-pointing triangles, known as a symbol of Hamas sympathizers, and the equation “reason of state = genocide”. State security is investigating.", "publication_datetime": "2024-08-15T13:47:22+00:00", "lang": "de", "url": "https://www.welt.de/vermischtes/video253025192/Hamas-Symbolik-SPD-Parteizentrale-in-Berlin-mit-roten-Dreiecken-besprueht.html", "source": {"domain": "welt.de", "location": null}}, {"uri": "12a2e52607f74433b38d28889e14c9e0", "title": "150 milyon leva (76 bin avro) kredide ihlaller suçlamasıyla üç kişi yargılanacak", "body": "Vılka (Kurt) lakaplı işadamı Rumen Gaytanski, Gaytanski'nin ışırık olan “Roadway Construction” teşmelcisi İvan Georgiev ve 2017-2020 periode Bulgaria Kalkınma Bankası Müdürü olan Stoyan Mavrodiev'e suç dukurusunda bulunuldu.öz konuşu sırket şirket yararına Bulgaria Kalkınma Bankasın 2019 ışıkızın 150 milyon leva kredi aldıkları saptandı. Savcılık Mavrodiev ve Gaytanski a ...", "publication_datetime": "2024-08-15T13:46:57+00:00", "lang": "sv", "url": "https://bnr.bg/tr/post/102033686/150-milyon-leva-76-bin-avro-kredide-ihlaller-suclamasiyla-uc-kisi-yargilanacak", "source": {"domain": "bnr.bg", "location": null}}, {"uri": "b6ac28e973a4406bb48ad7c4b4f3d9d5", "title": "Pune: Tork Motors Faces Legal Action As Dealers and Employees Protest - PUNE PULSE", "body": "Pune-based Tork Motors is facing significant challenges as it struggles to supply electric motorcycles and manage its operations. Since December of last year, the company has not provided any electric motorcycles to its showrooms. This has led to severe consequences, including legal actions from dealers and disgruntled employees.\n\nDealers across India have filed a complaint against Tork Motors, leading to the shutdown of its showroom on Law College Road, Pune. They allege that their investments have gone to waste due to the company’s failure to deliver vehicles. In response, they have lodged a police complaint in Pimpri, seeking the return of their invested money.\n\nAdditionally, customers are experiencing difficulties, as spare parts and services for the company’s electric motorcycles, particularly the Kratos model, are unavailable. This has led to many motorcycles being rendered unusable, forcing owners to consider scrapping them.\n\nThe company’s founder and CEO, Kapil Shelke, is at the center of the complaints. Assistant Police Inspector Kiran Pathare from Pimpri-Chinchwad confirmed that an investigation is underway, though details are being kept confidential. Action is expected within the next week.\n\nMoreover, Tork Motors has terminated several employees since July 31, and these workers have not received their salaries for the past seven months. Despite this, the company has assured that employees will receive relieving letters within the “scheduled time.”\n\nAs Tork Motors grapples with these issues, the company’s future remains uncertain, with both dealers and customers anxiously awaiting resolution.", "publication_datetime": "2024-08-15T13:46:31+00:00", "lang": "en", "url": "https://www.mypunepulse.com/pune-tork-motors-faces-legal-action-as-dealers-and-employees-protest/", "source": {"domain": "mypunepulse.com", "location": null}}, {"uri": "c2c1c2a0566141bfb862ab033d27a6c8", "title": "Recall alert: 653K Trader Joe’s mango tangerine candles recalled", "body": "Trader Joe’s has recalled about 653,000 candles that could pose a burn hazard.\n\nThe Consumer Product Safety Commission said the flame in the mango tangerine scented candles can spread from the wick to the wax and cause a flame that is bigger than expected.\n\nThe candles have SKU 56879 printed on the bottom of the tin container. The candle itself is white wax with a cotton wick. They were sold in June.\n\nIf you have the recalled candle you should stop using it and return it to any Trader Joe’s for a $4 cash refund. You can also submit a form online to get the refund on a gift card when you provide a receipt or photo of the candle.\n\nThere have been 14 reported incidents of high flames with three reports of minor property damage and two reports of minor burns.\n\nFor more information, contact Trader Joe’s at 833-771-0299 from 6 a.m. to 5 p.m. PT Monday through Friday or reach out to the company online.", "publication_datetime": "2024-08-15T13:46:12.766000+00:00", "lang": "en", "url": "https://www.wsbradio.com/news/trending/recall-alert-653k-trader-joes-mango-tangerine-candles-recalled/UUXHYS6QHBAA7HHZM5HLECOYXM/", "source": {"domain": "wsbradio.com", "location": null}}, {"uri": "652c7611c5c84972a6dd4509aefcbb9c", "title": "Recall alert: 653K Trader Joe’s mango tangerine candles recalled", "body": "Trader Joe’s has recalled about 653,000 candles that could pose a burn hazard.\n\nThe Consumer Product Safety Commission said the flame in the mango tangerine scented candles can spread from the wick to the wax and cause a flame that is bigger than expected.\n\nThe candles have SKU 56879 printed on the bottom of the tin container. The candle itself is white wax with a cotton wick. They were sold in June.\n\nIf you have the recalled candle you should stop using it and return it to any Trader Joe’s for a $4 cash refund. You can also submit a form online to get the refund on a gift card when you provide a receipt or photo of the candle.\n\nThere have been 14 reported incidents of high flames with three reports of minor property damage and two reports of minor burns.\n\nFor more information, contact Trader Joe’s at 833-771-0299 from 6 a.m. to 5 p.m. PT Monday through Friday or reach out to the company online.", "publication_datetime": "2024-08-15T13:46:12.766000+00:00", "lang": "en", "url": "https://www.wsoctv.com/news/trending/recall-alert-653k-trader-joes-mango-tangerine-candles-recalled/UUXHYS6QHBAA7HHZM5HLECOYXM/", "source": {"domain": "wsoctv.com", "paywall": false, "location": {"country": "us", "state": "NC", "county": "Mecklenburg County", "city": "Charlotte", "coordinates": {"lat": 35.2272086, "lon": -80.8430827}}}}, {"uri": "ff85bd7ffb3b4e50b84c06e392ded0ee", "title": "Ford Says Beware, Takata Murder Bags Are Still Out There", "body": "It's been nine years since automakers like Ford and Mazda first issued warnings about the dangers of airbag inflators manufactured by Takata. Despite these warnings, Ford reports that there are still about 374,300 vehicles with these faulty inflators on U.S. roads, with a global total of 765,600. Mazda adds another 83,000 vehicles to that count. In response, both automakers, alongside the National Highway Traffic Safety Administration, have issued a renewed do-not-drive advisory for the affected vehicles. This issue is highly dangerous. In 2022, NHTSA confirmed the death of a driver in a 2006 Ford Ranger due to a ruptured airbag inflator, which sent shrapnel flying into the cabin. This incident brought the total number of fatalities related to these faulty inflators in the U.S. to 23.\n\nThe age of these vehicles increases the likelihood that a part within the airbag could explode during a crash, potentially sending sharp metal fragments into the vehicle’s occupants, and leading to serious injury or death. The affected Ford models span from the 2004-2012 model years, including vehicles like the 2005-2014 Mustang and the 2007-2011 Ranger. Mazda’s warning covers models from 2003-2015, such as the Mazda6 and CX-9. Ford has made extensive efforts to alert owners, including more than 121 million outreach attempts in the U.S. This includes letters, emails, phone calls, and even visits to customer homes. Both automakers are offering free towing, mobile repair services, and loaner vehicles to encourage owners to get these dangerous parts replaced. This article was co-written using AI and was then heavily edited and optimized by our editorial team. Become an AutoGuide insider. Get the latest from the automotive world first by subscribing to our newsletter here.", "publication_datetime": "2024-08-15T13:46:04+00:00", "lang": "en", "url": "https://www.thetruthaboutcars.com/cars/news-blog/ford-says-beware-takata-murder-bags-are-still-out-there-44508784?utm_medium%5C%5Cu003dauto%5C%5Cu0026utm_source%5C%5Cu003drss%5C%5Cu0026utm_campaign%5C%5Cu003dtype_post=", "source": {"domain": "thetruthaboutcars.com", "location": null}}, {"uri": "091227def90a4ba38ae0eed7df700d60", "title": "SpaceX Faces Environmental Violations at Texas Launch Site", "body": "Help keep One Green Planet free and independent! Together we can ensure our platform remains a hub for empowering ideas committed to fighting for a sustainable, healthy, and compassionate world. Please support us in keeping our mission strong.\n\nSpaceX has come under scrutiny for environmental violations linked to its operations in Boca Chica, Texas. The aerospace company, led by Elon Musk, has been found discharging pollutants into local water bodies, a breach of regulations that could impact its ambitious space exploration goals.\n\nThe Texas Commission on Environmental Quality (TCEQ) issued a notice of violation to SpaceX, following a series of complaints about its water deluge system at the Starbase facility. This system, crucial for cooling and sound suppression during rocket launches, has reportedly been operated without the necessary state authorization. Such violations were first noted by the Environmental Protection Agency’s Region 6 office, signaling a breach of the Clean Water Act.\n\nInvestigative records obtained by CNBC reveal that the TCEQ’s office in Harlingen received 14 complaints regarding the environmental impact of the facility’s deluge system. The concerns escalated with findings that SpaceX discharged industrial wastewater without a permit on multiple occasions between March and July 2024.\n\nSpaceX’s development of the Starship, aimed for lunar and Martian missions, has necessitated frequent launches and landings at the Boca Chica site. However, environmental oversights have led to significant legal and regulatory challenges. The unauthorized use of the water deluge system not only violated state and federal laws but also risked further civil penalties and criminal charges against the company.\n\nIn a recent statement on the social media platform X, SpaceX indicated that despite the violations, regulatory bodies had not demanded a halt to their operations. The company has continued its launch activities, even as it navigates the complexities of compliance.\n\nThe environmental implications of SpaceX’s activities have attracted significant attention, given the sensitive ecological zones surrounding the Boca Chica site. A notable incident occurred during Starship’s first test flight in April 2023 when an explosion scattered debris across a crucial habitat for endangered species, sparking legal actions from environmental groups.\n\nWith the FAA yet to clear SpaceX for further test flights and ongoing investigations into the wastewater discharges, the company faces a precarious path forward. It must balance its pioneering technological endeavors with stringent environmental responsibilities to minimize its footprint on the local ecosystem and comply with regulatory standards. As the situation develops, SpaceX’s handling of these environmental challenges will be crucial in determining its future operational capabilities at the Boca Chica launch site.\n\nBeing publicly-funded gives us a greater chance to continue providing you with high-quality content. Click here to Support Us\n• Google Teams Up with the EDF to Map Global Methane Emissions from Space\n• Rocket Pollution: The Hidden Cost of the Space Race Boom\n• SpaceX Starship Launch Under Investigation After Raining Potentially Hazardous Debris on Homes and Wildlife\n\nEasy Ways to Help the Planet:\n• Eat Less Meat: , the largest plant-based Recipe app on the App Store, to help reduce your environmental footprint, save animals and get healthy. You can also buy a hard or soft copy of our\n• Adopt-a-Pet: , a watchdog platform specifically designed for animal, earth, and wildlife warriors to actively give back, rescue, and protect animals and the planet.\n• Reduce Your Fast Fashion Footprint: Take initiative by standing up against fast fashion Pollution and supporting sustainable and circular brands like that raise awareness around important issues through recycled zero-waste clothing designed to be returned and remade repeatedly.\n• Support Independent Media: Being publicly funded gives us a greater chance to continue providing high-quality content. Please consider\n• Sign a Petition: Your voice matters! Help turn petitions into victories by signing the latest list of to help people, animals, and the planet.\n• Stay Informed: Keep up with the latest news and important stories involving animals, the environment, sustainable living, food, health, and human interest topics by subscribing to\n• Do What You Can: Reduce waste, plant trees, eat local, travel responsibly, reuse stuff, say no to single-use plastics, recycle, vote smart, switch to cold water laundry, divest from fossil fuels, save water, shop wisely, Donate if you can, grow your food, volunteer, conserve energy, compost, and don’t forget about the microplastics and microbeads lurking in common household and personal care products!", "publication_datetime": "2024-08-15T13:46:04+00:00", "lang": "en", "url": "https://www.onegreenplanet.org/environment/spacex-faces-environmental-violations-at-texas-launch-site/", "source": {"domain": "onegreenplanet.org", "location": null}}, {"uri": "a82f61a196da4b7189537623a0b69f3a", "title": "L'aéroport de Catane fermé en raison d'une éruption de l'Etna", "body": "The volcano emits large clouds of ash and gas, which rise up to 9,500 meters. Ashes cover planes and landing strips at Catania airport. Some roads in the surrounding area are also difficult to pass.", "publication_datetime": "2024-08-15T13:46:00+00:00", "lang": "fr", "url": "https://www.lavenir.net/actu/monde/2024/08/15/laeroport-de-catane-ferme-en-raison-dune-eruption-de-letna-IZSP75HLYRGOTFEFEI6ARYBWXU/", "source": {"domain": "lavenir.net", "location": null}}, {"uri": "be4cc854549e4b8b80998600787c635e", "title": "Entrevue avec Marc Lefrançois : Les valeurs de revente", "body": "What to do with Moscow's waste, where recycling is almost non-existent?\n\nWhen I arrived in Moscow, almost six months ago, I knew very well that Russia was seriously behind in terms of ...", "publication_datetime": "2024-08-15T13:45:44+00:00", "lang": "fr", "url": "https://ici.radio-canada.ca/sujet/changements-climatiques/actualites/document/segments/ohdio_segment_developpe/1828972/entrevue-avec-marc-lefrancois-valeurs-revente", "source": {"domain": "ici.radio-canada.ca", "location": null}}, {"uri": "a96e3eee1aeb4deea95a89400596a27d", "title": "Flagship green fuel factory scrapped in net zero blow", "body": "A flagship green fuel factory has been scrapped by the renewable energy giant Ørsted amid a lack of demand from customers.\n\nWork has halted on the FlagshipONE project, a proposed e-methanol plant in the Swedish town of Örnsköldsvik, meant to supply container ships as part of the battle to reach net zero.\n\nThe announcement is the latest sign that energy majors are retreating from the mega-projects needed to accelerate the global shift from fossil fuels to cleaner substitutes.\n\nØrsted took a 1.5bn Danish kroner (£172m) hit from the decision to axe the facility, according to its latest financial results.\n\nThe business, which is controlled by the Danish government, has become one of the UK’s leading developers of offshore wind, with 12 operational wind farms in UK waters.\n\nThey include Hornsea 1 and 2 off the east coast – together comprising one of the world’s largest wind farms.\n\nThe company produces 7pc of the UK’s power and is planning further expansion including two more wind farms near Hornsea and a massive floating one off Scotland.\n\nHowever, its ventures into new technologies and regions have hit the company hard this year, with Mads Nipper, group president and chief executive of Ørsted announcing a total of 3.9bn DKK of impairments.\n\nThe FlagshipONE project would have used renewable electricity to produce hydrogen that could then be combined with CO2 to produce methanol.\n\nThe aim was to produce 55,000 tonnes of methanol a year, enough for one large container vessel, making it a large-scale pilot project.\n\nMr Nipper said the company had been unable to secure long-term contracts to buy its e-methanol at a viable price.\n\nHe said: “The liquid e-fuel market in Europe is developing slower than expected, and we have taken the strategic decision to deprioritise our efforts within the market and cease the development of FlagshipONE.\n\n“We will continue our focus and development efforts within renewable hydrogen, which is essential for decarbonising key industries in Europe and closer to our core business.”\n\nØrsted suffered a second impairment totalling 2.1bn kroner at its Revolution wind farm project near Martha’s Vineyard, off the US east coast. Construction delays at its onshore substation are the key cause.\n\nMr Nipper said: “Despite encouraging progress on our US offshore wind project, Revolution Wind, the construction of the onshore substation for the project has been delayed. This means that we have pushed the commercial operation date from 2025 into 2026, which led to an impairment.\n\n“This is, of course, unsatisfactory.”\n\nThe company reported a pre-tax profit of 3.9bn kroner, up from 2.4bn kroner in the same period last year, and net profits of 931m kroner.\n\nTancrede Fulop, senior equity analyst at Morningstar said Ørsted had outperformed expectations especially in offshore wind, but the impairments “underscore the impact of project delays”.\n\nØrsted’s cuts follow similar moves by other energy majors in scaling back renewable energy projects.\n\nLast month, Shell halted construction of a new plant in Rotterdam meant to convert waste into jet fuel and biodiesel, warning that market conditions were not right.", "publication_datetime": "2024-08-15T13:45:33+00:00", "lang": "en", "url": "https://ca.finance.yahoo.com/news/flagship-green-fuel-factory-scrapped-134533922.html", "source": {"domain": "ca.finance.yahoo.com", "location": null}}, {"uri": "4c14f530ee07433facbb15d9f82f40d9", "title": "Company Names Tribunal decision: Tate Trade Limited", "body": "Applicant The Board of Trustees of the Tate Gallery objected to the name used by Tate Trade Limited under the Companies Act 2006.\n\nThis decision was undefended. ‘Undefended’ refers to decisions where there has been no defence in response to the application to the Company Names Tribunal.", "publication_datetime": "2024-08-15T13:45:33+00:00", "lang": "en", "url": "https://www.gov.uk/government/publications/company-names-tribunal-decision-tate-trade-limited", "source": {"domain": "gov.uk", "location": null}}, {"uri": "125aabc9424a43e3baa9c55aaff40b7f", "title": "Red Lobster in Fairfax City ‘not closing’ despite company’s financial struggles", "body": "Cheddar bay biscuits will continue to be served in Fairfax City — for now.\n\nRed Lobster’s lone Fairfax restaurant, located at 10325 Fairfax Blvd, will remain open despite the company’s ongoing financial troubles.\n\nThe seafood chain proposed closing the Fairfax location, as well as more than 200 others nationwide, on the grounds that its continued operation is “likely to continue to drive losses,” according to a federal court filing.\n\nUnder the proposal, Red Lobster would reject the leases at the locations, thereby allowing the chain to “avoid the incurrence of continued rental obligations.”\n\nThe chain voluntarily filed for Chapter 11 bankruptcy protection in May, alleging more than $1 billion in debt.\n\n“This restructuring is the best path forward for Red Lobster,” CEO Jonathan Tibus said in a statement. “It allows us to address several financial and operational challenges and emerge stronger and re-focused on our growth.”\n\nSix other Red Lobster locations in Virginia, including the Alexandria restaurant (555 S Van Dorn Street), are also on the proposed chopping block. A federal bankruptcy court in Orlando, Florida, is scheduled to hold a sale hearing on Sept. 5.", "publication_datetime": "2024-08-15T13:45:24+00:00", "lang": "en", "url": "https://www.ffxnow.com/2024/08/15/red-lobster-in-fairfax-city-not-closing-despite-companys-financial-struggles/", "source": {"domain": "ffxnow.com", "location": null}}, {"uri": "e764f9a306694907a3d15009865cb791", "title": "RERA Cases Weekly Round Up: August 5 To August 11,2024", "body": "Haryana RERA Directs Ocean Seven Buildtech To Pay Interest To 15 Homebuyers Of Expressway Towers For Delayed Possession\n\nCase – Rameshwar Singh Versus Ocean Seven Buildtech Pvt. Ltd. A/w 14 others\n\nHaryana Real Estate Regulatory Authority (Authority) bench, comprising Ashok Sangwan (Member), has directed Ocean Seven Buildtech Pvt. Ltd., the builder, to pay interest to the 15 homebuyers of the Expressway Towers project located at Sector 109, Gurugram, for the delay in handing over possession.\n\nThe project was an affordable housing project, and possession was expected to be handed over by the builder within 4 years from the date of building plan approval or environmental clearance, whichever is later.\n\nHaryana RERA Orders Czar Buildwell To Refund Amount Paid By Homebuyer Of Mahira Homes-104\n\nHaryana Real Estate Regulatory Authority (Authority) bench, comprising Ashok Sangwan (Member), directed M/s Czar Buildwell Pvt. Ltd., the builder, to refund the amount paid by the homebuyer along with interest.\n\nAlthough the due date for possession was set for 2026, the Authority revoked the project's registration on March 11, 2024, due to numerous violations of the Real Estate (Regulation and Development) Act, 2016. Since it was clear that the builder could not complete the project, the Authority granted a refund to a homebuyer of the Mahira Homes 104 Project.\n\nDelay Of 8 Years In Handing Over Possession Of Plot, Haryana RERA Orders Vatika Ltd To Refund\n\nHaryana Real Estate Regulatory Authority (Authority) bench, comprising Sanjeev Kumar Arora (Member), has directed M/S Vatika Limited, the builder, to refund the amount paid by the Complainant to purchase a plot after failing to hand over possession even after an eight-year delay.\n\nHaryana Real Estate Regulatory Authority (Authority) bench, comprising Ashok Sangwan (Member), has directed M/s Emaar Mgf Land Ltd., the builder to refund ₹1.30 crores with interest to homebuyer who purchased a villa in their Marbella Project.\n\nMahaREAT Directs Adani Estates To Pay Interest To Homebuyers For Delayed Possession\n\nMaharashtra Real Estate Appellate Tribunal (Tribunal) bench, comprising Shriram R. Jagtap (Judicial Member) and Shrikant M. Deshpande (Technical Member), has directed Adani Estates Pvt. Ltd., the builder, to pay interest to the homebuyer for the delay in handing over possession. Earlier, the Maharashtra Real Estate Regulatory Authority (Authority) had dismissed the homebuyer's complaint seeking interest for the delay from the builder.\n\nCan Homebuyers File Concurrent Complaints Before RERA and Consumer Court Seeking Similar Reliefs? MahaREAT Answers\n\nMaharashtra Real Estate Appellate Tribunal (Tribunal) bench, comprising Shriram R. Jagtap (Judicial Member) and Dr. K. Shivaji (Technical Member), has held that homebuyers can approach the Real Estate Regulatory Authority (Authority) even if they have already filed a complaint before the Consumer Court. However, if both complaints seek the same relief, the Doctrine of Election will apply. In such cases, homebuyers will need to withdraw their complaint from the Consumer Court to ensure that the complaint filed before the Authority remains valid.\n\nThe Doctrine of Election says that if an aggrieved party has two options to get the same relief, they must choose one option and cannot pursue both.\n\nKarnataka RERA Orders Shrivision Towers To Pay Interest To Homebuyer For Delayed Possession\n\nKarnataka Real Estate Regulatory Authority (Authority) bench, comprising Neelmani N. Raju (Member), has directed Shrivision Towers Private Ltd., the builder, to pay interest to the homebuyer for failing to hand over possession of the flat on time. According to the agreement, the builder was supposed to hand over possession by September 2021.\n\nKarnataka Real Estate Regulatory Authority (Authority) bench, comprising HC Kishore Chandra (Chairperson), has directed Mantri Technology Constellations Pvt. Ltd., the builder, to refund the amount paid by the homebuyer for purchasing a flat, after the builder failed to complete the project despite a four-year delay.\n\nMahaRERA Orders Builder To Pay Interest To Homebuyer Of Gokul Silvermist For Delayed Possession\n\nMaharashtra Real Estate Regulatory Authority (Authority) bench, comprising Mahesh Pathak (Member), directed M/s Heena Builders & Developers, the builder, to pay interest to the homebuyer for the delay in handing over possession of the flat. The homebuyer had booked three flats in Gokul Silvermist, Santacruz (West), and was expecting possession by December 2017.\n\nTelangana RERA Orders Refund To Homebuyers And Imposes ₹1.16 Crore Penalty On Jayathri Infrastructures For Selling Unregistered Project\n\nWhile hearing the complaint of fourteen homebuyers of the Lexico Park project, the Telangana Real Estate Regulatory Authority (Authority) bench, comprising Justice Dr. N. Satyanarayana (Chairperson), K. Srinivasa Rao (Member), and Laxmi Narayana Jannu (Member), directed the builder to refund the amount paid by the homebuyers to purchase the flats. Additionally, the Authority imposed a penalty of ₹1.16 crores on the builder for marketing, advertising, and selling the unregistered project to homebuyers.\n\nTelangana RERA Orders Refund To Homebuyers Of Jaya Gold And Imposes Penalty On Jayathri Infrastructures For Selling Unregistered Project\n\nTelangana Real Estate Regulatory Authority (Authority) bench, comprising Justice Dr. N. Satyanarayana (Chairperson), K. Srinivasa Rao (Member), and Laxmi Narayana Jannu (Member), directed M/s Jayathri Infrastructures India, the builder, to refund the amount paid by the Four homebuyers of Jaya Gold for their respective flats.\n\nAdditionally, the Authority imposed a penalty of ₹9.78 Lakh on the builder for marketing, advertising, and selling the unregistered project to homebuyers.\n\nTamil Nadu RERA Orders Builder To Provide Full Refund Of Homebuyer's Money Without Charging Any Cancellation Fee\n\nTamil Nadu Real Estate Regulatory Authority (Authority) bench, comprising Sunil Kumar (Member), has directed, M/s. Alliance Villas Pvt Ltd, the builder to refund the full amount paid by the homebuyer without deducting any cancellation charges.", "publication_datetime": "2024-08-15T13:45:24+00:00", "lang": "en", "url": "https://www.livelaw.in/round-ups/weekly/rera-cases-weekly-round-up-august-5-11-2024-266816", "source": {"domain": "livelaw.in", "location": null}}, {"uri": "3da93a1eabb744e098cea84b3afb1b18", "title": "Două mașini au ars în urma unui incendiu de vegetație", "body": "Două mașini au ars în urma unui incendiu de vegetație în localitatea Peștere din județul Bihor. Incendiul a izbucnit joi, din cauza unui scurtcircuit la substation electric. Pompierii au reușit să stingă flăcările care puteau să ajungă la o casă.", "publication_datetime": "2024-08-15T13:45:01+00:00", "lang": "id", "url": "https://jurnalul.ro/stiri/locale/incendiu-masini-vegetatie-973179.html", "source": {"domain": "jurnalul.ro", "location": null}}, {"uri": "7dee56f074aa4045887bcb79bb3dd739", "title": "NYSE: ADM Lawsuit Update: Investors Who Lost Money With Archer-Daniels-Midland Company Shares Should Contact the Shareholders Foundation", "body": "The Shareholders Foundation, Inc. announced that an update in the lawsuit that is pending for certain investors in shares of Archer-Daniels-Midland Company (NYSE: ADM). NYSE: ADM investors should contact the Shareholders Foundation at mail@shareholdersfoundation.com or call +1(858) 779 - 1554\n\nThe Shareholders Foundation, Inc. announced that an update in the lawsuit that is pending for certain investors in shares of Archer-Daniels-Midland Company (NYSE:ADM).\n\nInvestors who purchased shares of Archer-Daniels-Midland Company (NYSE: ADM) in 2021 or earlier and continue to hold any of those NYSE: ADM shares, have also certain options and should contact the Shareholders Foundation at mail@shareholdersfoundation.com or call +1(858) 779 - 1554.\n\nOn January 24, 2024, an investor in NYSE: ADM shares filed a lawsuit against Archer-Daniels-Midland Company alleging violations of securities laws. The plaintiff alleges among other things that the defendants made false and/or misleading statements, as well as failed to disclose material facts, about the performance and prospects of Archer-Daniels-Midland Company's Nutrition segment and its accounting practices, and that the Defendants made positive statements about the Nutrition segment as a future profit-driver for the Company, with the ability to capitalize on healthier eating trends and rising consumer demand for natural ingredients and flavoring. Defendants also created the impression that the Nutrition segment's growth would provide more diversification and earnings stability for Archer-Daniels-Midland Company.\n\nOn June 24, 2024, an amended complaint was filed.\n\nThose who purchased Archer-Daniels-Midland Company (NYSE: ADM) shares and continue to hold any of those NYSE: ADM shares, have also certain options and should contact the Shareholders Foundation, Inc.\n\nThe Shareholders Foundation, Inc. is a professional portfolio legal monitoring and a settlement claim filing service, which does research related to shareholder issues and informs investors of securities class actions, settlements, judgments, and other legal related news to the stock/financial market. The Shareholders Foundation, Inc. is not a law firm. Any referenced cases, investigations, and/or settlements are not filed/initiated/reached and/or are not related to Shareholders Foundation. The information is only provided as a public service. It is not intended as legal advice and should not be relied upon.", "publication_datetime": "2024-08-15T13:45:00+00:00", "lang": "en", "url": "https://www.newswire.com/news/nyse-adm-lawsuit-update-investors-who-lost-money-with-archer-daniels-22405327", "source": {"domain": "newswire.com", "location": null}}, {"uri": "16a6b87294414b99a701c013a1c53a25", "title": "Alcohol licence review for Indian restaurant in Boston found with two illegal workers", "body": "An Indian restaurant in Boston looks set to have its licence suspended after Home Office immigration officials found two illegal workers at the site, as well as another staff member who was \"intoxicated\" at work.\n\nBombay Brasserie on West Street in Boston has been licensed in the town since 2005, but that may soon come to an end after a recent Home Office immigration visit.\n\nThe Home Office requested a premises licence review at the restaurant in July on grounds of the licence holder's \"failure to promote the prevention of crime and disorder licensing objective.\"\n\nIt follows a visit by immigration officers to Bombay Brasserie in February of this year, where it was discovered that two out of the seven present staff members had \"no right\" to work in the UK.\n\nA civil penalty of £90,000 was issued to the owners in May following this visit, as stories on when one particular staff member conflicted from the owner and the staff member themselves, when quizzed by Home Office officials.\n\nThe owner went on to admit that these two illegal staff members had not been subject to any rights to work checks, and interviews conducted with staff revealed cash in hand payments rather than wage slips, meaning there were no tax contributions on these salaries.\n\nIn fact, checks of the Home Office system revealed that one staff member had applied for leave under the EU Settlement scheme on two separate occasions, once in 2021 and again in 2023, but was rejected on both occasions.\n\nAnother discovery during the Home Office's visit was one worker being \"intoxicated\" and in a state where they were \"unable to communicate\" with immigration officers.\n\nThe Home Office report on Bombay Brasserie summarises that the owner was found to be \"employing illegal workers,\" which not only \"provides an unfair competitive edge\" but also \"deprives the UK economy of tax revenue.\"\n\nIt recommends the removal of the designated premises supervisor and a period of suspension to allow this changeover to happen, all of which will be considered by Boston Borough Council's Licensing Sub-Committee on Thursday, August 22.", "publication_datetime": "2024-08-15T13:43:56+00:00", "lang": "en", "url": "https://mylocal.co.uk/feed/239372/alcohol-licence-review-for-indian-restaurant-in-boston-found-with-two-illegal-workers", "source": {"domain": "mylocal.co.uk", "location": null}}, {"uri": "18f8438f58694e66b5497b6f0e9ec9ce", "title": "Navalno našlė: mirties priežasties paaiškinimas neįtikina", "body": "Περιστής šešiems mēnesiams nuo Kremliaus kritiko Aleksejaus Navalno člėjime kalėjime, jo našlė Julija Navalnaja sukritikavo, kad Russių institucių nepateļių persuasnamo jo šrištų svetų služmamo.", "publication_datetime": "2024-08-15T13:43:46+00:00", "lang": "ms", "url": "https://ve.lt/pasaulis/navalno-nasle-mirties-priezasties-paaiskinimas-neitikina", "source": {"domain": "ve.lt", "location": null}}, {"uri": "21901f3c823d4d3a8728c41c387d1486", "title": "In the Era of \"Fast Fashion,\" New Research Reveals the Environmental Toll of Trendiness – The Intimate Window", "body": "New research reveals that “fast fashion” has a waste problem, and it's outpacing recycling efforts. See Original Article\n\nThe Showroom by ELLE is at 59 Greek Street, London, W1D 3DZ, from 3 to 5 October. ELLE Collective is a new community of fashion, beauty and culture\n\nSee Original Article", "publication_datetime": "2024-08-15T13:43:26+00:00", "lang": "en", "url": "https://theintimatewindow.com/in-the-era-of-fast-fashion-new-research-reveals-the-environmental-toll-of-trendiness/", "source": {"domain": "theintimatewindow.com", "location": null}}, {"uri": "737752da863f48d59ca17f6dd895e82c", "title": "SBI and PNB in talks with Karnataka govt for resolution over transaction suspension issue", "body": "Following Karnataka's unexpected decision to halt all transactions with them, the State Bank of India (SBI) and Punjab National Bank (PNB) on Thursday said that they are working with the state to find an \"amicable resolution\" on the matter. In their first official response to the Karnataka government's decision, the state-run banks issued separate statements indicating that the issue at the core of the problem is currently under judicial review.\n\n\"As the matter is currently subjudice, we are unable to provide any specific comments at this time. However, we remain in ongoing discussions with the Government of Karnataka to resolve the issue amicably,\" the SBI statement said.\n\nSBI's peer Punjab National Bank, also had a similar statement and pointed out that it will not be prudent to offer a specific comment on the matter. \"'The Bank is committed for an amicable resolution of the matter and is in discussion with the Government of Karnataka,\" the PNB statement said.\n\nKarnataka govt suspends all transactions with SBI and PNB\n\nThe Karnataka government had issued an order suspending all transactions with the State Bank of India (SBI) and Punjab National Bank. The order, approved by Chief Minister Siddaramaiah and issued by the Finance Secretary, directed all state departments to close their accounts with these banks and immediately recover their deposits. This comes amid allegations of misuse of government funds and illegal transactions.\n\nThe order came after the denial to redeem Rs 12 crore deposited by the Karnataka Industrial Area Development Board (KIADB) following a scam involving bank employees.\n\nAccounts held by state government departments, public enterprises, corporations, local bodies, universities and other institutions in the State Bank of India and Punjab National Bank should be terminated immediately. Additionally, no further deposits or investments should be made in these banks.\n\n“In this background, it is informed through this circular that the state government’s departments, public sector units, corporations, boards, local bodies and universities and other institutions should withdraw all the deposits/investments made in all the branches of the State Bank of India and the Punjab National Bank and no deposits/investments should be made in future,” the circular read.\n\nThe government also directed the government institutions to close their accounts in these two banks and submit the certified closer report and send details of deposits and investment reports in the prescribed format to the finance department by September 20, 2024.\n\nAlso Read: Karnataka govt suspends all transactions with SBI and Punjab National Bank: Know the reason\n\nAlso Read: Which bank is charging how much for not maintaining minimum balance? Check details here", "publication_datetime": "2024-08-15T13:43:02+00:00", "lang": "en", "url": "https://www.indiatvnews.com/karnataka/sbi-and-pnb-in-talks-with-karnataka-govt-for-resolution-over-transaction-suspension-issue-latest-updates-2024-08-15-947108", "source": {"domain": "indiatvnews.com", "location": null}}, {"uri": "d368fda4859b4014b9b7afae038e1066", "title": "Rogers Park Tenants Forced Out By Big Rent Hike As Area Faces 'Heartbreaking' Housing Crisis", "body": "ROGERS PARK — After more than eight years of living in her Rogers Park garden unit, DeAnna Bastin has made the apartment a well-decorated and much-loved home.\n\nIt has its flaws, like many century old Chicago apartment buildings do. There’s the chipped wood in the front door, the bathtub that feels like it’s sinking into the ground and the occasional decaying rat in the wall, she said.\n\nBut Bastin loves her apartment and, even more than the unit itself, she cares deeply for her neighbors and the community they’ve built.\n\nBastin, however, has to pack up her things and leave after being priced out of her building.\n\nThe courtyard building at 1740 W. North Shore Ave. changed ownership earlier this year, and the new landlord is increasing Bastin’s rent by 20 percent and introducing new fees on utilities, internet and pets.\n\nUnable to accommodate the price hikes, Bastin and some of her neighbors will have to leave once their leases are up. But first, they’ll have to clean a lot. Tenants were then given an extensive cleaning list to tackle before moving — with hundreds of dollars in fines to be levied if their units are not properly cleaned.\n\nThe ones who will stay at the building, meanwhile, are frustrated by the financial strain it’s going to put on their lives, multiple tenants said.\n\nThis isn’t the only building in Rogers Park seeing these changes. The Far North Side neighborhood has struggled for years with displacement and gentrification driving up the cost of living.\n\nThe area including Rogers Park, Edgewater and Uptown saw a 12.5 percent decline in the amount of apartments affordable for low-income renters between 2012 and 2021, according to a 2023 study by the Institute for Housing Studies at DePaul University. That is the third biggest drop in affordable apartments of any area of the city during that period, trailing only Logan Square and Avondale (15.3 percent decrease in affordable apartments) and West Town/Near West Side (14.6 percent decrease).\n\nThe Far North Side neighborhoods also saw a 9.5 percent increase in the amount of low-income renters living in unaffordable apartments over the same period, one of the biggest jumps in number of rent-burdened residents of any neighborhood, according to the study.\n\nBastin wants to stay in Rogers Park, but there aren’t many options that fit her budget of $1,250, she said. She works full-time earning enough to live comfortably — or so she thought.\n\n“The rental market is insane,” she said. “You either find something that is just completely unlivable — like, ‘Why does this have a half stove?’ — or they’re like, ‘It’s a one bedroom,’ but it’s really just like an alcove and there’s not even a door.”\n\nAnnual rent increases are an understandable part of being a renter, but when they’re this steep and come without any major improvements to the apartment, Bastin and her neighbors said they can’t willingly accept it.\n\n“To me, they’re price gouging because they can,” one of Bastin’s neighbors said. “It’s like they have no compassion towards people. It’s just all about money.”\n\nWhen Bastin first moved into the apartment, her rent was around $950, she said. Her rent increased $25 a year under the building’s previous owners.\n\nThis spring, Bastin and her neighbors received a notice from building owner DLG Management that the complex had been purchased by Casey Capital, a real estate company founded in 2020. Casey Capital bought the building for $4 million, property records show.\n\nA few months later, Bastin received word from Casey Capital about her apartment’s rent going forward. If she renewed her lease, her rent would go from $1,125 to $1,350 per month, according to a copy of the lease renewal shared with Block Club.\n\nCasey Capital also introduced new fees: an $85 monthly utility fee covering water, heat, sewer and trash removal, and pet rent of $25 a month per pet, according to the lease renewal. These were utilities that were previously included in tenants’ rent, Bastin and her neighbors said.\n\nBeginning in October, the company is also instituting a required, bulk internet service for an additional $40 a month.\n\nIf Bastin resigned, the total cost of her same apartment going forward would be $1,475. The company is waiving an initial year of pet rent for current tenants, according to the lease renewal — which would cost another $75 a month for Bastin, since she has two dogs and a cat.\n\nIn their lease offering to Bastin, Casey Capital acknowledged the price change was “steep” and said “smaller and more predictable” rent increases — about 3-5 percent — could be expected going forward. To offset the steep increase, Casey Capital offered tenants a 20-month lease that would bypass one year’s worth of rent hikes.\n\n“It’s frustrating to be forced out of your home when I have a perfectly good apartment that I clearly have been able to afford and maintain,” Bastin said.\n\nBastin isn’t aware if any major repairs or renovations are being planned for her apartment, she said.\n\n“I feel like letting somebody come in and charge [hundreds] more for the same unit — that’s not inflation, that’s just greed,” she said.\n\nSome of Bastin’s neighbors are going to absorb the increased cost of their apartments, but they aren’t happy about it.\n\nOne woman said she’s anxious about the cost increase she’ll get with her renewal offer after hearing about what her neighbors were getting. The neighbor, who asked to remain anonymous over fear of retribution from management, said she’s lived in the building for a few years.\n\n“I don’t want to move,” she said. “I moved around a bunch my whole life, so this is the first place I ever lived longer than two years.”\n\nThe woman has been unable to work in the past because she has autism and struggles with autistic burn-out, but the worry about being financially burdened has her contemplating going back to work regardless of the effects it may have on her mental health, she said.\n\nHer husband is also now looking for a higher-paying job, but she knows many of her neighbors aren’t in the same position to do so, she said.\n\n“They know what they’re doing,” she said of the company. “They know they’re forcing people out.”\n\nAnother neighbor who’s lived in the building for nearly 20 years is still figuring out whether she’ll be able to stay in her apartment. This neighbor also asked not to be named while her lease renewal was up in the air.\n\nThe woman has a fixed income and a housing voucher, so dramatic changes in rent and associated fees are difficult to manage, she said. She was also frustrated by the required internet service through the building, because it’s a provider she’s had issues with in the past.\n\n“It’s just too much, especially when you have good tenants that have been in the building for years and years, and you see that they keep up your property,” she said. “But it’s all about the almighty dollar.”\n\nAside from the financial strain people are facing, “it’s heartbreaking” to see neighbors they’ve grown close to have to move, she said.\n\n“We’re like family here in the building, everyone looks out for each other,” the woman said.\n\nThe displacement these tenants are experiencing is a microcosm for housing issues seen across the neighborhood and the city, particularly with the loss of naturally occurring affordable housing, said Arieh Venick, a community organizer with the nonprofit ONE Northside.\n\nMany of Chicago’s naturally occurring affordable housing (that is, units that are not required by the city to be earmarked as affordable) is in buildings that tend to be older, owned by smaller landlords and may not be in top condition, Venick said.\n\nCompanies buy these buildings and “slap a fresh coat of paint on and try to rent it to a college student or a young urban professional who’s looking for cheaper housing in a hip neighborhood,” he said.\n\nHistorically, Rogers Park has had many such buildings. Diversity of building ownership, like mom-and-pop landlords or neighbors who own the three-flat they live in and rent the other two units, has helped provide affordable places to stay, said Ald. Maria Hadden (49th).\n\nBut in recent years, building turnover in the neighborhood has increased. And “with the concentration of wealth and capital,” large management companies are the only players in the market who can buy these buildings, the alderwoman said, speaking anecdotally.\n\nWhen companies take ownership and raise rents, it can also have a ripple effect on other buildings, Hadden said. In a neighborhood where 75 percent of residents are renters, the loss of affordability is having a “devastating” effect on the neighborhood, Hadden said.\n\n“It’s a big challenge in the 49th Ward right now,” she said. “Because rents are going up at some of these properties that are changing hands. The other thing that you see is properties that aren’t changing hands, those landlords are taking advantage to also raise their rents just because.”\n\nSituations like what’s happening at Bastin’s building “are one of the top situations fueling a growing homeless and housing precarious population in the city,” Venick said.\n\nTenants are required to be given 60-120 days notice of a rent increase, but for people living paycheck to paycheck, it isn’t enough time to find an alternative, he said.\n\n“I think Rogers Park is really emblematic about some of the stuff we’re seeing across the city, and we’ll continue to see on the North Side if these landlords are not able to be brought to heel, and more tenant protections and organizations don’t pop up,” Venick said.\n\nForming tenants’ unions is one of the best ways to combat exploitative practices by landlords, according to Venick. There are limited ways in which local government can address the situation, Hadden said.\n\nFor example, there’s currently a ban on rent control in Chicago that was made at the state level, meaning Hadden and her colleagues can’t do much on their own, she said.\n\n“I’m very supportive of rent control,” the alderwoman said. “Unfortunately, with so many thing around real estate, we find ourselves at an impasse.”\n\nAside from rent control, Venick said the city should also pass policies like the Just Cause Ordinance — which supporters say would protect tenants from no-cause evictions — and allocate more money toward the creation of public, affordable housing.\n\n‘Are They Just Insane With Power?’\n\nShortly after Bastin let Casey Capital know she wouldn’t be resigning, she was emailed a two-page list of move-out instructions and the fees she’d be charged if the place wasn’t up to snuff.\n\nThis included things like $15 for each light fixture she didn’t clean, $25 if the smoke detector batteries needed replacing and $25 if the area under the microwave was left dirty, according to a copy of the document shared with Block Club. There’s also a $35-$75 fee if she didn’t mow the lawn — which confused her, as she doesn’t have a lawn to mow.\n\nThe listing for Bastin’s apartment is already on Casey Capital’s website.\n\nRent is advertised as $1,350, but the total cost of the apartment with a one-time $50 application fee, a $750 move-in fee and the monthly utility and internet fee of $125, it comes to $1,542 a month, according to the listing.\n\nIf a new tenant had pets, like Bastin does, it’s an additional one-time fee of $250 with $25 monthly pet rent per dog or cat.\n\nAs Bastin looks for new apartments, the prospect of staying in Rogers Park — where she’s lived for 14 years — is unclear.\n\n“You just wonder like, what are these landlords doing? Are they just insane with power? I don’t understand,” Bastin said.", "publication_datetime": "2024-08-15T13:43:00+00:00", "lang": "en", "url": "https://blockclubchicago.org/2024/08/15/rogers-park-tenants-forced-out-by-big-rent-hike-as-area-faces-affordability-crisis-its-heartbreaking/", "source": {"domain": "blockclubchicago.org", "location": null}}, {"uri": "2de933fb85e548b482a1e46fbfb1e8bc", "title": "Modehersteller wollen weiter in Bangladesch produzieren", "body": "Cologne · The political situation in Bangladesh is unstable. However, clothing manufacturers are not initially planning any consequences. This also applies to the textile discounter Kik.\n\nThe fashion association GermanFashion has not yet seen any major impact on the industry following the recent unrest in Bangladesh. When asked, it cannot be confirmed that orders will be canceled and relocated to other countries. On the whole, the situation on site has calmed down again. Production is stable and a backlog in the port is the only hurdle. The textile discounter Kik is also not planning to relocate production. “Bangladesh is and remains a particularly important production country for us,” said a spokesman. According to the company, Kik's supplier network includes around 100 textile factories in Bangladesh. The Swedish fashion chain Hennes & Mauritz (H&M) informed the German Press Agency that all of its suppliers' factories in Bangladesh are currently open. The company has not changed its long-term strategy in the country and continues to assess the situation daily, a spokesman said. The fashion retailers Zara and Hugo Boss, which also produce clothing in Bangladesh, did not initially respond to a dpa request. The vice president of GermanFashion, Justus Lebek, said: They are monitoring the situation closely and are expecting slight delays in deadlines, \"but the end consumer will not notice anything about them.\" During the corona pandemic, production in China stood still for months, but it still didn't happen There were bottlenecks, it was said. Many companies have therefore recently positioned themselves more broadly. For example, closer production locations in North Africa have become more important. According to the fashion association, the manufacturers in question have maintained close relationships with their production facilities in Bangladesh that have developed over the years. August is therefore not a strong production month for medium-sized fashion companies. The autumn and winter goods are being delivered and the next production cycle is just starting. GermanFashion represents 350 companies from the industry. After China, Bangladesh is the most important importing country for clothing for the fashion industry in Europe and Germany. There are almost 4,000 textile factories there that employ more than four million people, mostly female workers. According to the Federal Statistical Office, goods worth a total of 7.1 billion euros were imported from Bangladesh to Germany in 2023. After the unrest in Bangladesh with hundreds of deaths, representatives of the army and industry announced that they would protect the operation of textile factories that are important to the country. The Bangladesh Chamber of Commerce had previously said that there had been looting, destruction and arson attacks on a number of textile factories. Many businesses were therefore temporarily closed.", "publication_datetime": "2024-08-15T13:43:00+00:00", "lang": "de", "url": "https://www.wz.de/wirtschaft/modehersteller-wollen-weiter-in-bangladesch-produzieren_aid-117850819", "source": {"domain": "wz.de", "location": null}}, {"uri": "3e2979bf872f432a85ea2294946b2fce", "title": "В Твери на улице Коминтерна прорвало канализационные трубы", "body": "In Tver, on Comintern Street in the area where the Crystal Palace hotel and gas station are located, sewer pipes burst. Eyewitnesses reported this to the editors of tver.aif.ru.\n\nTver residents note that there is a sharp, unpleasant smell that penetrates even the closed interiors of vehicles: “it feels very sharp.” Also on the road between houses No. 81 and No. 38B, spills similar to sewage are visible.\n\nThe information is being clarified. Read more Read more In Tver, on Stepan Razin Street, a truck got stuck under the bridge Read more", "publication_datetime": "2024-08-15T13:43:00+00:00", "lang": "ru", "url": "https://tver.aif.ru/society/details/v-tveri-na-ulice-kominterna-prorvalo-kanalizacionnye-truby", "source": {"domain": "tver.aif.ru", "location": null}}, {"uri": "a7112bcfcbe0402685e1795c06093886", "title": "Nach Havarie: Fahrgäste der RSAG von Straßenbahnausfall überrascht", "body": "Rostock. Chaos in Rostock's local transport: After the tracks in the Dierkower Damm/Knochenmühle area collapsed due to construction work on Thursday night, no trams run between the Dierkower Kreuz and Steintor stops. A replacement bus service was set up for passengers at affected stops.\n\nThanks to the bus, 80-year-old still manages to get to the doctor\n\nOne of the commuters affected is Uwe Baas: “I wanted to go into the city and the tram wasn’t coming. There was no information on the platform about the replacement service and why the train wasn't coming. “It can be done better,” says Baas. The 80-year-old was on the way to the doctor when he was surprised by the total breakdown of the tram. “Other passengers then informed me about the alternative service and I was able to attend my doctor’s appointment,” the pensioner continues.\n\nBianca Baron and Jens Becker were also surprised by the replacement traffic: “We didn’t know in advance and were surprised,” said Baron. Since there are no display boards at their stop in Toitenwinkel, the friends had to find out about the alternative transport connections themselves. “Once we had all the information, it worked,” says Jens Becker. “Some of the buses were very full,” remembers Becker. But he understands that: “A bus is of course much smaller than a tram. Not that many people can take part,” says Becker.\n\nThe RSAG also knows about the full buses: “We had to set up an emergency timetable in a very short time. Since we were only able to rely on free buses and drivers, the individual replacement connections can get a little fuller,” says RSAG press spokeswoman Beate Langner.\n\n“We found out about the slump tonight and are working hard to get the route ready for use again,” said Langner. During the night, a cyclist noticed the sagging of the cycle path next to the rails, whereupon he informed the police. “We then decided to let the trains travel over the affected area with a speed limit,” explains Langner.\n\nAfter a few crossings, the full extent of the subsidence became apparent and rail traffic was interrupted. According to OZ information, the sagging in the trains was clearly noticeable. However, there was no damage to people or trains.\n\n“The reason for the subsidence was construction work by the municipal utilities,” explains Langner. During work on a district heating pipeline, drilling was carried out under the tracks, whereupon the cycle path and tracks collapsed for reasons that are still unclear.\n• None Accident in Rostock: Trams between Dierkow and Steintor are canceled\n• None holidaymaker from Saxony-Anhalt dies on the beach in Zinnowitz on Usedom\n• None Nord Stream attacks: Was the suspect caught in Lietzow on Rügen?\n\nPeter Lück, spokesman for the Rostock municipal utility company, confirms: “The subsidence was caused by drilling work for a district heating pipeline.” More precisely, two parallel holes were drilled through the ground below the cycle path and the tracks using a so-called horizontal drilling. “The investigation into the exact cause of the slump will begin tomorrow,” said Lück. To do this, the tram route must first be repaired.\n\n“We cannot currently say when operations will be restored,” said Langner. The first information about a restoration of rail traffic would be published in the late afternoon. Buses will continue to operate until repairs are made. Information about departure times and routes is available on the RSAG website.", "publication_datetime": "2024-08-15T13:42:42+00:00", "lang": "de", "url": "https://www.ostsee-zeitung.de/lokales/nach-havarie-fahrgaeste-der-rsag-auf-ersatzverkehr-angewiesen-WGFBNY2VZNBXDFD2EGTXTTOZOM.html", "source": {"domain": "ostsee-zeitung.de", "location": null}}, {"uri": "e028e32962ce41d7b44aec4ab2da6858", "title": "Company Names Tribunal decision: Lumix Solutions Ltd", "body": "Applicant Panasonic Corporation objected to the name used by Lumix Solutions Ltd under the Companies Act 2006.\n\nThis decision was undefended. ‘Undefended’ refers to decisions where there has been no defence in response to the application to the Company Names Tribunal.", "publication_datetime": "2024-08-15T13:42:30+00:00", "lang": "en", "url": "https://www.gov.uk/government/publications/company-names-tribunal-decision-lumix-solutions-ltd", "source": {"domain": "gov.uk", "location": null}}, {"uri": "b689406b2b0f454f8446aff19d0814fa", "title": "В ЖК «А101 Всеволожск» придомовые территории благоустроят в эко-тематике", "body": "Unique themed courtyards reflecting the diversity of flora and fauna in the Leningrad region will become a highlight of the new residential area in Vsevolozhsk, being developed by the A101 Group of Companies. Each house here will not only have its own landscaped territory but also its original design.\n\nThe residential area \"A101 Vsevolozhsk\" is being built in the Southern microdistrict of the city. The project envisions the integration of residential buildings into the natural landscape while preserving and recreating the natural environment. This approach will also be applied to the landscaping of the adjacent territories. The courtyards of the new residential area are planned to feature diverse spaces with natural elements, with each courtyard differing from the others. The unique designs of the courtyards will add extra individuality to each house, while the use of various natural motifs will help avoid monotony in the landscape and surrounding environment.\n\nFor example, one courtyard, named \"Forest Bird,\" will be equipped with a playground designed like a nest and birdhouses. The second house will have its own \"Rabbit Hole\" – a courtyard with a trampoline shaped like a rabbit burrow, which will become a favorite spot for local children. Residents of two other houses will stroll and relax in courtyards designed according to their names \"Honey Bee\" and \"Bellflower.\" The first will feature play elements resembling a beehive and honeycombs, while the other will have tactile play areas and structures shaped like flowers.\n\nThis landscaping concept will not only make the adjacent spaces more aesthetically appealing but will also promote the development of cognitive and play skills in children. The interests of adult residents have also been taken into account. Cozy spots for sports, relaxation, and meetings with neighbors will be created in the courtyards.\n\nParticular attention in the project is given to safety and functionality. Each courtyard in the \"A101 Vsevolozhsk\" residential complex will be fenced and equipped with modern lighting systems, anti-slip surfaces, and wide, comfortable paths for walking and cycling.\n\nThe concept of landscaping also applies the principle of climate comfort. For this purpose, playgrounds will be built in sunny areas, and each courtyard will have covered gazebos where people can shelter from the wind and rain. Sports and yoga areas will also be covered with awnings for the same reasons. To ensure natural wind protection, plans include preserving the existing trees on the site and planting new ones, focusing on plants that are traditional for the local climate.\n\nThe landscaping of the new residential area is designed to cater to the interests of all age groups. Various public functional areas will be created on its territory: for quiet and active recreation, sports activities, educational spaces, entertainment areas, and even a new eco-trail running through the pine forest. The zoning is thoughtfully planned to avoid rigid separation and provide each resident with the opportunity to choose activities based on their interests and mood, which will foster good neighborly relations.\n\n\"The architectural concept of the project embodies modern ideas for the collaboration of urban environments with nature, which will create a comfortable and harmonious space for active and healthy living. In the landscaping of the 'A101 Vsevolozhsk' residential area, the priority is to maximize the preservation of the existing trees and shrubs on the site. The natural environment will be recreated in the courtyards and around them: plants that traditionally grow in this area have been chosen for greening. The shrubs and plants are selected to ensure almost continuous blooming in the area from May to October, and the landscape in the courtyards will change with the seasons,\" says Bulat Mirzahanov, head of product development at A101 Group in St. Petersburg.", "publication_datetime": "2024-08-15T13:42:28+00:00", "lang": "ru", "url": "https://www.fontanka.ru/2024/08/15/73963448/?erid%5C%5Cu003d2SDnjcJ3YZg=", "source": {"domain": "fontanka.ru", "location": null}}, {"uri": "de3319b99b21431bb345a18f809849f7", "title": "Mining in Canada: Court appoints receiver at Yukon site", "body": "A judge has granted an order appointing a receiver to take control of assets at a gold mine closed after a massive slide of cyanide-contaminated ore in June, Yukon’s justice minister said.\n\n\n\n Tracy-Anne McPhee said in a statement Wednesday that the government had petitioned the Ontario Superior Court of Justice for the receiver after it lost confidence that Victoria Gold would take seriously the health, safety and environmental consequences of the failure at the Eagle Gold mine.\n\n\n\n McPhee said PricewaterhouseCoopers Inc. would administer the assets and liabilities formerly under the control of Victoria Gold at the direction of the territorial government and under the supervision of the court.\n\n\n\n “Immediate action is required to respond to the heap leach failure and its consequences for the land, water, people and wildlife in the Traditional Territory of the First Nation of Na-Cho Nyak Dun,” McPhee said.\n\n\n\n “The Government of Yukon is concerned that Victoria Gold Corp. does not possess the capacity itself and has failed to carry out the work that is required.”\n\n\n\n The minister said Victoria Gold “has failed to comply with several formal directions” issued by the government, which “require specific measures to be undertaken to address human health and safety and environmental risks and impacts.”\n\n\n\n On June 24 the heap-leach facility at Eagle Gold mine failed, causing a slide of cyanide-contaminated ore and releasing millions of litres of cyanide solution used in the gold extraction process.\n\n\n\n Yukon officials have said some water samples taken downstream have shown cyanide levels that “significantly exceed” guidelines for aquatic life.\n\n\n\n Brendan Mulligan, a senior Yukon government scientist, told a briefing last week that “clear evidence” of groundwater contamination had also been found, though samples with the highest concentrations of cyanide were being “contained on site.”\n\n\n\n Health officials have said that contamination does not impact drinking water.\n\n\n\n Both the territorial government and the First Nation of Na-Cho Nyak Dun filed applications in separate courts this week asking for a receiver to be appointed, something the company said in a statement it was opposing.\n\n\n\n Chief Dawna Hope told a news conference earlier Wednesday that the court action was the only way the First Nation could ensure that steps necessary to mitigate the disaster would be taken.\n\n\n\n She said Victoria Gold was failing to do what was needed to protect land and water from the cyanide.\n\n\n\n “This is unacceptable. Immediate steps are needed to address the millions of litres of toxic cyanide and other contaminants spreading from the mine site,” she said.\n\n\n\n “Every mitigation measure must be implemented to protect the lands, waters, fish, wildlife and the people impacted by this disaster. We have no confidence that Vic Gold is in a financially stable enough position to repair the environmental damages its failures have caused.”\n\n\n\n McPhee said the territorial government has entered into an agreement with the receiver to advance the money required to undertake mitigation work, which will be treated as debt to be prioritized over others owed by Victoria Gold.\n\n\n\n At the First Nation’s news conference, consultant Cord Hamilton estimated the cost of cleaning up the spill would be “something in the magnitude of order of $100 million” on top of the cost of closing and remediating the mine.\n\n\n\n The Yukon government has previously said it has $104 million in bonds to cover remediation costs if the mine were to cease operations.\n\n\n\n Victoria Gold CEO John McConnell did not respond to a request for comment.\n\n\n\n The mine is located about 400 kilometres north of Whitehorse, on the traditional territory of the Na-Cho Nyak Dun, which has called multiple times for Victoria Gold to be removed from managing the cleanup.\n\n\n\n Bill Slater, an environmental consultant working with the First Nation, told the news conference that there is not enough storage at the mine to contain the contamination and that water treatment has been ineffective.\n\n\n\n Earlier this month the Yukon government said 68 dead fish were found following a discharge of treated water from the site.\n\n\n\n “The lack of effective water treatment also means that existing storage on site is almost full. That includes the dynamic storage that they created by starting to pump solution back onto the heap again on July the 14th,” he said.\n\n\n\n “If not addressed, this lack of storage could lead to discharge of contaminated solution directly.”\n\n\n\n The nation has previously called for a public inquiry to look into “failures that caused this catastrophe and ensure it never happens again.”\n\n\n\n Slater said the government has ordered the company to build more groundwater collection wells, but that has not happened.\n\n\n\n The receiver is not Victoria Gold’s only legal challenge.\n\n\n\n A Vancouver-based law firm has also filed a proposed securities class-action lawsuit against Victoria Gold, alleging the company made misleading statements regarding the safety and environmental practices at the mine, particularly concerning its heap leach facility.\n\n\n\n The territorial government’s petition for a receiver was filed in Toronto, where Victoria Gold’s corporate office is located, while the First Nation filed its application in Yukon Supreme Court.\n\n\n\n The First Nation’s petition says the disaster is still unfolding and is impacting “the inherent, constitutional and treaty rights” of the First Nation.\n\n\n\n It says the company’s attempts to contain the cyanide have been inadequate and it has refused to comply with government orders.\n\n\n\n It says the company owes the First Nation more than $750,000 in royalty payments under the agreement that permits the mine to operate.\n\n\n\n Those allegations had not been heard in court before the decision on the territorial government’s application was made.\n\n\n\n This report by The Canadian Press was first published Aug. 14, 2024.", "publication_datetime": "2024-08-15T13:42:07+00:00", "lang": "en", "url": "https://newscontinue.com/mining-in-canada-court-appoints-receiver-at-yukon-site/", "source": {"domain": "newscontinue.com", "location": null}}, {"uri": "0ab8a0129b9146a8be2176a87eb57938", "title": "Sonos Slashes 100 Jobs After Mobile App Fiasco, May Bring Back Old App", "body": "Sonos has laid off approximately 100 of its employees, which is a mere 14 months after the beleaguered smart home audio company dropped roughly 150 of its 1,800 workforce. The timing of this comes after product delays plus the well-documented (and disastrous) rollout of the Sonos app , not to mention the company's earnings call last week, in which we're sure investors demanded accountability.According to a statement made by Sonos to a popular tech site, the once haloed company many likened to the Apple of audio products, has confirmed that it's entered a second round of layoffs following a similar one in 2023. In the statement, Patrick Spence, Sonos CEO, defended the move, saying that \"this action was a difficult, but necessary, measure to ensure continued, meaningful investment in Sonos’ product roadmap while setting Sonos up for long term success.\"Spence went on to add that the app kerfuffle, and more importantly, the fix for it hasn't been affected by this shakeup. He declared that is \"our continued commitment to the app recovery and delighting our customers remains our priority and we are confident that today’s actions will not impact our ability to deliver on that promise.”Let's be clear, Spence made no direct mention that the layoffs are directly related to the app. Apparently, the 100 ex-employees came from various divisions, such as product engineering, marketing, software quality, and platform/infrastructure. However, it's not hard to see that the problematic app may have had something to do with the decision.In fact, Sonos has had to delay two new products to solve the app issue, which probably demonstrates how bad the situation is. In the last few months since Sonos rolled out a major app update, users have experienced widespread functionality and stability issues. Some experienced complete lockout from their libraries, while for others, the app completely broke their systems or messed with their settings.The reception for the app update has been so bad that throngs of long-time Sonos fans have either left the brand or boycotted it completely. As for repercussions for the company, fixing the app won't be cheap. Besides the delayed products, Spence told investors in the earnings call last week that getting the app up to snuff will be around $20 million to $30 million. Yikes.", "publication_datetime": "2024-08-15T13:42:00+00:00", "lang": "en", "url": "https://hothardware.com/news/sonos-slashes-100-jobs-after-mobile-app-fiasco", "source": {"domain": "hothardware.com", "location": null}}, {"uri": "63e38a0aae9d4b5b8becc654676869f6", "title": "Aviation expert: airBaltic has to collapse financially at some stage", "body": "The issue of ultra-high-interest bonds has already demonstrated that airBaltic is financially close to the end, and the Latvian government faces decisions regarding whether and how to proceed with its national airline, aviation expert Toomas Peterson told ERR.\n\nairBaltic, which reported a loss of almost €90 million for the first half of 2024, is using a rather old-fashioned national airline model that requires a lot of investment, while the hope of becoming profitable remains rather distant, Peterson said.\n\n\"This is not the right business model in my opinion. This old-fashioned national airline business model, which does not pay off on this kind of scale. Like we had Estonian Air, trying to go very wide, so that if there is an effect of scale, you can make a profit, but it takes a long time and a lot of investment. Basically, it is not a profit-making project, but the Latvians have the same argument that Estonia might have, that (without it) you wouldn't be able to fly out of this corner of the world,\" Peterson said.\n\nFinancially, however, airBaltic is in a bad way, as its high-interest bond issue showed, said Peterson, who has been the head of both Estonian Air and the Estonian Civil Aviation Administration (Lennuamet).\n\n\"The biggest negative signal actually was that they got a loan from the market at only 14.5 percent interest, which is still terrible these days. Basically, it shows that it's just a pyramid scheme in financial terms, and that at some point it just has to collapse,\" Peterson said.\n\nPeterson added that if it were up to him. he would change airBaltic's business model.\n\n\"This (legal) body has to be replaced by another one. It was a bit like what happened with Estonian Air when it did not get the state approval (from the European Commission) that the Latvians got,\" he said.\n\n\"I am not in favor of state capitalism, that the state should be the owner of something, but the thing about air connections is that you have to pay extra if you want to fly ten times a day to Europe. My estimate is that the Estonian state would have to pay something like 30 to 40 or even €50 million a year. But in this form, I would recommend that (airBaltic) be shut down, despite the fact that Estonian passengers also benefit from it,\" Peterson said, adding that airBaltic is such a mess in commercial terms that it will be difficult to close it down.\n\nAviation expert Sven Kukemelk told ERR that despite the huge losses, airBaltic is still a profitable project for the Latvian state, as tourism and jobs cover those losses many times over.\n\nAccording to Peterson, a comparison can be made with the planned Rail Baltica.\n\n\"We can make socio-economic calculations, and it's true that the development of the economy is very much dependent on it, but these are all forward-looking calculations. We don't know how the economy will do at all, or how many passengers will come, and a lot depends on their purchasing power. So, it's all apples and oranges. But to put it crudely – if they only got a 14.5 percent interest loan from the market, that shows that essentially the end is near,\" Peterson said.\n\nJan Palmer, the former head of Estonian Air and Nordica, told ERR that airBaltic's performance in the first half of 2024 was certainly poor, but it was also influenced by a number of external factors. They include problems with engine deliveries, recovery from the pandemic and the war in Ukraine. The potential for airBaltic to achieve success as an airline has not disappeared, he said.\n\n\"As an airline they have done a good job, but they have been affected by these external factors. And if you have a lot of planes that can't fly because of engine problems, well, it's one thing to have the repair costs that can be covered by insurance, but losing revenue would be a big problem for any airline,\" Palmer said.\n\nAccording to Palmer, the Latvian government may still find it is profitable to run a national airline.\n\n\"There may be socio-economic calculations behind it – if it is worth it for Latvia and the government is willing to support it because the associations will ensure that it is good for business and tourism, then from that perspective it may make sense,\" he said.\n\nFollow ERR News on Facebook and Twitter and never miss an update!", "publication_datetime": "2024-08-15T13:42:00+00:00", "lang": "en", "url": "https://news.err.ee/1609425802/aviation-expert-airbaltic-has-to-collapse-financially-at-some-stage", "source": {"domain": "news.err.ee", "location": null}}, {"uri": "340064252d7846eb913d61846128237b", "title": "MHADA Lottery 2024: Maharashtra Housing and Area Development Authority Issues Warning After Fake Website Defrauds Mumbai Home Aspirants", "body": "Mumbai, August 15: The Maharashtra Housing and Area Development Authority (MHADA) has issued a warning about a fake website, https://mhada.org, which is deceiving people seeking flats through the MHADA lottery 2024. Discovered on August 13, the fraudulent site closely resembles the official MHADA portal, https://mhada.gov.in. The scam has reportedly ensnared several hopeful applicants.\n\nMHADA officials were alerted when an applicant, who had already made a payment, visited their office. The applicant had been misled into paying an initial amount and shown a Low Income Group flat in Goregaon West, which cost approximately INR 30 lakh. The scam involved directing victims to the fake site for payment, bypassing the official lottery process. MHADA Lottery 2024: MHADA’s Mumbai Board Announces Lottery for Sale of 2,030 Flats, Online Registration To Begin on August 9; Check Details.\n\nThe fake website offered direct payment options and issued fraudulent receipts, misleading individuals into paying INR 50,000. The genuine MHADA website does not include a payment link; all transactions are processed through MHADA’s secure IHLMS 2.0 computerised system, which handles registrations and payments. MHADA Mumbai Board Lottery 2024: Advertisement for 2,030 Houses Likely Soon on mhada.gov.in; Check All Details Here.\n\nMHADA Vice-President and CEO Sanjeev Jaiswal emphasized that all applications must be submitted through the official website, https://housing.mhada.gov.in, and warned against engaging with unofficial sites or intermediaries. He urged the public to report any suspicious activities to MHADA’s Chief Vigilance and Security Officer or Deputy Chief Officer (Marketing) of the Mumbai Board.\n\nMHADA has registered a complaint with the Mumbai police’s cyber cell and is investigating the fraud, cautioning against unauthorised transactions and ensuring that the official application process remains secure and transparent.\n\n(The above story first appeared on LatestLY on Aug 15, 2024 07:11 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com).", "publication_datetime": "2024-08-15T13:41:53+00:00", "lang": "en", "url": "https://www.latestly.com/india/news/mhada-lottery-2024-maharashtra-housing-and-area-development-authority-issues-warning-after-fake-website-defrauds-mumbai-home-aspirants-6192025.html", "source": {"domain": "latestly.com", "location": null}}, {"uri": "fba9e7fce0734aaba1272358108ad91f", "title": "Un autobus di linea è finito fuori strada vicino a Verona: una donna è morta e altre sei persone sono ferite", "body": "Thursday morning a bus from the ATV line, the company that provides public transport in Verona, ran off the road near the hamlet of Parona while heading towards the city, along the Adige river: it invaded the oncoming lane and was ended up against a wall. Among the passengers, a woman died and six other people were injured. Among these there is also the driver, who was stuck in the vehicle for hours and was then taken to hospital in serious conditions. The causes of the accident have not yet been clarified: the authorities have seized the driver's mobile phone and will look at the recordings of the video surveillance cameras inside the vehicle, which ATV will hand over to the police.", "publication_datetime": "2024-08-15T13:41:49+00:00", "lang": "it", "url": "https://www.ilpost.it/2024/08/15/autobus-verona-fuori-strada/", "source": {"domain": "ilpost.it", "location": null}}, {"uri": "b1be9a39723e4a3c8149835a6d46573c", "title": "Valeura Energy Inc.", "body": "09:43 AM EST - Valeura Energy Inc. : Announced first oil production from its Nong Yao C development, in Licence G11/48 (90% operated working interest), offshore Gulf of Thailand. Valeura Energy Inc. shares T.VLE are trading unchanged at $4.69.", "publication_datetime": "2024-08-15T13:41:10+00:00", "lang": "en", "url": "https://www.baystreet.ca/stocksinplayarticles/42685/Stocks-in-Play-Valeura-Energy-Inc", "source": {"domain": "baystreet.ca", "location": null}}, {"uri": "aa52c2882d434e40bc39919fed5cac33", "title": "Internet disruptions: some Pakistani freelancers made ‘unavailable’ on fiverr", "body": "A multinational online marketplace for freelance services fiverr – which has gained immense popularity in the country – has made some Pakistani accounts “unavailable” amid country-wide internet disruptions for the last many days.\n\nAccording to the freelancing platform, it took the action to ensure that the accounts were not affected by unexpected and unpreventable delays amid internet disruptions in Pakistan.\n\n“On August 1st, we temporarily set all gigs and availability status’ for our Pakistani sellers to unavailable, ensuring your ratings and success score were not impacted by factors outside of your control,” fiverr said in a message posted in the community notes.\n\nInternet services have been disrupted across Pakistan, with the exact cause yet to be identified, while X (formerly Twitter) remains blocked in the country for almost six months.\n\nNetizens have critcised the government for keeping mum on the issue amid buzz that the disruptions have been caused by a firewall being installed to allegedly monitor and keep a check on internet users.\n\nHowever, fiverr did not suspend Pakistani freelancers as was claimed by some social media users.\n\n“fiverr has not banned Pakistani accounts and neither has the platform officially said this anywhere. It only made accounts of those freelancers unavailable where there were some delays,” Ali Ahmad, a fiverr user, told Business Recorder.\n\n“Freelancers can make their accounts available again by following some steps,” Ahmad added.\n\nInternet disruptions in Pakistan are becoming increasingly common with some instances blamed on submarine faults. Additionally, blockage of websites, and internet ‘throttling’ have also caused massive losses to the IT sector.\n\nIn a statement on Thursday, the Overseas Investors Chamber of Commerce and Industry (OICCI) also warned that frequent internet disruptions in Pakistan “could derail” the country’s economic progress.\n\nThe OICCI said it has consistently advocated for a strong digital infrastructure as the backbone of Pakistan’s economic development.\n\n“However, frequent internet disruptions, such as the one currently affecting the nation, as highlighted by the Wireless and Internet Service Providers Association of Pakistan (WISPAP), threaten this vision. WISPAP has reported that, over the past few weeks, internet speeds have plummeted by 30-40%,” OICCI said in its post on X.\n\nThe statement was followed by the Pakistan Software Houses Association (P@SHA) stating in a press release that Pakistan’s economy could lose up to $300 million due to internet disruptions caused by imposition of a national firewall.\n\nAli Ihsan, senior vice chairman of P@SHA, said the issue had already caused prolonged internet disconnections and erratic VPN performance, threatening a “complete meltdown of business operations”.\n\nThe National Assembly’s Standing Committee on IT has also sought an explanation from Chairman of the Pakistan Telecommunication Authority (PTA), Hafiz Rehman, regarding the ongoing nationwide social media disruption.\n\nThe committee, chaired by Amin ul Haq, asked Rehman to provide reasons behind the disruption in social media services.\n\nThe committee also requested details about the nationwide internet service disruption and weak mobile signals.\n\nThe Attorney General of Pakistan has also been invited to the committee’s meeting, scheduled for August 21 at the Parliament House.", "publication_datetime": "2024-08-15T13:41:06+00:00", "lang": "en", "url": "https://www.brecorder.com/news/40317667/internet-disruptions-some-pakistani-freelancers-made-unavailable-on-fiverr", "source": {"domain": "brecorder.com", "location": null}}, {"uri": "0be5375c9aaa47089510e0323c270abf", "title": "Company Names Tribunal decision: GXO UK Logistics Ltd", "body": "Applicant GXO Logistics, Inc. objected to the name used by GXO UK Logistics Ltd under the Companies Act 2006.\n\nThis decision was undefended. ‘Undefended’ refers to decisions where there has been no defence in response to the application to the Company Names Tribunal.", "publication_datetime": "2024-08-15T13:41:04+00:00", "lang": "en", "url": "https://www.gov.uk/government/publications/company-names-tribunal-decision-gxo-uk-logistics-ltd", "source": {"domain": "gov.uk", "location": null}}, {"uri": "11d036bc757e405f8a9949c1b4a798a4", "title": "Грузовой поезд сошел с рельсов в российском регионе", "body": "A freight train derailed in the Orenburg region. Several train cars rammed a building located near the tracks, Baza reported on Telegram.\n\nAccording to the publication, everything happened near the Menovoy Dvor station in the Russian region. Emergency services were dispatched to the scene.", "publication_datetime": "2024-08-15T13:41:00+00:00", "lang": "ru", "url": "https://lenta.ru/news/2024/08/15/gruzovoy-poezd-soshel-s-relsov-v-rossiyskom-regione/", "source": {"domain": "lenta.ru", "location": null}}, {"uri": "f1a128d6594f485fbaf2a3116713b8ef", "title": "OFI chief Sarah Keane says new body needed if IABA don't cut ties with IBA", "body": "The president of the Olympic Federation of Ireland (OFI) has urged the Irish Athletic Boxing Association (IABA) to sever its links with the International Boxing Association (IBA).\n\n\n\nIndeed, Sarah Keane has suggested a new national boxing body may be needed if the IABA don’t depart the IABA and join World Boxing a newly established federation. \n\n\n\nSpeaking post the a successful Olympics, Keane revealed the OFI will withdraw recognition of the IABA as the national federation at the request of the International Olympic Committee (IOC) unless the IABA links up with World Boxing. \n\n\n\nIn 2019, the International Olympic Committee (IOC) banned the IBA because of issues over governance, finance, questionable refereeing and judging system.\n\n\n\nWorld Boxing was borne out of that, was formed by a breakaway group last year and launched with five key pillars: keeping  boxing at the heart of the Olympic movement; ensuring that the interests of boxers are put first; delivering sporting integrity and fair competition; creating a competition structure designed in the best interests of the boxers; operating according to the strongest governance standards and transparent financial management.\n\n\n\nSpeaking in Paris, Keane asked IABA would to try an persuade it’s members to vote for a move to World Boxing. \n\n\n\n“We have been asked as an Olympic committee to cease their membership in the coming months,” said Keane who confirmed the IOC had made this request.\n\n\n\n“Then it’s a case if you want boxing at the Olympic Games and if you want to support high performance you have to create a new national federation.\n\n\n\n“We will in the coming months have to say to the IABA we can’t recognise you as a National Olympic Committee anymore because the international federation is not recognised by the IOC.\n\n\n\n“From our perspective, we are very clear. We support World Boxing. We will have no choice but to comply with the IOC. We hope in the next couple of months that the IABA will ask its community a question so at least then we know how they feel. I hope people come out and make their voices heard. Then if they vote in favour of the change we will do everything we can to support them around that.\n\n\n\n“If they vote to stay part of the IBA then the only way that it is going to be possible for boxing to stay as part of the Olympic Games is for a new national federation to be recognised in some shape or form which takes on high performance and is recognised by world boxing. Then you can have boxing [for Ireland] in the Olympic Games.\n\n\n\n“For me, the situation is starting to simplify because it is starting to be about decisions,” said the outgoing president.\n\n\n\nThe powers that be in the IABA believe a link up with the World Boxing body is the way forwards and made moves to make it happen last year. \n\n\n\nThey tried to pass a special resolution that would have allowed them to vote on which body they would move forward with at an emergency EGM. \n\n\n\nAt the EGM, a 75% majority among the IABA delegates was required for the resolution to be passed.\n\n\n\nOf the 118 valid votes, 84 voted in favour, 24 against, the resolution falling just six votes short of the required amount.\nThe post OFI chief Sarah Keane says new body needed if IABA don’t cut ties with IBA appeared first on Irish Boxing.", "publication_datetime": "2024-08-15T13:40:50+00:00", "lang": "en", "url": "https://www.irish-boxing.com/ofi-chief-sarah-keane-says-new-body-needed-if-iaba-dont-cut-ties-with-iba/", "source": {"domain": "irish-boxing.com", "location": null}}, {"uri": "684a3e0a66544c8c83b05bc25953a112", "title": "Siracusa, legato e annegato: cagnolino trovato senza vita a Ognina", "body": "The news was reported by the Syracuse animal rights activist Ilaria Fagotto, who reached the place and decided to offer a large sum to anyone who can provide useful information to identify the individual who killed the animal in such a barbaric way.", "publication_datetime": "2024-08-15T13:40:45+00:00", "lang": "it", "url": "https://www.siracusanews.it/siracusa-legato-e-annegato-cagnolino-trovato-senza-vita-a-ognina/", "source": {"domain": "siracusanews.it", "location": null}}, {"uri": "394e605ae04344339294d0a1019ba232", "title": "В кранах тонкой струйкой, а в башне - прорыв. Обезвоженный поселок под Выборгом вторую неделю гремит канистрами", "body": "More than a thousand people in the Vyborg district of the Leningrad region were left without normal water supply, residents report. Allegedly, the water is turned off without warning, there is no hot water at all, cold water barely flows. Officials confirm the problem. Lenoblvodokanal is training steeplejacks, but the solution to the problem is deeper.\n\nResidents of the village of Gavrilovo, Goncharovsky settlement, complained about long interruptions in water supply on August 15. They say the problem has been going on since August 7th. Either there is no resource, or the pressure is weak; it does not reach the upper floors of the houses. There is no hot water at all. Previously, there were supposedly problems too, but they were eliminated within 1-2 days.\n\n– If water appears, it is only cold and the pressure is barely enough to reach the second floors. There are no announcements, no water supplies either. We have to collect water at a pump a kilometer from the house; we carry it in cans. And soon the children will be ready for school and kindergarten,” resident Natalya is indignant.\n\nThe head of the administration of the Gavrilovsky settlement, Andrei Simonov, confirmed to 47news that there is a problem. Water is periodically turned off in the entire village (there are more than a thousand residents, about 20 apartment buildings), last week, for example, for the whole day without warning. When there is a resource, it rises no higher than the 4th floor, “it goes in a thin stream”, since the pressure is weak. There are also 5-story buildings in the village.\n\n– Today there is another shutdown until 17:00, Lenoblvodokanal is changing the valves on the water supply line. But we managed to warn residents to stock up on water. When there are long outages, there is supply,” Simonov said.\n\nAccording to him, the village has a whole range of network problems, including a water tower leaking at a height of about 20 meters since February. In his opinion, it is impossible to repair it, since the metal has broken through on the side where there is a slope and cannot be approached on an aerial platform; scaffolding must be erected.\n\nLenoblvodokanal explained to 47news that a leak was discovered at the water tower in the village of Gavrilovo, repairs are needed, after which the pressure in the network will improve. Work is currently being prepared and will begin soon. But the event is complicated by work at height: training of equipment and specialists is required.\n\n“At the same time, the well in the village of Gavrilovo is currently owned and operated by Russian Railways OJSC; Lenoblvodokanal specialists are negotiating the transfer of the facility to the enterprise,” added Lenoblvodokanal.", "publication_datetime": "2024-08-15T13:40:00+00:00", "lang": "ru", "url": "https://m.47news.ru/articles/255767/", "source": {"domain": "m.47news.ru", "location": null}}, {"uri": "35e60c13dc254db5b8ba202f46ca6ccc", "title": "The Wall Street Journal: Zełenski wiedział o planach wysadzenia Nord Stream", "body": "Ukrainian President Volodymyr Zelensky knew about plans to blow up the Nord Stream gas pipeline, The Wall Street Journal reported, citing several unnamed sources in the military apparatus.", "publication_datetime": "2024-08-15T13:39:00+00:00", "lang": "pl", "url": "https://www.lrt.lt/pl/wiadomosci/1261/2339783/the-wall-street-journal-zelenski-wiedzial-o-planach-wysadzenia-nord-stream", "source": {"domain": "lrt.lt", "location": null}}, {"uri": "8e03ab5b23e5432ba15f82b6c6689a3b", "title": "Pela segunda vez, frigorífico em Afogados é flagrado furtando energia elétrica", "body": "The Aki Comércio de Carne slaughterhouse, located on Rua Vinte e Um de Abril, in Afogados, was discovered diverting electricity for the second time. Now, in a quantity sufficient to serve 2,439 homes for 30 days.\n\nThe irregularity was identified by Neoenergia Pernambuco after signs of fraud were found in the electricity measurement at the site. The first theft occurred in October last year, when the establishment diverted an amount of energy sufficient to supply more than 1000 homes for 30 days.\n\nAfter this second theft, all unmetered energy will be charged to the customer. Neoenergia also highlighted that the diversion of electrical energy is a crime and can result in imprisonment and fines.", "publication_datetime": "2024-08-15T13:38:16+00:00", "lang": "pt", "url": "https://www.cbnrecife.com/artigo/pela-segunda-vez-frigorifico-no-bairro-de-afogados-e-flagrado-furtando-energia-eletrica", "source": {"domain": "cbnrecife.com", "location": null}}, {"uri": "9dea8cf62c434373ac07baea92b594c0", "title": "Businesses are struggling to prepare for deepfake attacks", "body": "The threat of deepfake attacks has escalated rapidly in the last five years thanks to the advances and accessibility of Generative AI, new research has claimed.\n\nWith 90% of cybersecurity breaches being identity related, they are a cause for growing concern amongst businesses. Of those surveyed by , 47% of UK IT professionals have privacy concerns and 42% fear potential identity theft from using biometric authentication.\n\nSimilarly, iProov found that 70% of organizations believe deepfake attacks will have a high impact, but 62% worry their organization is not doing enough.\n\nDeepfake attacks digitally replicate a person’s likeness, and manipulate a face, voice, or body, and have become increasingly convincing and difficult to spot without proper equipment, and can even be broadcast in real time. In Hong Kong, a firm was into paying $25 million to cybercriminals who used deepfake technology to impersonate the company’s CFO in a video call.\n\nGetApp’s report found 92% of organizations who have used security measures found success with them, but as the technology has evolved and become more sophisticated, trust in these measures diminished, with 30% of respondents expressing significant concern for the potential for AI to be used for biometric identity fraud.\n\n“AI-generated attacks and deepfakes are provoking anxiety among companies but also action … Simpler vulnerabilities are often opening up UK businesses to cyber risks,” GetApp analyst David Jani said.\n\n“Therefore, it’s important not to get dazzled by newer, flashier attacks at the cost of ignoring the fundamentals of cyber protection.”\n\nInvestment in cybersecurity is key, yet 91% of IT professionals say budgetary constraints are an obstacle in identity management security. However, 81% of UK respondents report that their companies have invested in cybersecurity solutions in the last 18 months. Monitoring, training and awareness courses, and simulation exercises have been used to help employees spot the signs and help prevent fraud.\n\nTo help keep your personal information safe, we’ve listed the best for families.\n• Take a look at our best ransomware protection software\n• We’ve also rounded up the best endpoint protection tools around\n• Protecting digital integrity in the age of deepfakes and identity fraud", "publication_datetime": "2024-08-15T13:37:47+00:00", "lang": "en", "url": "https://www.derektmckinney.com/businesses-are-struggling-to-prepare-for-deepfake-attacks/", "source": {"domain": "derektmckinney.com", "location": null}}, {"uri": "164debfa7d5543be8ee534743dc1106e", "title": "'Meu carro custa um milhão', diz dono de Porsche após agredir entregador em BH", "body": "\"You're rubbish, my car costs R$1 million.\" The phrase was said by a resident of the Santa Inês neighborhood, in the eastern region of Belo Horizonte, moments after he crashed his Porsche into an app delivery man's motorcycle and then attacked the worker, last Wednesday afternoon ( August 14). The entire crime was filmed by security cameras from nearby establishments.\n\nThe traffic accident, followed by the crimes of aggression and damage, happened around 2pm on Rua Carmésia, in front of the suspect's house. The 24-year-old motorcyclist had just parked the vehicle and went to the customer's door. Soon after, the driver, who was not identified, backed out of the garage. Despite the sensors to prevent crashes during maneuvers in this vehicle model, the suspect appears to ignore the signals and crashes into the motorcycle.\n\nAccording to the Military Police (PM), the victim reported that, after getting out of the car, already excited, the driver knocked over his motorcycle as he approached to see the condition of the vehicles after the crash. Then, the owner of the luxury car starts dragging the motorcycle, in addition to punching and kicking the worker.\n\nThe attacks only stopped after residents of the neighborhood warned that they were filming everything, however, he then took the delivery man's cell phone so that he wouldn't call the police.\n\nBefore starting the car and fleeing the scene before the arrival of the vehicle, according to the record made by the PM, the driver of the car started shouting that the motorcyclist was \"trash\", adding that his car cost \"R$ 1 million\".\n\nAfter the Porsche driver escaped, the motorcycle courier received support from other residents, who even provided the driver's address, telephone number and details so that he could register a police report.", "publication_datetime": "2024-08-15T13:37:45.308000+00:00", "lang": "pt", "url": "https://www.otempo.com.br/cidades/2024/8/15/-meu-carro-custa-um-milhao---diz-dono-de-porsche-apos-agredir-en", "source": {"domain": "otempo.com.br", "location": null}}, {"uri": "121cf7721dde4d7381c3d2c19eb9cfb7", "title": "Multi-national food company fined £360,000 after worker loses fingers - Food & Drink International", "body": "A multi-national food company has been fined more than £300,000 after one of its workers lost four fingers on his right hand while unblocking a machine at a site in Glasgow.\n\nKerry Ingredients (UK) Limited received the fine following an incident at its factory in Hillington on 4 August 2021. The 39-year-old man was working on a mixer at the site, where dry seasoning blends and mixes are manufactured for the food industry.\n\nDuring the mixing process the machine began to develop a blockage, which the worker attempted to clear by inserting his right hand into the machine. However, as he did so, it came into contact with the rotating blades which resulted in the amputation of four of his fingers. Since the incident, the man has had to re-learn how to do everything with his left hand.\n\nAn investigation by the Health and Safety Executive (HSE) established that there were no fixed guards preventing access to the blades from the underside. It also found there were not any interlocked guards which would stop the rotating parts if any component on the underside of the mixer were to be removed.\n\nKerry Ingredients (UK) Limited of Bradley Road, Bristol pleaded guilty on 26 July 2024 to a contravention of The Provision and Use of Work Equipment Regulations 1988, Regulations 11(1) and (2) and the Health and Safety at Work etc. Act 1974, Section 33(1)(c). At a further hearing on 8 August 2024, the company was fined £360,000.\n\nHSE principal inspector Hazel Dobb said: “This incident could so easily have been avoided by simply carrying out correct control measures and safe working practices.\n\n“Companies should be aware that HSE will not hesitate to take appropriate enforcement action against those that fall below the required standards.”", "publication_datetime": "2024-08-15T13:37:08+00:00", "lang": "en", "url": "https://www.fdiforum.net/mag/health-safety/multi-national-food-company-fined-360000-after-worker-loses-fingers/", "source": {"domain": "fdiforum.net", "location": null}}, {"uri": "fd2aaf9d6fca44ccb0fc7a89f360ec0b", "title": "X’s New AI Image Generator Will Make Anything: Controversy Sparks Over Unrestricted Content Creation", "body": "Sonos, the popular audio electronics company known for its high-quality speakers, has laid off approximately 100 employees, representing around 6% of its workforce. The cuts come during a...", "publication_datetime": "2024-08-15T13:36:43+00:00", "lang": "en", "url": "https://techstory.in/xs-new-ai-image-generator-will-make-anything-controversy-sparks-over-unrestricted-content-creation/", "source": {"domain": "techstory.in", "location": null}}, {"uri": "08b6ef04869944ad8b68225f00c59791", "title": "Lack of experienced leadership is at the heart of Asda’s struggles", "body": "Ged Futter, partner at The Retail Mind and former senior buying manager at Asda, examines why the supermarket is continuing to flounder\n\nI had an early start on Wednesday to be on Wake up To Money. Alarm at 5.20am, on air after 5.30am followed by the Today programme at 6.20am and then Good Morning Scotland on BBC Radio Scotland. It was all to discuss one thing: Asda, and what has gone wrong?\n\nDon’t forget that Asda have been losing share for over 10 years, and not just the past four. The supermarket has had three CEOs in the past 14 years, and only one, Sean Clarke, maintained market share. Under the other two Asda lost share.\n\nAsda have not had a CEO since Roger Burnley left three years ago. Roger has a lifetime of experience of multiple retailers. Since then Mohsin Issa has been at the helm – an experienced retailer, maybe, but with no experience of running a behemoth like Asda.\n\nRunning a multiple retailer will be like running an aircraft carrier: complicated, with lots of moving parts, people and processes. Running a petrol forecourt business, on the other hand, will be like running a speedboat: easier to manoeuvre, and with fewer moving parts. Just because you can drive a speedboat, it doesn’t mean you have the skills to drive an aircraft carrier.\n\nIn the past two years Asda has rebranded Smart Price into Just Essentials (May 2022), launched its own loyalty card called Asda Rewards (August 2022), bought 132 Co-op forecourt sites (August 2023), bought 356 EG UK stores (August 2023) and relaunched Extra Special as Exceptional (now).\n\nAdd in Project Future – billed by Asda as Europe’s largest IT transformation project (with an £800m spend) – and you have a lot of reasons to take your eye off the ball. Tesco and JS have done none of the above – they have had the same, experienced, CEOs and have a clear vision of what they are doing and where they are going. Asda have forgotten that retailing is about the basics of stores, price and availability.\n\nI was in an Asda yesterday and availability in chilled, produce and frozen was appalling. One of the chilled Special Offer cabinets was as bad as I have ever seen. It was a dumping ground with shelves that clearly needed a clean. The level of fill in Frozen was at an absolute minimum, which not only looks bad but is also very inefficient for the freezers! Frozen promotional ends were half empty.\n\nAsda have been busy recruiting big hitters for every possible senior role, some just starting, and others not until next year. A new CEO will be six months away at least, and even Stuart Rose has said there won’t be one until next year. This leaves a vacuum in key leadership roles at a time when their competitors have their foot on the accelerator.\n\nAsda can be fixed. It has been done before and it was amazing being part of it. Being part of a business when it goes from being broken to being fixed is a huge learning opportunity and it requires a mindset that is focused and positive. Fixing the basics will be a start but I don’t think the £30m Asda have put aside for more store hours will be anything like enough. It’s not just hours, it is the stores themselves.\n\nIt is a long road ahead but I am willing Asda to be better than it is. The market needs another strong retailer.", "publication_datetime": "2024-08-15T13:36:42+00:00", "lang": "en", "url": "https://www.fruitnet.com/fresh-produce-journal/lack-of-experienced-leadership-is-at-the-heart-of-asdas-struggles/261861.article", "source": {"domain": "fruitnet.com", "location": null}}, {"uri": "8e95fac1411a4d9aa36555d8dcbc17fa", "title": "EasyJet cancels flights to Portugal as cabin staff kick off three-day strike", "body": "LISBON (Reuters) - EasyJet said it cancelled more than 200 flights to and from Portugal from Thursday as cabin crew based in the country began a three-day strike over working conditions including rotas and overtime.\n\nThe dispute will disrupt travel to and from Portugal at the height of the summer season.\n\nFlight staff union SNPVAC, which called the strike, said more than 90% of Portuguese cabin crew walked out on Thursday. EasyJet put the figure at 73% so far but said that could increase as most of the flights operate in the afternoon.\n\nThe airline said it had been forced to cancel 232 of the 1,138 flights to and from Portugal that had been scheduled to operate over the three-day period of the strike.\n\nSNPVAC said the strike was due to a dispute over a lack of roster stability, insufficient staffing and pressure to work overtime for commercial purposes.\n\n\"The workers are unhappy with the schedules instability. For example, I don't know if I'll be working at 5 a.m. or 5 p.m. tomorrow. I can't even plan my family life around the clock,\" said union representative Ana Dias.\n\nThe number of foreign tourists visiting Portugal rose 7.5% between January and June from a year earlier, paving the way for another record year, with Britons the biggest group in the first half of the year, closely followed by visitors from the United States.\n\nAt the height of the busy summer season, Portugal's government has decreed the need for minimum services during the strike, which should include flights to the Atlantic archipelago of Madeira, Geneva, Luxembourg and London.\n\nEasyJet has 19 aircraft based in Portugal and more than 800 employees there.", "publication_datetime": "2024-08-15T13:36:16+00:00", "lang": "en", "url": "https://ca.finance.yahoo.com/news/easyjet-cancels-flights-portugal-cabin-133616466.html", "source": {"domain": "ca.finance.yahoo.com", "location": null}}, {"uri": "de6e4793f8f7438fbb786e5ad1f90cb2", "title": "EasyJet cancels flights to Portugal as cabin staff kick off three-day strike", "body": "LISBON (Reuters) - EasyJet said it cancelled more than 200 flights to and from Portugal from Thursday as cabin crew based in the country began a three-day strike over working conditions including rotas and overtime.\n\nThe dispute will disrupt travel to and from Portugal at the height of the summer season.\n\nFlight staff union SNPVAC, which called the strike, said more than 90% of Portuguese cabin crew walked out on Thursday. EasyJet put the figure at 73% so far but said that could increase as most of the flights operate in the afternoon.\n\nThe airline said it had been forced to cancel 232 of the 1,138 flights to and from Portugal that had been scheduled to operate over the three-day period of the strike.\n\nSNPVAC said the strike was due to a dispute over a lack of roster stability, insufficient staffing and pressure to work overtime for commercial purposes.\n\n\"The workers are unhappy with the schedules instability. For example, I don't know if I'll be working at 5 a.m. or 5 p.m. tomorrow. I can't even plan my family life around the clock,\" said union representative Ana Dias.\n\nThe number of foreign tourists visiting Portugal rose 7.5% between January and June from a year earlier, paving the way for another record year, with Britons the biggest group in the first half of the year, closely followed by visitors from the United States.\n\nAt the height of the busy summer season, Portugal's government has decreed the need for minimum services during the strike, which should include flights to the Atlantic archipelago of Madeira, Geneva, Luxembourg and London.\n\nEasyJet has 19 aircraft based in Portugal and more than 800 employees there.", "publication_datetime": "2024-08-15T13:36:16+00:00", "lang": "en", "url": "https://uk.finance.yahoo.com/news/easyjet-cancels-flights-portugal-cabin-133616466.html", "source": {"domain": "uk.finance.yahoo.com", "location": null}}, {"uri": "aec1fa459a90411189f15dab6e5820f4", "title": "EasyJet cancels flights to Portugal as cabin staff kick off three-day strike", "body": "LISBON (Reuters) - EasyJet said it cancelled more than 200 flights to and from Portugal from Thursday as cabin crew based in the country began a three-day strike over working conditions including rotas and overtime.\n\nThe dispute will disrupt travel to and from Portugal at the height of the summer season.\n\nFlight staff union SNPVAC, which called the strike, said more than 90% of Portuguese cabin crew walked out on Thursday. EasyJet put the figure at 73% so far but said that could increase as most of the flights operate in the afternoon.\n\nThe airline said it had been forced to cancel 232 of the 1,138 flights to and from Portugal that had been scheduled to operate over the three-day period of the strike.\n\nSNPVAC said the strike was due to a dispute over a lack of roster stability, insufficient staffing and pressure to work overtime for commercial purposes.\n\n\"The workers are unhappy with the schedules instability. For example, I don't know if I'll be working at 5 a.m. or 5 p.m. tomorrow. I can't even plan my family life around the clock,\" said union representative Ana Dias.\n\nThe number of foreign tourists visiting Portugal rose 7.5% between January and June from a year earlier, paving the way for another record year, with Britons the biggest group in the first half of the year, closely followed by visitors from the United States.\n\nAt the height of the busy summer season, Portugal's government has decreed the need for minimum services during the strike, which should include flights to the Atlantic archipelago of Madeira, Geneva, Luxembourg and London.\n\nEasyJet has 19 aircraft based in Portugal and more than 800 employees there.", "publication_datetime": "2024-08-15T13:36:16+00:00", "lang": "en", "url": "https://www.marketscreener.com/quote/stock/EASYJET-PLC-10093880/news/EasyJet-cancels-flights-to-Portugal-as-cabin-staff-kick-off-three-day-strike-47663559/", "source": {"domain": "marketscreener.com", "location": null}}, {"uri": "b80322f9293a45f69e5d3b2adf7e5b6f", "title": "Ростехнадзор приостановил работу добывающих предприятий ЮГК из-за нарушений", "body": "The Ural Department of Rostechnadzor issued a resolution on an administrative offense against PJSC Yuzhuralzoloto Group of Companies due to improper conduct of mining operations. The organization was sentenced to suspend gold production at four quarries in the Chelyabinsk region for 90 days. The press service of the department reports this.\n\nViolations were detected at the Yuzhny Kurasan, Bereznyakovsky, Svetlinsky and Kurasan fields. Inspectors found “deformation of sides, ledges and dumps in the form of landslides.”\n\n“Possible restrictions of Rostechnadzor relate only to mining, not gold production. Even if ore mining in the Chelyabinsk hub will not be carried out in full for some time, factories will produce gold from ore reserves in warehouses. We are in active dialogue with supervisory authorities and are working to eliminate Rostechnadzor’s comments. Some of them were liquidated during the inspections, some will be liquidated as soon as possible,” the SGC previously commented.\n\nAs Kommersant-Southern Ural reported, the prosecutor's office of the Chelyabinsk region stated in July that after inspections at the deposits, more than 15 administrative cases were opened against Yuzhuralzolota due to environmental violations. In addition, claims were filed in the courts for damages, as well as for a ban on the operation of tailings dumps in the Plastovsky and Verkhneuralsky regions.", "publication_datetime": "2024-08-15T13:36:14+00:00", "lang": "ru", "url": "https://www.kommersant.ru/doc/6893582", "source": {"domain": "kommersant.ru", "location": null}}, {"uri": "f3a96bf8cd354d1ab55c16dba7f224e6", "title": "Disney Stands by “Preposterous” Defense Against Death Lawsuit at Theme Park Resort", "body": "Disney is standing by its controversial defense against a wrongful death lawsuit levied against the company.\n\nRelated: Disney World To Replace Half of Magic Kingdom by Next Year, Confirms Construction\n\nJeffrey Piccolo sued The Walt Disney Company as well as Raglan Road Pub and Irish Restaurant, an eatery located at Disney Springs in Walt Disney World, after his wife died from severe food allergies. The incident occurred last year, with Piccolo and Disney entering the spotlight due to the company’s rather controversial response to the lawsuit, claiming Piccolo’s Disney+ account bars him from pursuing a court settlement.\n\nDisney is arguing that Piccolo’s wrongful death lawsuit should be halted and sent to arbitration instead because Piccolo signed up for a Disney+ account and an account for the My Disney Experience theme park app.\n\nAccording to the terms of service for these two applications, Disney says users agree to cases being moved to arbitration, potentially keeping Piccolo from being granted a full jury trial.\n\nRelated: Disney Bans Phones From Theme Park Locations, Rolls Out New Warnings for Guests\n\nDr. Kanokporn Tangsuan was visiting the Walt Disney World Resort with her spouse, Jeffrey Piccolo, and mother-in-law, Jackie Piccolo. The group arrived at Raglan Road Irish Pub, one of many restaurants featured at Disney Springs, Disney’s outdoor shopping and entertainment district.\n\nDr. Tangsuan passed away shortly after their meal due to an allergic reaction despite reportedly taking precautions to avoid specific allergens in her food. Regarding Dr. Tangsuan’s death, The New York Times reports:\n\n“An autopsy by the District 9 medical examiner’s office in Orlando, Fla., determined that the cause of death was anaphylaxis, or a severe allergic reaction. The autopsy report notes Dr. Tangsuan’s reported history of allergies to dairy products and peanuts and said that she had used an EpiPen before becoming unresponsive. The manner of death was accidental, the report says.”\n\nJeffrey Piccolo is now suing Raglan Road and Walt Disney Parks and Resorts for damages of approximately $50,000. While Raglan Road is not officially owned and operated by Disney, Piccolo claims that Disney has “control and/or right of control” over the restaurant and its allergy protocols.\n\nRelated: Disney Not Moving Forward With Live-Action ‘Lion King’ Project, Issues Statement After Backlash In response, The Walt Disney Company claims Piccolo has no right to a standard judicial process and must go through with arbitration due to him signing up for Disney+. This stance has garnered a significant and overwhelming negative reaction within the Disney theme park community and online internet spaces like TikTok and Twitter/X. Disney has since defended its position after this backlash, per Florida Politics. “We are deeply saddened by the family’s loss and understand their grief,” Disney said in a new statement Wednesday. “Given that this restaurant is neither owned nor operated by Disney, we are merely defending ourselves against the plaintiff’s attorney’s attempt to include us in their lawsuit against the restaurant.”\n\nDisney attorneys stated further litigation “would only generate needless expenses and waste judicial resources.”\n\nA hearing for the case is scheduled in Orange Circut Court on October 2.\n\nStay tuned here at Inside the Magic for all Disney news updates.", "publication_datetime": "2024-08-15T13:36:04+00:00", "lang": "en", "url": "https://insidethemagic.net/2024/08/disney-stands-by-preposterous-defense-against-death-lawsuit-at-theme-park-resort-ld1/", "source": {"domain": "insidethemagic.net", "location": null}}, {"uri": "74c4ef7ccce34bc4b1473404f7d34b0a", "title": "Avião da Voepass teve falha no sistema antidegelo 6 vezes em 2023, diz jornal", "body": "See images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew members.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nSee images of the black boxes of the Voepass ATR-72, which crashed last Friday afternoon (9) in Vinhedo, in the interior of São Paulo. The aircraft came from Cascavel (PR) and was destined for Guarulhos Airport, in São Paulo. The 62 people on board died, 58 passengers and 4 crew.\n\nAirline states that it \"follows all operational and maintenance protocols regulated by the airline industry\"\n\nThe Voepass ATR-72 aircraft, which crashed last Friday (9) in Vinhedo (SP) leaving 62 people dead, had its de-icing system inoperative on at least six occasions in July last year, according to reports obtained by the newspaper “THE GLOBE”.\n\nAccording to the report, in at least one of these incidents there was a technical recommendation not to fly to the southern region of the country, precisely to avoid an area more prone to adverse weather conditions, and the guidance was not followed.\n\nAccording to a study carried out by the Satellite Image Analysis and Processing Laboratory (Lapis) at the Federal University of Alagoas (Ufal), the aircraft faced severe weather conditions for almost 10 minutes before crashing in Vinhedo. According to the study, the ATR-72 entered an area with high ice formation, winds of 60 to 70 km/h and high, frozen clouds, with temperatures of around –40°C.\n\nAviation experts point out that problems with the functioning of the deicing system are among the possible causes that may have contributed to the accident. In a note to CNN, Voepass stated that the company follows all operational and maintenance protocols regulated by the airline industry.\n\n“VOEPASS Linhas Aéreas reaffirms that, on August 9 of this year, the aircraft had the deicing system operational and the aircraft was airworthy and able to carry out the flight, within the established legislation”, he adds.\n\nThe reports obtained by “O GLOBO” show that inspections detected the problem in the aircraft's deicing system at the bases in Ribeirão Preto (SP), Porto Alegre (RS) and Congonhas (SP).\n\nOn July 13 last year, the person responsible for maintenance in Ribeirão Preto stated that the aircraft had “ice restrictions” and recommended that the crew should “avoid sending the plane to the South”. However, on the same day, the plane continued to Porto Alegre, where maintenance once again pointed out that the plane's deicing system was inoperative, in addition to having a broken windshield wiper and a failure in the approach warning system. on soil.\n\nThe following day, before the twin-engine aircraft embarked for Congonhas, the report only indicated “ice restriction”, which could indicate that the other systems had been repaired. On the same day, still in Congonhas, maintenance again warned of “ice restrictions — avoid sending to the South region”.\n\nThe reports indicate that, four days later, the aircraft was in Congonhas with the deicing system and electrical generator inoperative. At the end of the same day, the ATR-72 underwent another inspection in Ribeirão Preto, which again showed that the de-icing system and the electrical generator were inoperative.\n\nAsked about the reports, Voepass told CNN that “this type of maintenance is part of the routine of all airlines in the world”, and reinforced that it follows all operational protocols.\n\nThe Brazilian Air Force (FAB), the Federal Police and the Civil Police of São Paulo continue to investigate what led to the plane crash. In total, 62 people died, 58 passengers and 4 crew.", "publication_datetime": "2024-08-15T13:36:00+00:00", "lang": "pt", "url": "https://www.cnnbrasil.com.br/nacional/aviao-da-voepass-teve-falha-no-sistema-antidegelo-6-vezes-em-2023-diz-jornal/", "source": {"domain": "cnnbrasil.com.br", "location": null}}, {"uri": "5da8d148a6f24ff8ad1c5fc443ec739f", "title": "Russia sentences American-Russian woman Ksenia Karelina to 12 years in prison", "body": "Former ballerina Ksenia Karelina, who holds dual United States-Russian citizenship, was sentenced on Thursday to 12 years in a penal colony for allegedly trying to raise money for the Ukrainian military.", "publication_datetime": "2024-08-15T13:35:50+00:00", "lang": "en", "url": "https://www.upi.com/amp/Top_News/World-News/2024/08/15/Ksenia-Karelina-sentenced-12-years/8501723725225/", "source": {"domain": "upi.com", "paywall": false, "location": null}}, {"uri": "3ec310f9e7124f509ada772921e8a9b9", "title": "Starbucks names new CEO after Gaza war boycott hits sales", "body": "Starbucks said on Tuesday that Brian Niccol, chief executive at Chipotle, would be the coffee chain's new CEO - just over a year after current boss Laxman Narasimhan took over the role.\n\nNarasimhan steps down as chief executive and as a member of the Starbucks board \"with immediate effect,\" said the company in a statement.\n\nStarbucks shares were around 21 percent higher in early afternoon trading, while Chipotle Mexican Grill shares fell by about eight percent.\n\nThe leadership shifts come as Starbucks pushes to turn around its business while contending with broad-based sales declines in its most recent financial results after the company faced a global boycott campaign amid the war on Gaza.\n\nStarbucks had cited \"weakening consumer sentiment\" and \"tough market conditions\" as factors in its troubles.\n\nThe global outrage towards Starbucks emerged in the wake of Israel's war on Gaza, which has killed over 40,000 people in the past ten months and has been described as a genocide by leading rights experts.\n\nThe company has also been contending with pressure from activist fund Elliott Investment Management, which took a stake in the chain and had been seeking ways to boost the share price.\n\nThe coffee giant is working meanwhile to finalise contracts with unionised stores.\n\nLynne Fox, president of the Workers United union, said in a statement on Tuesday: \"We look forward to continuing to work with Starbucks to resolve massive outstanding litigation and reach fair collective bargaining agreements in the coming months.\"\n\n\"The replacement of Laxman Narasimhan as Starbucks CEO is the result of growing dissatisfaction, particularly from activist investors, over the way the chain has been run,\" said Neil Saunders, managing director at GlobalData, in a statement.\n\n\"While some of the slowdown can be attributed to a more sluggish consumer cutting back, much is also the result of a worsening store experience and a lack of innovation in areas like food,\" he added.\n\nInvestors could be hoping for improvements in day-to-day operations by bringing Niccol on board.\n\n\"Brian is a culture carrier who brings a wealth of experience and a proven track record of driving innovation and growth,\" said Starbucks board chair Mellody Hobson in a statement as the company announced the leadership changes.\n\nNiccol has served as Chipotle's CEO since 2018.\n\nIn naming him Starbucks' new CEO, the company noted that his work at Chipotle had \"driven significant growth and value creation,\" citing revenue that has nearly doubled and higher profit.\n\nNarasimhan, a veteran of PepsiCo and other consumer brands, had taken over the top spot in 2023 after a period working with longtime Starbucks CEO and interim boss Howard Schultz.\n\nThe statement noted that Narasimhan, during his tenure, drove innovation in the brand's supply chains and boosted its store operations.\n\nNiccol will start in his new role on September 9, with Starbucks chief financial officer Rachel Ruggeri serving as interim CEO until then.", "publication_datetime": "2024-08-15T13:35:34+00:00", "lang": "en", "url": "https://www.newarab.com/news/starbucks-names-new-ceo-after-gaza-war-boycott-hits-sales", "source": {"domain": "newarab.com", "location": null}}, {"uri": "afd49c2f7ec946d8a50f7a002479f304", "title": "Vols... à volonté: la «pire» compagnie aérienne lance un forfait illimité", "body": "“In case you are unable to select your preferred airport, please note that the limit has been reached and Wizz Air is unfortunately not able to offer you a Wizz All You Can Fly subscription at this time,” the statement said. the company on its website.", "publication_datetime": "2024-08-15T13:35:30+00:00", "lang": "fr", "url": "https://www.tvanouvelles.ca/2024/08/15/vols-a-volonte-la-pire-compagnie-aerienne-lance-un-forfait-illimite", "source": {"domain": "tvanouvelles.ca", "location": null}}, {"uri": "3a9cc3139b8e4c1990b3140d5891d636", "title": "Calciomercato Palermo, nuovo nome all'orizzonte per l'attacco dei rosanero", "body": "Allende, who has an Italian passport, arrived in Europe last January, signing a contract until 2028 with Celta Vigo, a La Liga club for which he made 10 appearances, scoring one goal. In the past he also wore the shirts of Godoy Cruz and Instituto ACC.", "publication_datetime": "2024-08-15T13:35:16+00:00", "lang": "it", "url": "https://www.calcioweb.eu/2024/08/calciomercato-palermo-nuovo-nome-attacco-rosanero/10684890/", "source": {"domain": "calcioweb.eu", "location": null}}, {"uri": "bed3ea8fbedc43358a37549c54e2b351", "title": "Business Finland reports financial crimes to Chinese authorities", "body": "Business Finland discovered the suspected crimes in may of this year.\n\nThe trade promotion outfit had previously said it suspected an employee of financial misconduct in 2017-2018.\n\nBusiness Finland has file a criminal complaint with Shanghai police over suspected financial crimes that took place seven years ago.\n\nThe organisation suspects an employee of its Chinese subsidiary, FinChi, of financial crimes. The criminal complaint was confirmed to Yle by Marianne Asikainen, the organisation's Senior Director of Legal, Administration, Facilities and Compliance.\n\nBusiness Finland has previously said the losses amount to around one million euros, and were incurred in 2017-18. Asikainen did not offer the suspect's nationality.\n\nBusiness Finland first uncovered the suspected malfeasance in May.\n\nBusiness Finland is also working with U.S. authorities to investigate a former employee suspected of embezzling four million euros of Finnish taxpayers' money for personal luxuries.", "publication_datetime": "2024-08-15T13:35:03+00:00", "lang": "en", "url": "https://yle.fi/a/74-20105270", "source": {"domain": "yle.fi", "location": null}}, {"uri": "0716f3a97b5649648e3a7bbb8a25b8e8", "title": "Must-Read Stock News On Cisco, Alphabet, and More", "body": "The networking firm said that it would cut 7% of its staff, or 6,300 employees globally. \n\nIn its fourth quarter ended July 27, 2024, Cisco earned 87 cents a share. Revenue topped $13.64 billion. Splunk added $960 million to those results.\n\nAmong the Magnificent 7, Alphabet (GOOG) has the highest risks—the stock risks facing higher selling pressure as markets price in the risks of a breakup. Last week, the courts ruled that Google operated anti-competitive. Fearful investors may recall that Microsoft’s antitrust case loss prevented it from growing for several decades.\n\nAlphabet will need to prove that Apple (AAPL), Amazon (AMZN), and Meta Platforms (META) are just as big. Their presence prevents Google from acting as a monopoly.\n\nOn Wednesday, a judge said that he plans to force the firm to give Android users more ways to download apps.\n\nElsewhere in the litigation front, Johnson & Johnson (JNJ) may show its support for a $6.48 billion offer to settle its Baby Powder and talc product case. The products are thought to cause cancer.\n\nJNJ shares bottomed at around $145 between April and July. It closed at $158.48, 9.75% below its 52-week high.", "publication_datetime": "2024-08-15T13:35:00+00:00", "lang": "en", "url": "http://www.baystreet.ca/articles/stockstowatch/101342/Must-Read-Stock-News-On-Cisco-Alphabet-and-More", "source": {"domain": "baystreet.ca", "location": null}}, {"uri": "acda99d90fe84e6c8fa101f0d301b055", "title": "Port Operator Profits Fall 60 Per Cent, Red Sea Attacks Blamed", "body": "DUBAI, United Arab Emirates (AP) – Dubai-based port operator DP World reported Thursday its half-year profits fell by nearly 60%, in part over the ongoing attacks by Yemen’s Houthi rebels over the Israel-Hamas war that have affected shipping through the Red Sea.\n\nDP World reported profits of $265 million this year, down from $651 million the same time last year. DP World Group’s chairman and CEO, Sultan Ahmed bin Sulayem, acknowledged that the Red Sea disruptions affected the firm’s revenues.\n\n“The year 2024 has been marked by a deteriorating geopolitical environment and disruptions to global supply chains due to the Red Sea crisis,” he said in a statement included in the results. “While the near-term trading outlook remains uncertain due to macroeconomic and geopolitical headwinds, the resilient financial performance of the first half … positions us well to deliver stable full year adjusted” profits.\n\nBin Sulayem did not elaborate on what specific effects the Houthi attacks had been having on DP World, a government-owned shipper that in recent years removed itself from the Nasdaq Dubai stock exchange.\n\nThe Houthis since November have been targeting shipping through the Red Sea corridor over the Israel-Hamas war in the Gaza Strip. The assaults have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\n\nThe rebels maintain that their attacks target ships linked to Israel, the United States or the U.K. as part of a campaign they say seeks to force an end to the war. However, many of the ships attacked have little or no connection to the conflict.\n\nShippers have begun going around the Cape of Good Hope off Southern Africa to avoid the Red Sea entirely. The rerouting has affected shipping through Dubai’s Jebel Ali Port, the home of DP World and the world’s largest manmade harbor.\n\nDP World already had faced challenges through the coronavirus pandemic, but the Houthi attacks have seen it affected while the long-haul carrier Emirates, another Dubai government-owned entity, have soared.", "publication_datetime": "2024-08-15T13:34:04+00:00", "lang": "en", "url": "https://www.breitbart.com/europe/2024/08/15/port-operators-profits-fall-60-per-cent-red-sea-attacks-blamed/", "source": {"domain": "breitbart.com", "paywall": false, "location": null}}, {"uri": "00ca92e40ac944d994168b4f0c789972", "title": "InDrive blames GPS glitches and passenger network for 'ridiculous' fares", "body": "Following a desperate cry by drivers condemning what they termed “ridiculous” trip fares on its app, leading ride-hailing company, InDrive has blamed the situation on GPS glitches and passenger network issues. The company’s public relations manager, Lineo Thakhisi disclosed this in response to a Technext inquiry into the matter.\n\nTechnext had reported earlier that drivers were bashing the company for the unbelievably low fares.\n\nIn one order seen, a rider offered the sum of 2,000 naira for a trip from in to . As estimated on the app, the trip distance is 38.6 kilometres and is estimated to last an hour and two minutes. Yet, the fare is not enough for three litres of fuel.\n\nSimilarly, another ride from 146 Lagos-Epe Express Road to Ogba Magistrate Court, a distance of 37.8 kilometres with an estimated travel time of one hour and three minutes was ordered for 2,000 naira. Furthermore, another 30-kilometre trip that is expected to last an hour and 19 minutes was ordered for a fare of 4,000 naira. The cases are endless.\n\nResponding, the InDrive PR manager, Lineo said the company is aware of the issues and that they are rare, only affecting one per cent of trips.\n\n“ We are aware of recent reports about potential issues with trip orders and want to clarify that many of these concerns may stem from GPS glitches or passenger network issues. Given the scale of our operations, with hundreds of thousands of orders daily, these glitches are rare, affecting less than 1% of our trips ,” Lineo said.\n\nSee also: N2,000 from VI to Egbeda: Drivers slam InDrive for offering ‘ridiculous’ fares\n\nHe said the company’s system is designed to protect drivers by allowing them to avoid unfair trips and bid for more profitable ones. The company also ensures that negotiations between drivers and passengers are balanced, preventing unreasonably low or high bids.\n\n“We continuously monitor feedback and external factors impacting our service, striving to maintain a smooth and reliable experience for all users. We are committed to providing a fair and transparent platform for our drivers and passengers,” the PR manager said.\n\nThe issue might be more serious than InDrive is admitting\n\nWhile InDrive’s response is tenable, it does not do enough to assuage drivers who have had to repeatedly deal with the same problem. The affected drivers, even if they are a random one per cent, would love to believe that they matter.\n\nSome drivers have complained that the issue is getting worse by the day.\n\n“ Someone needs to sue InDrive because it is becoming worse every day. Somedays I don’t even go out because of the ridiculous amount on the app. I only go out when I get offline. This is because it is of no use. If I venture on such a ridiculous trip, the entire money won’t even be enough for fuel alone .” Ola, a driver said.\n\nThe situation is prevalent enough for some drivers to ascribe it to passengers, a reasonable attribution given the harsh economic climate. A driver, Jeremiah penned a strongly-worded open letter on X where he demanded that InDrive stop giving passengers the power to make ridiculous bids on the app.\n\n“ Hello in drive, We wish to bring to your notice in case you are not in touch with our present situation in Nigeria and the current rise of goods and services. There is an increase in the price of fuel and also the cost of maintenance. Stop giving riders the power to make ridicule of our job to render this service. Drivers under this platform are rendering services moving your riders from one point to another safely ,” Jeremiah said.\n\nThe tweet has since attracted more complaints from other drivers.\n\nAnother driver echoed the same sentiment, although he felt the passengers were only happy to further reduce their fares:\n\n“ There has been a recent observation about a ridiculous fare price you input on the App and also giving riders the bargaining power of their own to lower the fare price which eventually put the drivers in a position of no option. This is to let you know that if nothing is done about this as soon as possible, do note that other notable platforms will heed the request of drivers on their platform (s) and do the needful about their pricing .”\n\nHopefully, InDrive will rectify the GPS anomaly. This is because as long as the issues persist, drivers involved with the 1 per cent affected at any point in time will feel ridiculed at the rather demeaning fares.", "publication_datetime": "2024-08-15T13:34:00+00:00", "lang": "en", "url": "https://technext24.com/2024/08/15/indrive-blames-glitches-ridiculous-fares/", "source": {"domain": "technext24.com", "location": null}}, {"uri": "cefd27cd535d4b3c883e65656c754e5e", "title": "Disney Issues Statement in Response to Motion for Wrongful Death Lawsuit Dismissal", "body": "Disney has released a new statement following recent reports of their seeking to dismiss a wrongful death lawsuit regarding a woman who passed away due to anaphylaxis after a meal at Disney Springs.\n\nPer The Hollywood Reporter, Disney stated late Wednesday night that it is “deeply saddened” by the loss of Kanokporn Tangsuan, who was a doctor at NYU Langone in New York City, but “stressed the [Raglan Road] Irish Pub is neither owned nor operated by the company.” Raglan Road is where Tangsuan had the meal that ultimately caused her allergic reaction.\n\nTangsuan’s husband, Jeffrey Piccolo, is the plaintiff in the wrongful death lawsuit on behalf of Tangsuan and her estate.\n\nRaglan Road did not respond to The Hollywood Reporter’s email request for comment. Great Irish Pubs Florida Inc. is also included in the wrongful death lawsuit.\n\nWhile Disney does not own Raglan Road, it does own Disney Springs, the shopping and entertainment district where the restaurant is located. Disney leases out space in the district to other companies to operate their businesses. The original lawsuit also notes that Disney “had control and/or right of control over the menu of food offered, the hiring and/or training of the wait staff, and the policies and procedures as it pertains to food allergies at Disney Springs restaurants.”\n\nOn the Walt Disney World official website, a disclaimer regarding allergy-friendly requests is included at the bottom of menu pages, including that for Raglan Road’s dinner menu:\n\nGuests must speak to a cast member about their allergy-friendly request. While we take steps to help mitigate cross-contact, we cannot guarantee that any item is completely free of allergens. Our allergy-friendly recipes may use highly refined oils, such as soybean oil, and/or ingredients that are processed in facilities that also process allergens. It is ultimately our Guests’ discretion to make an informed choice based upon their individual dietary needs. For more information about allergy-friendly requests, ask to speak with a Special Diets Trained Cast Member upon arrival at the location. * Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Our plant-based menu items are made without animal meat, dairy, eggs and honey.\n\nThis news follows the reports of Disney seeking to dismiss the wrongful death lawsuit based on an arbitration waiver included in the terms and conditions for Disney+, as well as purchasing Walt Disney World tickets through the My Disney Resort app. Disney claims Piccolo reportedly agreed to the Disney+ terms in 2019 when he signed up for a one-month trial of the streaming service on his PlayStation console, and in September 2023 when he used the My Disney Experience app to purchase tickets to visit EPCOT. Tangsuan passed away before she and Piccolo could visit the park.\n\nDisney stated in their motion that it is “immaterial” whether or not Piccolo actually reviewed the arbitration waiver in the terms he agreed to.\n\nAttorneys for Piccolo called the motion “absurd” and “surreal,” and have urged the court to not enforce the agreement.\n\nThe original incident occurred on October 5, 2023. Tangsuan and Piccolo visited Raglan Road with Piccolo’s mother, Jackie. Tangsuan informed the wait staff at the restaurant of her severe allergy to dairy and nuts and was “unequivocally assured” that the food would be allergen-free.\n\nTangsuan ordered vegetarian broccoli and corn fritters, a sea scallops appetizer, a vegan entree, and a side of onion rings. Piccolo returned to their hotel room after the meal, but Tangsuan and her mother-in-law remained at Disney Springs. Later that evening, Tangsuan suffered an acute allergic reaction in Planet Hollywood, where she had difficulty breathing and collapsed to the floor. She self-administered an EpiPen and was transported to a local hospital soon after, where she later died.\n\nA hearing has been scheduled on Disney’s latest motion in the wrongful death lawsuit for October 2 in Orlando, Florida. Piccolo seeks more than $50,000 in damages under the Florida Wrongful Death Act.\n\nFor the latest Disney Parks news and info, follow WDW News Today on Twitter, Facebook, and Instagram.", "publication_datetime": "2024-08-15T13:33:46+00:00", "lang": "en", "url": "https://wdwnt.com/2024/08/disney-statement-wrongful-death-lawsuit-dismiss/", "source": {"domain": "wdwnt.com", "location": null}}, {"uri": "f8a5afaeed774aa3892631dad9e55214", "title": "Protests across India escalate after rape and murder of doctor", "body": "Protests across India escalate after rape and murder of doctor\n\nHundreds of thousands of women marched through the night in cities across India to protest the brutal rape and murder of a young female doctor in a hospital in Kolkata.", "publication_datetime": "2024-08-15T13:33:24+00:00", "lang": "en", "url": "https://ca.news.yahoo.com/protests-across-india-escalate-rape-133324333.html", "source": {"domain": "ca.news.yahoo.com", "location": null}}, {"uri": "a84545cc7072407dbc2070ab1bed999b", "title": "Katy Perry Hits Back at Claim She Filmed 'Unauthorized' Video on Protected Dunes", "body": "Katy Perry has come out with a \"Dark Horse\" of a defense in her recent music video drama ... with her record label ponying up proof they were given the OK to film in the sensitive sand dunes of a protected area on a Spanish island.\n\nAfter the Spanish government kicked off a probe this week into KP's decision to film her \"Lifetimes\" music video on protected ground, Capitol Records hit back with a response ... saying they were given all the necessary permits to record at the dunes of S’Espalmador.\n\nPer a CR rep, there was one permit that was still lingering before production for the music video kicked off ... but they defend they were given verbal approval the day before shooting began on July 27.\n\nThey added ... \"We adhered to all regulations associated with filming in this area and have the utmost respect for this location and the officials tasked with protecting it.\"\n\nThis is a strikingly different stance from the Spanish government, whose environmental department for the Balearic Islands accused the music video's production company, WeOwnTheCity of not securing the proper paperwork to film on the famed dunes.\n\nThe dunes have been investigated for potential damage, with the area even being roped off. However, the department did clarify they do NOT consider the music video SNAFU a \"crime against the environment,\" just an infringement into their policy.\n\nIt's been a \"Hot N Cold\" summer for Katy, who faced controversy back in June for working again with controversial producer Dr. Luke on her forthcoming album\n\nKaty has ignored the drama for the most part ... but you can't bury your head in the sand forever.", "publication_datetime": "2024-08-15T13:33:12+00:00", "lang": "en", "url": "https://www.tmz.com/2024/08/15/katy-perry-sand-dunes-reaction/", "source": {"domain": "tmz.com", "paywall": false, "location": null}}, {"uri": "237c6fd1c8a94eb2a2077a06a7efe581", "title": "T-Mobile US-Aktie im Minus: T-Mobile US muss Millionenstrafe wegen Datenschutz-Problemen zahlen", "body": "According to the Cfius agency, which oversees foreign investments in the United States, T-Mobile US allowed unauthorized access to sensitive data in some cases between August 2020 and June 2021. According to the company, “a small number” of inquiries from investigative authorities were affected. There was no break-in into IT systems and the information was only accessible within the US security authorities.\n\nIt is unusual for Cfius (Committee on Foreign Investment in the United States) to name a company that has been fined. It is also the authority's highest penalty to date. It was imposed this year, the exact date was not mentioned when published.\n\nCfius pointed out that T-Mobile US did not report some violations quickly enough, which made the authorities' investigations more difficult. In a statement, T-Mobile spoke of technical problems in the course of its merger with the US mobile phone company Sprint. The problem was quickly resolved. The Deutsche Telekom subsidiary took over Sprint in 2020.\n\nThe T-Mobile US share is temporarily trading 0.51 percent lower at 195.48 US dollars in NASDAQ trading.", "publication_datetime": "2024-08-15T13:33:00+00:00", "lang": "de", "url": "https://www.finanzen.ch/nachrichten/aktien/t-mobile-us-aktie-im-minus-t-mobile-us-muss-millionenstrafe-wegen-datenschutz-problemen-zahlen-1033691009", "source": {"domain": "finanzen.ch", "location": null}}, {"uri": "c08543d720174e6d92e0f7cd387aab47", "title": "Lipno bude 10 dní plné sportu a hudby. Lidé porovnají síly s olympioniky - Metro.cz", "body": "Just a few days after the end of the Olympic Games in Paris, the 13th ČEZ Lipno Sport Festival in Lipně nad Vltavou na Českokrumlovsk. Potrvá od 16. do 25. srpna a nabídne rádő sportovních i kulturních akcí.", "publication_datetime": "2024-08-15T13:32:17+00:00", "lang": "sv", "url": "https://www.metro.cz/kraje/jihocesky-kraj/vylet-lipno-sport-festival-olympionici-koncerty.A240815_153217_metro-budejovice-zpravy_air#utm_source=rss&utm_medium=feed&utm_campaign=metroh&utm_content=main", "source": {"domain": "metro.cz", "location": null}}, {"uri": "588d27f275eb4be0acf92ac608e249d5", "title": "UN Says Has Asked Moscow For Access to Under-Fire Border Areas", "body": "The Ukrainian army entered the Kursk region on August 6, capturing dozens of settlements in the biggest offensive by a foreign army on Russian soil since World War II and forcing thousands to flee.", "publication_datetime": "2024-08-15T13:31:12+00:00", "lang": "en", "url": "https://en.newsdailyarabic.com/un-says-has-asked-moscow-for-access-to-under-fire-border-areas/", "source": {"domain": "en.newsdailyarabic.com", "location": null}}, {"uri": "b1a3f68563014b52816dbff2ef638635", "title": "Jackson men double up Lakefield to win annual Emerald Cup", "body": "The men from the Jackson Golf Club doubled up their counterparts from the Lakefield Golf Course this past weekend to win the Emerald Cup 48-24.\n\n The win cuts Lakefield’s lead in the series to 11-1...", "publication_datetime": "2024-08-15T13:31:09+00:00", "lang": "en", "url": "https://www.jacksoncountypilot.com/articles/jackson-men-double-up-lakefield-to-win-annual-emerald-cup/", "source": {"domain": "jacksoncountypilot.com", "location": null}}, {"uri": "1e3df53cfe6648c3a6608b4dac967771", "title": "100 rounds not out as Bubba claims LIV has changed face of golf - Irish Golfer Magazine", "body": "One hundred rounds later and LIV Golf shows no signs of going away as LIV Greenbrier gets underway on Friday.\n\nFrom a staggered beginning in London two years ago, the Saudi backed tour has held its own in golf’s landscape with $4million first prize cheques and a host of top class players mixed in with those who have had their time in the sun.\n\nOne of those players whose best days are long behind him is Bubba Watson who believes LIV Golf has changed the face of the sport and believes Scottie Scheffler’s winnings of $27.6 million is a testament to the financial impact LIV has had on the game.\n\n“Yeah, this is exciting times. When I think about going through the motions of deciding I wanted to come to LIV, I thought about the 10-year plan, on paper, what the goals were, and it’s met my expectations. It’s been better than that,” said Watson, a two time Masters winner.\n\n“We’ve changed the face of golf. So to be on that side of history is pretty special.\n\n“I know years ago when the PGA TOUR made that same decision, and when I’m saying years ago, we’re talking ’50s, ’40s, whatever year Arnold Palmer and Jack Nicklaus and them made the other tour, so we’re a part of that. It’s an honor and a privilege to say I’m a part of that. Scottie Scheffler has made a lot of money this year because of the changes that we’ve started putting in place.\n\n“I believe that golf is actually growing in the right spot, and I think team golf is here to stay. So I’m excited for the next few events, the next few years, and hopefully the RangeGoats can beat the Crushers.”\n\nUS Open champion Bryson DeChambeau became the second LIV golfer to win a major after Brooks Koepka won the US PGA Championship last year and the American believes the breakaway tour is close to exploding into life despite the fact the tournaments are not eligible to give away world ranking points.\n\n“I didn’t know where we would exactly be after 100 rounds, but I can tell you that the ideas behind it, especially when I was having conversations back in 2022 and whatnot with where this was going to go, I expected there to be a lot of progress, but the progress has been amazingly awesome, from everything that we’ve done, everything that each team has individually done, the players, what they’ve done to make this league what it is now today is quite impressive.\n\n“As I look at a five-year vision, 10-year vision, I just see this thing exploding here shortly.\n\n“When people start to see the true value that we’re bringing, that intrinsic value is only going to exponentiate over the course of time, which is what I’m excited for. I’m waiting for that kind of domino effect, for it to start falling in that cool direction that we see here on our side at LIV, especially with the team aspect.\n\n“It feels a lot like — it’s some of the highest level golf but you feel like you have a family out here and some really good friends that can help, I guess you could say, make everybody better. That’s what I’m excited to see is how that progresses, how it transforms, the sponsors that come in, the people that are a part of it, that want to be a part of it.\n\n“For me to see that potential out there, we’ve just got to get after it and get it because it’s all right there for the taking, and I’m super excited for these 100 rounds and how they’ve gone. Obviously I’ve won a couple, and the Crushers have done well, and we’ve won a team championship, and I’m super proud of the guys. That’s what we’ve set out to do.\n\n“But we want to keep doing that. We want Paul, Baan, Charles to keep pushing forward and I’ll keep doing my job, and that’s what I’m excited about, and hopefully it pushes these guys on other teams to keep pushing forward, as well.”", "publication_datetime": "2024-08-15T13:30:48+00:00", "lang": "en", "url": "https://irishgolfer.ie/latest-golf-news/2024/08/15/100-rounds-not-out-as-bubba-claims-liv-has-changed-face-of-golf/", "source": {"domain": "irishgolfer.ie", "location": null}}, {"uri": "19b8b4b11334444b8cab3ea2364c75e3", "title": "Karnataka Government orders withdrawal of deposits from SBI and PNB accounts amid fraud allegations", "body": "Bengaluru: In a decisive move, the Karnataka state government has ordered the immediate withdrawal of deposits held by government departments, public undertakings, corporations, boards, local bodies, universities, and other state-run institutions from accounts with the State Bank of India (SBI) and Punjab National Bank (PNB). The directive, issued with the approval of Chief Minister Siddaramaiah, comes in the wake of longstanding unresolved fraud cases and dissatisfaction with the response of these banks in addressing these issues.\n\nThe circular, signed by Finance Department Secretary Dr. PC Jaffer (Budget and Resources), clearly instructs all relevant entities to not only withdraw their deposits but also refrain from making any further deposit investments in these two banks. Deputy Chief Secretaries, Principal Secretaries, and Secretaries across all departments have been tasked with ensuring compliance with this directive.\n\nA stringent deadline has been set for the completion of this process. The circular mandates that all withdrawn deposits be documented in a prescribed annexure, which must include confirmation of account closure details. These documents are to be submitted to the Finance Department by September 20, 2024.\n\nThis sweeping order is rooted in serious financial mismanagement and fraud cases involving these banks that have dragged on for over a decade. For instance, the Karnataka Industrial Area Development Board (KIADB) had invested in a one-year fixed deposit with the Rajajinagar branch of PNB on September 14, 2011. The amount involved was significant, with one fixed deposit receipt amounting to Rs 12 crore and another to Rs 13 crore. While the Rs 13 crore deposit was encashed after the period expired, the other Rs 12 crore deposit has been embroiled in a fraud case allegedly perpetrated by bank officials. Despite numerous meetings and correspondences with the bank, the issue remains unresolved, and the case has languished in the courts for over 10 years.\n\nIn a similar case, the Karnataka State Pollution Control Board (KSPCB) had deposited Rs 10 crore in a fixed deposit with the Avenue Road branch of the then State Bank of Mysore (which later merged with SBI) in August 2013. Before the deposit matured, bank officials allegedly adjusted the money against a loan taken by a private company using forged documents. Despite multiple attempts by the KSPCB to recover the funds through meetings and correspondence, the bank refused to refund the money. This case, too, remains mired in legal proceedings.\n\nThe gravity of these incidents has been underscored by the Public Accounts Committee (PAC) of the Karnataka Legislative Assembly, where the Auditor General’s reports and objections have been hotly debated. The decision to withdraw deposits, restrict future investments, and close accounts with SBI and PNB is seen as a direct outcome of these discussions, which are recorded in the PAC’s meeting proceedings.\n\nThe circular highlights the government’s position by stating that the immediate withdrawal of all deposits and investments made by state government departments and associated institutions in all branches of SBI and PNB is non-negotiable. Furthermore, no further deposits or investments shall be made in these banks.\n\nThe directive extends to all offices, public enterprises, corporations, boards, local bodies, universities, and other institutions under the administrative control of various government departments. These entities are instructed to close all deposits and accounts held in SBI and PNB branches. The details of these accounts, along with confirmation of their closure, must be submitted to the Deputy Secretary to Government, Budget and Resources Branch, Finance Department, by September 20, 2024.", "publication_datetime": "2024-08-15T13:30:47+00:00", "lang": "en", "url": "https://organiser.org/2024/08/15/252042/bharat/karnataka-government-orders-withdrawal-of-deposits-from-sbi-and-pnb-accounts-amid-fraud-allegations/", "source": {"domain": "organiser.org", "location": null}}, {"uri": "c79f3ee70590457892885d06f079997d", "title": "Vinicy Chan and Kiel Porter", "body": "XPO has revived a sale of its European transportation business, according to people familiar with the matter, almost two years since it last scrapped the attempt to divest the operation.", "publication_datetime": "2024-08-15T13:30:46+00:00", "lang": "en", "url": "https://www.ttnews.com/authors/vinicy-chan-and-kiel-porter", "source": {"domain": "ttnews.com", "location": null}}]